{"data":[
    {
        "indexid":1013,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1013,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1013,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1013,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1013,
        "wordid":2189,
        "word":"اعْبُدُوا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word اعْبُدُوا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":1013,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1013,
        "wordid":2513,
        "word":"يَاقَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word يَاقَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1013,
        "wordid":3330,
        "word":"أَرْسَلْنَا",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word أَرْسَلْنَا comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1013,
        "wordid":3753,
        "word":"عَذَابَ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابَ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":1013,
        "wordid":4280,
        "word":"يَوْمٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1013,
        "wordid":4896,
        "word":"إِلَهٍ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word إِلَهٍ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1013,
        "wordid":5377,
        "word":"لَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word لَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1013,
        "wordid":5429,
        "word":"عَظِيمٍ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عَظِيمٍ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":1013,
        "wordid":6732,
        "word":"أَخَافُ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word أَخَافُ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":1013,
        "wordid":7555,
        "word":"قَوْمِهِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمِهِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1013,
        "wordid":8225,
        "word":"نُوحًا",
        "rootid":194,
        "rootword":"ن و ح",
        "meanings":"Noah\/Nuh. To lament, wail, coo.",
        "sentence":"The word نُوحًا comes from the root ن و ح and is associated with the meanings: Noah\/Nuh. To lament, wail, coo."
    },

    {
        "indexid":1013,
        "wordid":8226,
        "word":"غَيْرُهُ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرُهُ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    }]}