{"data":[
    {
        "indexid":1046,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1046,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1046,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1046,
        "wordid":2641,
        "word":"الْخَاسِرِينَ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word الْخَاسِرِينَ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    },

    {
        "indexid":1046,
        "wordid":4592,
        "word":"كَذَّبُوا",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذَّبُوا comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":1046,
        "wordid":8321,
        "word":"شُعَيْبًا",
        "rootid":1624,
        "rootword":"ش ع ب",
        "meanings":"to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites.",
        "sentence":"The word شُعَيْبًا comes from the root ش ع ب and is associated with the meanings: to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites."
    },

    {
        "indexid":1046,
        "wordid":8352,
        "word":"يَغْنَوْا",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word يَغْنَوْا comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    }]}