{"data":[
    {
        "indexid":1052,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1052,
        "wordid":5092,
        "word":"أَهْلُ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلُ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":1052,
        "wordid":7369,
        "word":"بَأْسُنَا",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word بَأْسُنَا comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":1052,
        "wordid":7591,
        "word":"يَلْعَبُونَ",
        "rootid":1150,
        "rootword":"ل ع ب",
        "meanings":"played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool.",
        "sentence":"The word يَلْعَبُونَ comes from the root ل ع ب and is associated with the meanings: played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool."
    },

    {
        "indexid":1052,
        "wordid":7597,
        "word":"الْقُرَى",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word الْقُرَى comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":1052,
        "wordid":8365,
        "word":"يَأْتِيَهُمْ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يَأْتِيَهُمْ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":1052,
        "wordid":8367,
        "word":"أَوَأَمِنَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word أَوَأَمِنَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1052,
        "wordid":8368,
        "word":"ضُحًى",
        "rootid":117,
        "rootword":"ض ح و",
        "meanings":"to be smitten by sunbeams, suffer from the heat of the sun, become uncovered, be revealed, appear conspicuously.Can also means those hours of the morning which follow shortly after sunrise, full brightness of the sun, sunshine, part of the forenoon when the sun is already high, bright part pf the day when the sun shines fully, early afternoon, high noon, daytime\/daylight.",
        "sentence":"The word ضُحًى comes from the root ض ح و and is associated with the meanings: to be smitten by sunbeams, suffer from the heat of the sun, become uncovered, be revealed, appear conspicuously.Can also means those hours of the morning which follow shortly after sunrise, full brightness of the sun, sunshine, part of the forenoon when the sun is already high, bright part pf the day when the sun shines fully, early afternoon, high noon, daytime\/daylight."
    }]}