{"data":[
    {
        "indexid":107,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":107,
        "wordid":2034,
        "word":"يُؤْمِنُونَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُونَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":107,
        "wordid":2729,
        "word":"فَرِيقٌ",
        "rootid":1165,
        "rootword":"ف ر ق",
        "meanings":"o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear.",
        "sentence":"The word فَرِيقٌ comes from the root ف ر ق and is associated with the meanings: o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear."
    },

    {
        "indexid":107,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":107,
        "wordid":2766,
        "word":"عَهْدًا",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word عَهْدًا comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":107,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":107,
        "wordid":2931,
        "word":"أَوَكُلَّمَا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word أَوَكُلَّمَا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":107,
        "wordid":2932,
        "word":"عَاهَدُوا",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word عَاهَدُوا comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":107,
        "wordid":2933,
        "word":"نَبَذَهُ",
        "rootid":225,
        "rootword":"ن ب ذ",
        "meanings":"(Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account.",
        "sentence":"The word نَبَذَهُ comes from the root ن ب ذ and is associated with the meanings: (Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account."
    },

    {
        "indexid":107,
        "wordid":2934,
        "word":"أَكْثَرُهُمْ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word أَكْثَرُهُمْ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    }]}