{"data":[
    {
        "indexid":1091,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1091,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1091,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1091,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1091,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1091,
        "wordid":2410,
        "word":"إِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word إِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":1091,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1091,
        "wordid":2779,
        "word":"بَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":1091,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1091,
        "wordid":4266,
        "word":"الْقَوْمَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقَوْمَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1091,
        "wordid":6218,
        "word":"الْحُسْنَى",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْحُسْنَى comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1091,
        "wordid":7729,
        "word":"وَتَمَّتْ",
        "rootid":536,
        "rootword":"ت م م",
        "meanings":"To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard.",
        "sentence":"The word وَتَمَّتْ comes from the root ت م م and is associated with the meanings: To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard."
    },

    {
        "indexid":1091,
        "wordid":7730,
        "word":"كَلِمَتُ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word كَلِمَتُ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":1091,
        "wordid":8436,
        "word":"فِرْعَوْنُ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنُ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":1091,
        "wordid":8495,
        "word":"وَأَوْرَثْنَا",
        "rootid":452,
        "rootword":"و ر ث",
        "meanings":"to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed.",
        "sentence":"The word وَأَوْرَثْنَا comes from the root و ر ث and is associated with the meanings: to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed."
    },

    {
        "indexid":1091,
        "wordid":8496,
        "word":"يُسْتَضْعَفُونَ",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word يُسْتَضْعَفُونَ comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":1091,
        "wordid":8497,
        "word":"مَشَارِقَ",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word مَشَارِقَ comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    },

    {
        "indexid":1091,
        "wordid":8498,
        "word":"وَمَغَارِبَهَا",
        "rootid":1268,
        "rootword":"غ ر ب",
        "meanings":"went\/passed away, depart\/retire\/remove, become remote\/distant\/absent\/hidden\/black, withdraw, western, foreign\/strange, exceed, abundance, sharpness, (maghrib = sunset), black.",
        "sentence":"The word وَمَغَارِبَهَا comes from the root غ ر ب and is associated with the meanings: went\/passed away, depart\/retire\/remove, become remote\/distant\/absent\/hidden\/black, withdraw, western, foreign\/strange, exceed, abundance, sharpness, (maghrib = sunset), black."
    },

    {
        "indexid":1091,
        "wordid":8499,
        "word":"بَارَكْنَا",
        "rootid":1480,
        "rootword":"ب ر ك",
        "meanings":"Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty.",
        "sentence":"The word بَارَكْنَا comes from the root ب ر ك and is associated with the meanings: Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty."
    },

    {
        "indexid":1091,
        "wordid":8500,
        "word":"صَبَرُوا",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word صَبَرُوا comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":1091,
        "wordid":8501,
        "word":"وَدَمَّرْنَا",
        "rootid":1737,
        "rootword":"د م ر",
        "meanings":"To perish utterly, be annihilated, to destroy.",
        "sentence":"The word وَدَمَّرْنَا comes from the root د م ر and is associated with the meanings: To perish utterly, be annihilated, to destroy."
    },

    {
        "indexid":1091,
        "wordid":8502,
        "word":"يَصْنَعُ",
        "rootid":1550,
        "rootword":"ص ن ع",
        "meanings":"to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making.",
        "sentence":"The word يَصْنَعُ comes from the root ص ن ع and is associated with the meanings: to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making."
    },

    {
        "indexid":1091,
        "wordid":8503,
        "word":"وَقَوْمُهُ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word وَقَوْمُهُ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1091,
        "wordid":8504,
        "word":"يَعْرِشُونَ",
        "rootid":228,
        "rootword":"ع ر ش",
        "meanings":"to construct\/build, make trellis (for grape-wine), make a vine-stalk, roof, raise (a house or structure), settle. arsh - throne, arbour, pavillion, roof, power, dominion, sovereignty.",
        "sentence":"The word يَعْرِشُونَ comes from the root ع ر ش and is associated with the meanings: to construct\/build, make trellis (for grape-wine), make a vine-stalk, roof, raise (a house or structure), settle. arsh - throne, arbour, pavillion, roof, power, dominion, sovereignty."
    }]}