{"data":[
    {
        "indexid":1175,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":1175,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1175,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":1175,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1175,
        "wordid":5097,
        "word":"الْأَدْبَارَ",
        "rootid":595,
        "rootword":"د ب ر",
        "meanings":"to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting.",
        "sentence":"The word الْأَدْبَارَ comes from the root د ب ر and is associated with the meanings: to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting."
    },

    {
        "indexid":1175,
        "wordid":8885,
        "word":"لَقِيتُمُ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لَقِيتُمُ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":1175,
        "wordid":8886,
        "word":"زَحْفًا",
        "rootid":695,
        "rootword":"ز ح ف",
        "meanings":"a company of men walked\/marched or went on foot, crept\/crawled along, walked leisurely\/gently or little by little, to drag, become fatigued.",
        "sentence":"The word زَحْفًا comes from the root ز ح ف and is associated with the meanings: a company of men walked\/marched or went on foot, crept\/crawled along, walked leisurely\/gently or little by little, to drag, become fatigued."
    },

    {
        "indexid":1175,
        "wordid":8887,
        "word":"تُوَلُّوهُمُ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word تُوَلُّوهُمُ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    }]}