{"data":[
    {
        "indexid":1226,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1226,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1226,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1226,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1226,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1226,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":1226,
        "wordid":2507,
        "word":"عَنْكُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْكُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1226,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1226,
        "wordid":2690,
        "word":"الْءَانَ",
        "rootid":1460,
        "rootword":"ا ي ن",
        "meanings":"",
        "sentence":"The word الْءَانَ comes from the root ا ي ن and is associated with the meanings: "
    },

    {
        "indexid":1226,
        "wordid":2916,
        "word":"بِإِذْنِ",
        "rootid":961,
        "rootword":"ا ذ ن",
        "meanings":"he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning.",
        "sentence":"The word بِإِذْنِ comes from the root ا ذ ن and is associated with the meanings: he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning."
    },

    {
        "indexid":1226,
        "wordid":3331,
        "word":"فِيكُمْ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيكُمْ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1226,
        "wordid":3342,
        "word":"الصَّابِرِينَ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word الصَّابِرِينَ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":1226,
        "wordid":3713,
        "word":"يَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1226,
        "wordid":9069,
        "word":"يَغْلِبُوا",
        "rootid":948,
        "rootword":"غ ل ب",
        "meanings":"overcame, conquered, subdued, mastered, surpassed, superior in power or force",
        "sentence":"The word يَغْلِبُوا comes from the root غ ل ب and is associated with the meanings: overcame, conquered, subdued, mastered, surpassed, superior in power or force"
    },

    {
        "indexid":1226,
        "wordid":9070,
        "word":"مِائَتَيْنِ",
        "rootid":425,
        "rootword":"م ا ي",
        "meanings":"hundred",
        "sentence":"The word مِائَتَيْنِ comes from the root م ا ي and is associated with the meanings: hundred"
    },

    {
        "indexid":1226,
        "wordid":9071,
        "word":"مِائَةٌ",
        "rootid":425,
        "rootword":"م ا ي",
        "meanings":"hundred",
        "sentence":"The word مِائَةٌ comes from the root م ا ي and is associated with the meanings: hundred"
    },

    {
        "indexid":1226,
        "wordid":9073,
        "word":"خَفَّفَ",
        "rootid":726,
        "rootword":"خ ف ف",
        "meanings":"To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable.",
        "sentence":"The word خَفَّفَ comes from the root خ ف ف and is associated with the meanings: To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable."
    },

    {
        "indexid":1226,
        "wordid":9074,
        "word":"وَعَلِمَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَعَلِمَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1226,
        "wordid":9075,
        "word":"ضَعْفًا",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word ضَعْفًا comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":1226,
        "wordid":9076,
        "word":"صَابِرَةٌ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word صَابِرَةٌ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":1226,
        "wordid":9077,
        "word":"أَلْفٌ",
        "rootid":1554,
        "rootword":"ا ل ف",
        "meanings":"he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known.",
        "sentence":"The word أَلْفٌ comes from the root ا ل ف and is associated with the meanings: he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known."
    },

    {
        "indexid":1226,
        "wordid":9078,
        "word":"أَلْفَيْنِ",
        "rootid":1554,
        "rootword":"ا ل ف",
        "meanings":"he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known.",
        "sentence":"The word أَلْفَيْنِ comes from the root ا ل ف and is associated with the meanings: he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known."
    }]}