{"data":[
    {
        "indexid":1231,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1231,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1231,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1231,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1231,
        "wordid":2250,
        "word":"قَبْلُ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلُ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":1231,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1231,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1231,
        "wordid":3010,
        "word":"فَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1231,
        "wordid":3793,
        "word":"حَكِيمٌ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حَكِيمٌ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":1231,
        "wordid":9054,
        "word":"يُرِيدُوا",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُوا comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":1231,
        "wordid":9087,
        "word":"خِيَانَتَكَ",
        "rootid":1366,
        "rootword":"خ و ن",
        "meanings":"To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion.",
        "sentence":"The word خِيَانَتَكَ comes from the root خ و ن and is associated with the meanings: To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion."
    },

    {
        "indexid":1231,
        "wordid":9088,
        "word":"خَانُوا",
        "rootid":1366,
        "rootword":"خ و ن",
        "meanings":"To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion.",
        "sentence":"The word خَانُوا comes from the root خ و ن and is associated with the meanings: To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion."
    },

    {
        "indexid":1231,
        "wordid":9089,
        "word":"فَأَمْكَنَ",
        "rootid":968,
        "rootword":"م ك ن",
        "meanings":"To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing.",
        "sentence":"The word فَأَمْكَنَ comes from the root م ك ن and is associated with the meanings: To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing."
    }]}