{"data":[
    {
        "indexid":1239,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1239,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1239,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1239,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1239,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1239,
        "wordid":2984,
        "word":"الْمُشْرِكِينَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word الْمُشْرِكِينَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":1239,
        "wordid":3542,
        "word":"الْمُتَّقِينَ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word الْمُتَّقِينَ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":1239,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":1239,
        "wordid":4141,
        "word":"وَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word وَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1239,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1239,
        "wordid":6685,
        "word":"أَحَدًا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدًا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":1239,
        "wordid":9029,
        "word":"عَهْدَهُمْ",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word عَهْدَهُمْ comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":1239,
        "wordid":9099,
        "word":"عَاهَدْتُمْ",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word عَاهَدْتُمْ comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":1239,
        "wordid":9105,
        "word":"يَنْقُصُوكُمْ",
        "rootid":1746,
        "rootword":"ن ق ص",
        "meanings":"to diminish, decrease, run low, lessen, cause loss or deficiency, consume, fall short, waste, abate.",
        "sentence":"The word يَنْقُصُوكُمْ comes from the root ن ق ص and is associated with the meanings: to diminish, decrease, run low, lessen, cause loss or deficiency, consume, fall short, waste, abate."
    },

    {
        "indexid":1239,
        "wordid":9106,
        "word":"يُظَاهِرُوا",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word يُظَاهِرُوا comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":1239,
        "wordid":9107,
        "word":"فَأَتِمُّوا",
        "rootid":536,
        "rootword":"ت م م",
        "meanings":"To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard.",
        "sentence":"The word فَأَتِمُّوا comes from the root ت م م and is associated with the meanings: To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard."
    },

    {
        "indexid":1239,
        "wordid":9108,
        "word":"مُدَّتِهِمْ",
        "rootid":234,
        "rootword":"م د د",
        "meanings":"to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung).",
        "sentence":"The word مُدَّتِهِمْ comes from the root م د د and is associated with the meanings: to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung)."
    }]}