{"data":[
    {
        "indexid":1251,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1251,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1251,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1251,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":1251,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1251,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1251,
        "wordid":2224,
        "word":"دُونِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":1251,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1251,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1251,
        "wordid":2724,
        "word":"تَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word تَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1251,
        "wordid":3830,
        "word":"حَسِبْتُمْ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word حَسِبْتُمْ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":1251,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1251,
        "wordid":4053,
        "word":"خَبِيرٌ",
        "rootid":109,
        "rootword":"خ ب ر",
        "meanings":"To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account.",
        "sentence":"The word خَبِيرٌ comes from the root خ ب ر and is associated with the meanings: To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account."
    },

    {
        "indexid":1251,
        "wordid":4141,
        "word":"وَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word وَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1251,
        "wordid":5238,
        "word":"يَعْلَمِ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمِ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1251,
        "wordid":5239,
        "word":"جَاهَدُوا",
        "rootid":398,
        "rootword":"ج ه د",
        "meanings":"To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties.",
        "sentence":"The word جَاهَدُوا comes from the root ج ه د and is associated with the meanings: To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties."
    },

    {
        "indexid":1251,
        "wordid":6399,
        "word":"رَسُولِهِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word رَسُولِهِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1251,
        "wordid":6440,
        "word":"يَتَّخِذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word يَتَّخِذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1251,
        "wordid":9160,
        "word":"تُتْرَكُوا",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word تُتْرَكُوا comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":1251,
        "wordid":9161,
        "word":"وَلِيجَةً",
        "rootid":1701,
        "rootword":"و ل ج",
        "meanings":"to enter, penetrate in, go in, pass through, gain.",
        "sentence":"The word وَلِيجَةً comes from the root و ل ج and is associated with the meanings: to enter, penetrate in, go in, pass through, gain."
    }]}