{"data":[
    {
        "indexid":1288,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":1288,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1288,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":1288,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1288,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1288,
        "wordid":4217,
        "word":"أَنْفِقُوا",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word أَنْفِقُوا comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1288,
        "wordid":4995,
        "word":"طَوْعًا",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word طَوْعًا comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":1288,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1288,
        "wordid":5718,
        "word":"كَرْهًا",
        "rootid":49,
        "rootword":"ك ر ه",
        "meanings":"To find difficult, dislike, disapprove, feel aversion to, be averse from, loathe, abhor, hate, detest, be unwilling.",
        "sentence":"The word كَرْهًا comes from the root ك ر ه and is associated with the meanings: To find difficult, dislike, disapprove, feel aversion to, be averse from, loathe, abhor, hate, detest, be unwilling."
    },

    {
        "indexid":1288,
        "wordid":9346,
        "word":"يُتَقَبَّلَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word يُتَقَبَّلَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":1288,
        "wordid":9347,
        "word":"فَاسِقِينَ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word فَاسِقِينَ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    }]}