{"data":[
    {
        "indexid":1290,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1290,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1290,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1290,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1290,
        "wordid":2817,
        "word":"الْحَيَوةِ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةِ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":1290,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":1290,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":1290,
        "wordid":4588,
        "word":"أَمْوَالُهُمْ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word أَمْوَالُهُمْ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":1290,
        "wordid":4589,
        "word":"أَوْلَادُهُمْ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word أَوْلَادُهُمْ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":1290,
        "wordid":5319,
        "word":"أَنْفُسُهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسُهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1290,
        "wordid":8158,
        "word":"كَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":1290,
        "wordid":8947,
        "word":"لِيُعَذِّبَهُمْ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word لِيُعَذِّبَهُمْ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":1290,
        "wordid":9352,
        "word":"تُعْجِبْكَ",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word تُعْجِبْكَ comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    },

    {
        "indexid":1290,
        "wordid":9353,
        "word":"وَتَزْهَقَ",
        "rootid":259,
        "rootword":"ز ه ق",
        "meanings":"went\/passed forth, departed, perished, dying, came to naught, went swiftly.",
        "sentence":"The word وَتَزْهَقَ comes from the root ز ه ق and is associated with the meanings: went\/passed forth, departed, perished, dying, came to naught, went swiftly."
    }]}