{"data":[
    {
        "indexid":1302,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1302,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1302,
        "wordid":2736,
        "word":"بَعْضُهُمْ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضُهُمْ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":1302,
        "wordid":2737,
        "word":"بَعْضٍ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضٍ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":1302,
        "wordid":2930,
        "word":"الْفَاسِقُونَ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word الْفَاسِقُونَ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":1302,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1302,
        "wordid":4656,
        "word":"يَأْمُرُونَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word يَأْمُرُونَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1302,
        "wordid":5072,
        "word":"وَيَنْهَوْنَ",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word وَيَنْهَوْنَ comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":1302,
        "wordid":5998,
        "word":"الْمُنَافِقِينَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word الْمُنَافِقِينَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1302,
        "wordid":6171,
        "word":"أَيْدِيَهُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word أَيْدِيَهُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":1302,
        "wordid":7372,
        "word":"نَسُوا",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word نَسُوا comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    },

    {
        "indexid":1302,
        "wordid":9012,
        "word":"الْمُنَافِقُونَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word الْمُنَافِقُونَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1302,
        "wordid":9402,
        "word":"وَالْمُنَافِقَاتُ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word وَالْمُنَافِقَاتُ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1302,
        "wordid":9403,
        "word":"بِالْمُنْكَرِ",
        "rootid":1601,
        "rootword":"ن ك ر",
        "meanings":"to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge.",
        "sentence":"The word بِالْمُنْكَرِ comes from the root ن ك ر and is associated with the meanings: to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge."
    },

    {
        "indexid":1302,
        "wordid":9404,
        "word":"الْمَعْرُوفِ",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word الْمَعْرُوفِ comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    },

    {
        "indexid":1302,
        "wordid":9405,
        "word":"وَيَقْبِضُونَ",
        "rootid":1053,
        "rootword":"ق ب ض",
        "meanings":"take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace.",
        "sentence":"The word وَيَقْبِضُونَ comes from the root ق ب ض and is associated with the meanings: take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace."
    },

    {
        "indexid":1302,
        "wordid":9406,
        "word":"فَنَسِيَهُمْ",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word فَنَسِيَهُمْ comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    }]}