{"data":[
    {
        "indexid":1317,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1317,
        "wordid":2274,
        "word":"كَثِيرًا",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرًا comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":1317,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":1317,
        "wordid":2758,
        "word":"يَكْسِبُونَ",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word يَكْسِبُونَ comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":1317,
        "wordid":6789,
        "word":"جَزَاءً",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word جَزَاءً comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":1317,
        "wordid":9477,
        "word":"فَلْيَضْحَكُوا",
        "rootid":1725,
        "rootword":"ض ح ك",
        "meanings":"to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear.",
        "sentence":"The word فَلْيَضْحَكُوا comes from the root ض ح ك and is associated with the meanings: to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear."
    },

    {
        "indexid":1317,
        "wordid":9478,
        "word":"وَلْيَبْكُوا",
        "rootid":620,
        "rootword":"ب ك ي",
        "meanings":"wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak.",
        "sentence":"The word وَلْيَبْكُوا comes from the root ب ك ي and is associated with the meanings: wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak."
    }]}