{"data":[
    {
        "indexid":1326,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1326,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1326,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1326,
        "wordid":2040,
        "word":"يُنْفِقُونَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word يُنْفِقُونَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1326,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1326,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1326,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1326,
        "wordid":2556,
        "word":"الْمُحْسِنِينَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْمُحْسِنِينَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1326,
        "wordid":3282,
        "word":"رَحِيمٌ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمٌ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1326,
        "wordid":3475,
        "word":"غَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":1326,
        "wordid":3489,
        "word":"لَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word لَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":1326,
        "wordid":4444,
        "word":"وَرَسُولِهِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَرَسُولِهِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1326,
        "wordid":5903,
        "word":"سَبِيلٍ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلٍ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":1326,
        "wordid":6339,
        "word":"يَجِدُونَ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word يَجِدُونَ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":1326,
        "wordid":7994,
        "word":"حَرَجٌ",
        "rootid":1284,
        "rootword":"ح ر ج",
        "meanings":"To be contracted (heart), oppressed, become narrow, disquieted in reason.",
        "sentence":"The word حَرَجٌ comes from the root ح ر ج and is associated with the meanings: To be contracted (heart), oppressed, become narrow, disquieted in reason."
    },

    {
        "indexid":1326,
        "wordid":9502,
        "word":"الضُّعَفَاءِ",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word الضُّعَفَاءِ comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":1326,
        "wordid":9503,
        "word":"الْمَرْضَى",
        "rootid":1602,
        "rootword":"م ر ض",
        "meanings":"To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion).",
        "sentence":"The word الْمَرْضَى comes from the root م ر ض and is associated with the meanings: To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion)."
    },

    {
        "indexid":1326,
        "wordid":9504,
        "word":"نَصَحُوا",
        "rootid":1519,
        "rootword":"ن ص ح",
        "meanings":"to be pure, unmixed, genuine, act sincerely, give sincere advice, counsel earnestly, be faithful.",
        "sentence":"The word نَصَحُوا comes from the root ن ص ح and is associated with the meanings: to be pure, unmixed, genuine, act sincerely, give sincere advice, counsel earnestly, be faithful."
    }]}