{"data":[
    {
        "indexid":1359,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1359,
        "wordid":2077,
        "word":"يَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1359,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1359,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1359,
        "wordid":4215,
        "word":"فَمِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1359,
        "wordid":5409,
        "word":"يَسْتَبْشِرُونَ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word يَسْتَبْشِرُونَ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":1359,
        "wordid":5423,
        "word":"إِيمَانًا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word إِيمَانًا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1359,
        "wordid":9386,
        "word":"سُورَةٌ",
        "rootid":1014,
        "rootword":"س و ر",
        "meanings":"leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure.",
        "sentence":"The word سُورَةٌ comes from the root س و ر and is associated with the meanings: leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure."
    },

    {
        "indexid":1359,
        "wordid":9491,
        "word":"أُنْزِلَتْ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أُنْزِلَتْ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":1359,
        "wordid":9669,
        "word":"أَيُّكُمْ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word أَيُّكُمْ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":1359,
        "wordid":9670,
        "word":"زَادَتْهُ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word زَادَتْهُ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":1359,
        "wordid":9671,
        "word":"فَزَادَتْهُمْ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word فَزَادَتْهُمْ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    }]}