{"data":[
    {
        "indexid":1369,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1369,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1369,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1369,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1369,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1369,
        "wordid":2297,
        "word":"خَلَقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":1369,
        "wordid":2692,
        "word":"بِالْحَقِّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word بِالْحَقِّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":1369,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1369,
        "wordid":6536,
        "word":"نُورًا",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نُورًا comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1369,
        "wordid":7081,
        "word":"لِتَعْلَمُوا",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word لِتَعْلَمُوا comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1369,
        "wordid":7531,
        "word":"الشَّمْسَ",
        "rootid":638,
        "rootword":"ش م س",
        "meanings":"to be bright with sunshine, be glorious, be sunny. shams - sun.",
        "sentence":"The word الشَّمْسَ comes from the root ش م س and is associated with the meanings: to be bright with sunshine, be glorious, be sunny. shams - sun."
    },

    {
        "indexid":1369,
        "wordid":7632,
        "word":"وَالْقَمَرَ",
        "rootid":659,
        "rootword":"ق م ر",
        "meanings":"to be white. qamarun - moon (especially from the 3rd to 26th night).",
        "sentence":"The word وَالْقَمَرَ comes from the root ق م ر and is associated with the meanings: to be white. qamarun - moon (especially from the 3rd to 26th night)."
    },

    {
        "indexid":1369,
        "wordid":9694,
        "word":"ضِيَاءً",
        "rootid":1133,
        "rootword":"ض و ا",
        "meanings":"Brought to light, made visible, discovered, or revealed. One who stood in the dark to see people by the light of their fire, without their seeing him.",
        "sentence":"The word ضِيَاءً comes from the root ض و ا and is associated with the meanings: Brought to light, made visible, discovered, or revealed. One who stood in the dark to see people by the light of their fire, without their seeing him."
    },

    {
        "indexid":1369,
        "wordid":9695,
        "word":"وَقَدَّرَهُ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word وَقَدَّرَهُ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":1369,
        "wordid":9696,
        "word":"مَنَازِلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word مَنَازِلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":1369,
        "wordid":9697,
        "word":"عَدَدَ",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word عَدَدَ comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    },

    {
        "indexid":1369,
        "wordid":9698,
        "word":"السِّنِينَ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word السِّنِينَ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":1369,
        "wordid":9699,
        "word":"وَالْحِسَابَ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word وَالْحِسَابَ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":1369,
        "wordid":9700,
        "word":"يُفَصِّلُ",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word يُفَصِّلُ comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    }]}