{"data":[
    {
        "indexid":1371,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1371,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1371,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":1371,
        "wordid":3876,
        "word":"يَرْجُونَ",
        "rootid":1344,
        "rootword":"ر ج و",
        "meanings":"to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62).",
        "sentence":"The word يَرْجُونَ comes from the root ر ج و and is associated with the meanings: to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62)."
    },

    {
        "indexid":1371,
        "wordid":7201,
        "word":"وَرَضُوا",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word وَرَضُوا comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":1371,
        "wordid":7810,
        "word":"غَافِلُونَ",
        "rootid":921,
        "rootword":"غ ف ل",
        "meanings":"unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away",
        "sentence":"The word غَافِلُونَ comes from the root غ ف ل and is associated with the meanings: unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away"
    },

    {
        "indexid":1371,
        "wordid":9271,
        "word":"بِالْحَيَوةِ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word بِالْحَيَوةِ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":1371,
        "wordid":9702,
        "word":"لِقَاءَنَا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لِقَاءَنَا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}