{"data":[
    {
        "indexid":1375,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1375,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1375,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1375,
        "wordid":2128,
        "word":"يَعْمَهُونَ",
        "rootid":906,
        "rootword":"ع م ه",
        "meanings":"to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness.",
        "sentence":"The word يَعْمَهُونَ comes from the root ع م ه and is associated with the meanings: to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness."
    },

    {
        "indexid":1375,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":1375,
        "wordid":2787,
        "word":"لِلنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word لِلنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":1375,
        "wordid":3876,
        "word":"يَرْجُونَ",
        "rootid":1344,
        "rootword":"ر ج و",
        "meanings":"to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62).",
        "sentence":"The word يَرْجُونَ comes from the root ر ج و and is associated with the meanings: to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62)."
    },

    {
        "indexid":1375,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1375,
        "wordid":7235,
        "word":"لَقُضِيَ",
        "rootid":1066,
        "rootword":"ق ض ي",
        "meanings":"to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal.",
        "sentence":"The word لَقُضِيَ comes from the root ق ض ي and is associated with the meanings: to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal."
    },

    {
        "indexid":1375,
        "wordid":8113,
        "word":"أَجَلُهُمْ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلُهُمْ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":1375,
        "wordid":9702,
        "word":"لِقَاءَنَا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لِقَاءَنَا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":1375,
        "wordid":9708,
        "word":"يُعَجِّلُ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word يُعَجِّلُ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":1375,
        "wordid":9709,
        "word":"الشَّرَّ",
        "rootid":546,
        "rootword":"ش ر ر",
        "meanings":"to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire.",
        "sentence":"The word الشَّرَّ comes from the root ش ر ر and is associated with the meanings: to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire."
    },

    {
        "indexid":1375,
        "wordid":9710,
        "word":"اسْتِعْجَالَهُمْ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word اسْتِعْجَالَهُمْ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":1375,
        "wordid":9711,
        "word":"بِالْخَيْرِ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word بِالْخَيْرِ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":1375,
        "wordid":9712,
        "word":"فَنَذَرُ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word فَنَذَرُ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    }]}