{"data":[
    {
        "indexid":1447,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1447,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1447,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1447,
        "wordid":2112,
        "word":"ءَامَنَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1447,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1447,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1447,
        "wordid":2479,
        "word":"فِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":1447,
        "wordid":3188,
        "word":"لَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word لَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1447,
        "wordid":4358,
        "word":"ذُرِّيَّةٌ",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّةٌ comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":1447,
        "wordid":7555,
        "word":"قَوْمِهِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمِهِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1447,
        "wordid":7866,
        "word":"الْمُسْرِفِينَ",
        "rootid":1696,
        "rootword":"س ر ف",
        "meanings":"to eat away, excess, suckle (a child), be ignorant, be unmindful\/heedless, exceed the undue bounds or just limits, commit many faults\/offences\/crimes\/sins. asrafa - to squander one's wealth, act immoderately, be prodigal, extravagant, transgress. musrif - one who is wasteful.",
        "sentence":"The word الْمُسْرِفِينَ comes from the root س ر ف and is associated with the meanings: to eat away, excess, suckle (a child), be ignorant, be unmindful\/heedless, exceed the undue bounds or just limits, commit many faults\/offences\/crimes\/sins. asrafa - to squander one's wealth, act immoderately, be prodigal, extravagant, transgress. musrif - one who is wasteful."
    },

    {
        "indexid":1447,
        "wordid":9925,
        "word":"خَوْفٍ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خَوْفٍ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":1447,
        "wordid":9926,
        "word":"وَمَلَإِيهِمْ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word وَمَلَإِيهِمْ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":1447,
        "wordid":9927,
        "word":"يَفْتِنَهُمْ",
        "rootid":159,
        "rootword":"ف ت ن",
        "meanings":"to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire.",
        "sentence":"The word يَفْتِنَهُمْ comes from the root ف ت ن and is associated with the meanings: to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire."
    },

    {
        "indexid":1447,
        "wordid":9928,
        "word":"لَعَالٍ",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word لَعَالٍ comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    }]}