{"data":[
    {
        "indexid":1453,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1453,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1453,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1453,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1453,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1453,
        "wordid":8528,
        "word":"سَبِيلَ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلَ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":1453,
        "wordid":9950,
        "word":"أُجِيبَتْ",
        "rootid":1495,
        "rootword":"ج و ب",
        "meanings":"Make a hole in a thing, rend or tear a thing, perforate\/pierce\/bore, to cut a thing, hollow a thing out, traverse or cross, cut through by journeying, penetrate, reply or answer or respond, illuminate and render clear, to shield.",
        "sentence":"The word أُجِيبَتْ comes from the root ج و ب and is associated with the meanings: Make a hole in a thing, rend or tear a thing, perforate\/pierce\/bore, to cut a thing, hollow a thing out, traverse or cross, cut through by journeying, penetrate, reply or answer or respond, illuminate and render clear, to shield."
    },

    {
        "indexid":1453,
        "wordid":9951,
        "word":"دَعْوَتُكُمَا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دَعْوَتُكُمَا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":1453,
        "wordid":9952,
        "word":"فَاسْتَقِيمَا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word فَاسْتَقِيمَا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1453,
        "wordid":9953,
        "word":"تَتَّبِعَانِّ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word تَتَّبِعَانِّ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    }]}