{"data":[
    {
        "indexid":1454,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1454,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1454,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1454,
        "wordid":2410,
        "word":"إِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word إِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":1454,
        "wordid":2493,
        "word":"الْبَحْرَ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word الْبَحْرَ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":1454,
        "wordid":2865,
        "word":"بَغْيًا",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word بَغْيًا comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":1454,
        "wordid":3385,
        "word":"وَأَنَا",
        "rootid":1523,
        "rootword":"ا ن ا",
        "meanings":"",
        "sentence":"The word وَأَنَا comes from the root ا ن ا and is associated with the meanings: "
    },

    {
        "indexid":1454,
        "wordid":3397,
        "word":"إِلَهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word إِلَهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1454,
        "wordid":7958,
        "word":"ءَامَنَتْ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَتْ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1454,
        "wordid":7981,
        "word":"الْمُسْلِمِينَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word الْمُسْلِمِينَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":1454,
        "wordid":8436,
        "word":"فِرْعَوْنُ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنُ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":1454,
        "wordid":8505,
        "word":"وَجَاوَزْنَا",
        "rootid":257,
        "rootword":"ج و ز",
        "meanings":"To pass in or pass along a place, leave it (a place) behind, pass through a place, traverse or cross, pass beyond a place, exceed or transgress the proper bound\/limit\/measure, excessive\/extravagant\/immoderate, allowable (pass as right or sound or valid or lawful), effect a judgement or opinion, give, clear away, relax or remit, overlook.",
        "sentence":"The word وَجَاوَزْنَا comes from the root ج و ز and is associated with the meanings: To pass in or pass along a place, leave it (a place) behind, pass through a place, traverse or cross, pass beyond a place, exceed or transgress the proper bound\/limit\/measure, excessive\/extravagant\/immoderate, allowable (pass as right or sound or valid or lawful), effect a judgement or opinion, give, clear away, relax or remit, overlook."
    },

    {
        "indexid":1454,
        "wordid":8506,
        "word":"بِبَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بِبَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":1454,
        "wordid":9954,
        "word":"فَأَتْبَعَهُمْ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word فَأَتْبَعَهُمْ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":1454,
        "wordid":9955,
        "word":"وَجُنُودُهُ",
        "rootid":503,
        "rootword":"ج ن د",
        "meanings":"Collect or assemble [armies, military forces], prepare an army, Jundun [collected body of men prepared for war; auxiliaries].",
        "sentence":"The word وَجُنُودُهُ comes from the root ج ن د and is associated with the meanings: Collect or assemble [armies, military forces], prepare an army, Jundun [collected body of men prepared for war; auxiliaries]."
    },

    {
        "indexid":1454,
        "wordid":9956,
        "word":"وَعَدْوًا",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word وَعَدْوًا comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":1454,
        "wordid":9957,
        "word":"أَدْرَكَهُ",
        "rootid":183,
        "rootword":"د ر ك",
        "meanings":"To overtake, follow up, drop closely.",
        "sentence":"The word أَدْرَكَهُ comes from the root د ر ك and is associated with the meanings: To overtake, follow up, drop closely."
    },

    {
        "indexid":1454,
        "wordid":9958,
        "word":"الْغَرَقُ",
        "rootid":344,
        "rootword":"غ ر ق",
        "meanings":"sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory",
        "sentence":"The word الْغَرَقُ comes from the root غ ر ق and is associated with the meanings: sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory"
    },

    {
        "indexid":1454,
        "wordid":9959,
        "word":"ءَامَنْتُ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنْتُ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1454,
        "wordid":9960,
        "word":"بَنُوا",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنُوا comes from the root ب ن و and is associated with the meanings: "
    }]}