{"data":[
    {
        "indexid":1488,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1488,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1488,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1488,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1488,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":1488,
        "wordid":2823,
        "word":"الْحَيَوةَ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةَ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":1488,
        "wordid":3438,
        "word":"أَعْمَالَهُمْ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالَهُمْ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1488,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":1488,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1488,
        "wordid":10055,
        "word":"وَزِينَتَهَا",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word وَزِينَتَهَا comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":1488,
        "wordid":10056,
        "word":"نُوَفِّ",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word نُوَفِّ comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":1488,
        "wordid":10057,
        "word":"يُبْخَسُونَ",
        "rootid":60,
        "rootword":"ب خ س",
        "meanings":"diminish\/lessen it, made it deficient\/defective\/faulty, deprive\/defraud, act wrongfully\/unjustly.",
        "sentence":"The word يُبْخَسُونَ comes from the root ب خ س and is associated with the meanings: diminish\/lessen it, made it deficient\/defective\/faulty, deprive\/defraud, act wrongfully\/unjustly."
    }]}