{"data":[
    {
        "indexid":1489,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":1489,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1489,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1489,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1489,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1489,
        "wordid":2761,
        "word":"النَّارُ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارُ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1489,
        "wordid":2910,
        "word":"يَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word يَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1489,
        "wordid":2974,
        "word":"الْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":1489,
        "wordid":3489,
        "word":"لَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word لَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":1489,
        "wordid":8513,
        "word":"وَبَاطِلٌ",
        "rootid":751,
        "rootword":"ب ط ل",
        "meanings":"Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies.",
        "sentence":"The word وَبَاطِلٌ comes from the root ب ط ل and is associated with the meanings: Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies."
    },

    {
        "indexid":1489,
        "wordid":10058,
        "word":"وَحَبِطَ",
        "rootid":1345,
        "rootword":"ح ب ط",
        "meanings":"To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective.",
        "sentence":"The word وَحَبِطَ comes from the root ح ب ط and is associated with the meanings: To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective."
    },

    {
        "indexid":1489,
        "wordid":10059,
        "word":"صَنَعُوا",
        "rootid":1550,
        "rootword":"ص ن ع",
        "meanings":"to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making.",
        "sentence":"The word صَنَعُوا comes from the root ص ن ع and is associated with the meanings: to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making."
    }]}