{"data":[
    {
        "indexid":1546,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1546,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1546,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1546,
        "wordid":3158,
        "word":"الْبَيْتِ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word الْبَيْتِ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":1546,
        "wordid":4371,
        "word":"حَمِيدٌ",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word حَمِيدٌ comes from the root ح م د and is associated with the meanings: To praise."
    },

    {
        "indexid":1546,
        "wordid":6944,
        "word":"أَهْلَ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلَ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":1546,
        "wordid":8295,
        "word":"أَمْرِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1546,
        "wordid":10260,
        "word":"أَتَعْجَبِينَ",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word أَتَعْجَبِينَ comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    },

    {
        "indexid":1546,
        "wordid":10261,
        "word":"رَحْمَتُ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحْمَتُ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1546,
        "wordid":10262,
        "word":"وَبَرَكَاتُهُ",
        "rootid":1480,
        "rootword":"ب ر ك",
        "meanings":"Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty.",
        "sentence":"The word وَبَرَكَاتُهُ comes from the root ب ر ك and is associated with the meanings: Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty."
    },

    {
        "indexid":1546,
        "wordid":10263,
        "word":"مَجِيدٌ",
        "rootid":1520,
        "rootword":"م ج د",
        "meanings":"To be possessed of or characterized by glory or honour or dignity or nobility, to be magnificent\/magnified, large\/abundant\/much, exalted or sublime.",
        "sentence":"The word مَجِيدٌ comes from the root م ج د and is associated with the meanings: To be possessed of or characterized by glory or honour or dignity or nobility, to be magnificent\/magnified, large\/abundant\/much, exalted or sublime."
    }]}