{"data":[
    {
        "indexid":159,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":159,
        "wordid":3336,
        "word":"فَاذْكُرُونِي",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word فَاذْكُرُونِي comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":159,
        "wordid":3337,
        "word":"أَذْكُرْكُمْ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word أَذْكُرْكُمْ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":159,
        "wordid":3338,
        "word":"وَاشْكُرُوا",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word وَاشْكُرُوا comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":159,
        "wordid":3340,
        "word":"تَكْفُرُونِ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word تَكْفُرُونِ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}