{"data":[
    {
        "indexid":1592,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1592,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1592,
        "wordid":2308,
        "word":"رَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1592,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1592,
        "wordid":3390,
        "word":"وَالنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word وَالنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":1592,
        "wordid":3391,
        "word":"أَجْمَعِينَ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word أَجْمَعِينَ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":1592,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":1592,
        "wordid":7729,
        "word":"وَتَمَّتْ",
        "rootid":536,
        "rootword":"ت م م",
        "meanings":"To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard.",
        "sentence":"The word وَتَمَّتْ comes from the root ت م م and is associated with the meanings: To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard."
    },

    {
        "indexid":1592,
        "wordid":8042,
        "word":"لَأَمْلَأَنَّ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word لَأَمْلَأَنَّ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":1592,
        "wordid":10149,
        "word":"رَحِمَ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِمَ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1592,
        "wordid":10408,
        "word":"خَلَقَهُمْ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَهُمْ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":1592,
        "wordid":10409,
        "word":"كَلِمَةُ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word كَلِمَةُ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":1592,
        "wordid":10410,
        "word":"الْجِنَّةِ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجِنَّةِ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    }]}