{"data":[
    {
        "indexid":1593,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1593,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1593,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1593,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":1593,
        "wordid":2920,
        "word":"لِلْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word لِلْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1593,
        "wordid":4791,
        "word":"أَنْبَاءِ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word أَنْبَاءِ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":1593,
        "wordid":5223,
        "word":"وَمَوْعِظَةٌ",
        "rootid":342,
        "rootword":"و ع ظ",
        "meanings":"to admonish, exhort, preach, advise, warn, remind of that which should soften the heart by the mention of reward or punishment, give good advice or counsel, remind of the result of affairs, exhort which leads to repentance and reformation.",
        "sentence":"The word وَمَوْعِظَةٌ comes from the root و ع ظ and is associated with the meanings: to admonish, exhort, preach, advise, warn, remind of that which should soften the heart by the mention of reward or punishment, give good advice or counsel, remind of the result of affairs, exhort which leads to repentance and reformation."
    },

    {
        "indexid":1593,
        "wordid":6216,
        "word":"وَكُلًّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلًّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1593,
        "wordid":6506,
        "word":"الرُّسُلِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الرُّسُلِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1593,
        "wordid":7996,
        "word":"وَذِكْرَى",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word وَذِكْرَى comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":1593,
        "wordid":8376,
        "word":"نَقُصُّ",
        "rootid":1708,
        "rootword":"ق ص ص",
        "meanings":"",
        "sentence":"The word نَقُصُّ comes from the root ق ص ص and is associated with the meanings: "
    },

    {
        "indexid":1593,
        "wordid":10411,
        "word":"نُثَبِّتُ",
        "rootid":68,
        "rootword":"ث ب ت",
        "meanings":"to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed).",
        "sentence":"The word نُثَبِّتُ comes from the root ث ب ت and is associated with the meanings: to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed)."
    },

    {
        "indexid":1593,
        "wordid":10412,
        "word":"فُؤَادَكَ",
        "rootid":960,
        "rootword":"ف ا د",
        "meanings":"to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind.",
        "sentence":"The word فُؤَادَكَ comes from the root ف ا د and is associated with the meanings: to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind."
    },

    {
        "indexid":1593,
        "wordid":10413,
        "word":"وَجَاءَكَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word وَجَاءَكَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    }]}