{"data":[
    {
        "indexid":1635,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1635,
        "wordid":2520,
        "word":"خَيْرٌ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرٌ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":1635,
        "wordid":3251,
        "word":"أَمِ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمِ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":1635,
        "wordid":10621,
        "word":"يَاصَاحِبَيِ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word يَاصَاحِبَيِ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":1635,
        "wordid":10622,
        "word":"السِّجْنِ",
        "rootid":314,
        "rootword":"س ج ن",
        "meanings":"to imprison\/jail, restrain\/conceal, register\/record, register in which the actions of the wicked are recorded, prison, written book, sahib al-sijn (fellow prisoner), anything hard\/vehement\/severe\/continuous.",
        "sentence":"The word السِّجْنِ comes from the root س ج ن and is associated with the meanings: to imprison\/jail, restrain\/conceal, register\/record, register in which the actions of the wicked are recorded, prison, written book, sahib al-sijn (fellow prisoner), anything hard\/vehement\/severe\/continuous."
    },

    {
        "indexid":1635,
        "wordid":10623,
        "word":"ءَأَرْبَابٌ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word ءَأَرْبَابٌ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1635,
        "wordid":10624,
        "word":"مُتَفَرِّقُونَ",
        "rootid":1165,
        "rootword":"ف ر ق",
        "meanings":"o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear.",
        "sentence":"The word مُتَفَرِّقُونَ comes from the root ف ر ق and is associated with the meanings: o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear."
    },

    {
        "indexid":1635,
        "wordid":10625,
        "word":"الْوَاحِدُ",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word الْوَاحِدُ comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":1635,
        "wordid":10626,
        "word":"الْقَهَّارُ",
        "rootid":1702,
        "rootword":"ق ه ر",
        "meanings":"to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying.",
        "sentence":"The word الْقَهَّارُ comes from the root ق ه ر and is associated with the meanings: to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying."
    }]}