{"data":[
    {
        "indexid":1639,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1639,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":1639,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1639,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1639,
        "wordid":2301,
        "word":"سَبْعَ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعَ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1639,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1639,
        "wordid":8227,
        "word":"الْمَلَأُ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word الْمَلَأُ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":1639,
        "wordid":9010,
        "word":"أَرَى",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word أَرَى comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1639,
        "wordid":10640,
        "word":"الْمَلِكُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمَلِكُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":1639,
        "wordid":10641,
        "word":"بَقَرَاتٍ",
        "rootid":89,
        "rootword":"ب ق ر",
        "meanings":"Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities",
        "sentence":"The word بَقَرَاتٍ comes from the root ب ق ر and is associated with the meanings: Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities"
    },

    {
        "indexid":1639,
        "wordid":10642,
        "word":"سِمَانٍ",
        "rootid":841,
        "rootword":"س م ن",
        "meanings":"to be fat, become fleshy, nourish, fat one.",
        "sentence":"The word سِمَانٍ comes from the root س م ن and is associated with the meanings: to be fat, become fleshy, nourish, fat one."
    },

    {
        "indexid":1639,
        "wordid":10643,
        "word":"يَأْكُلُهُنَّ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word يَأْكُلُهُنَّ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":1639,
        "wordid":10644,
        "word":"سَبْعٌ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعٌ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1639,
        "wordid":10645,
        "word":"عِجَافٌ",
        "rootid":1125,
        "rootword":"ع ج ف",
        "meanings":"to become lean, emaciate (animal).",
        "sentence":"The word عِجَافٌ comes from the root ع ج ف and is associated with the meanings: to become lean, emaciate (animal)."
    },

    {
        "indexid":1639,
        "wordid":10646,
        "word":"وَسَبْعَ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word وَسَبْعَ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1639,
        "wordid":10647,
        "word":"سُنْبُلَاتٍ",
        "rootid":1034,
        "rootword":"س ن ب ل",
        "meanings":"to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn).",
        "sentence":"The word سُنْبُلَاتٍ comes from the root س ن ب ل and is associated with the meanings: to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn)."
    },

    {
        "indexid":1639,
        "wordid":10648,
        "word":"خُضْرٍ",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word خُضْرٍ comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":1639,
        "wordid":10649,
        "word":"وَأُخَرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word وَأُخَرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":1639,
        "wordid":10650,
        "word":"يَابِسَاتٍ",
        "rootid":775,
        "rootword":"ي ب س",
        "meanings":"withered, dry.",
        "sentence":"The word يَابِسَاتٍ comes from the root ي ب س and is associated with the meanings: withered, dry."
    },

    {
        "indexid":1639,
        "wordid":10651,
        "word":"أَفْتُونِي",
        "rootid":1039,
        "rootword":"ف ت ي",
        "meanings":"to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation.",
        "sentence":"The word أَفْتُونِي comes from the root ف ت ي and is associated with the meanings: to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation."
    },

    {
        "indexid":1639,
        "wordid":10652,
        "word":"رُءْيَايَ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word رُءْيَايَ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1639,
        "wordid":10653,
        "word":"لِلرُّءْيَا",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word لِلرُّءْيَا comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1639,
        "wordid":10654,
        "word":"تَعْبُرُونَ",
        "rootid":704,
        "rootword":"ع ب ر",
        "meanings":"to cross, interpret, state clearly, pass over. i'tabara - to consider, ponder over, take into account, get experience from, take warming. abratun (pl. i'bar) -  regard\/consideration, admonition, warning, example, instructive warning. aabir (pl. aabiriina) - one who passes over. i'tabara - to take warning, learn a lesson.",
        "sentence":"The word تَعْبُرُونَ comes from the root ع ب ر and is associated with the meanings: to cross, interpret, state clearly, pass over. i'tabara - to consider, ponder over, take into account, get experience from, take warming. abratun (pl. i'bar) -  regard\/consideration, admonition, warning, example, instructive warning. aabir (pl. aabiriina) - one who passes over. i'tabara - to take warning, learn a lesson."
    }]}