{"data":[
    {
        "indexid":1640,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1640,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1640,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":1640,
        "wordid":10655,
        "word":"أَضْغَاثُ",
        "rootid":1673,
        "rootword":"ض غ ث",
        "meanings":"Collected, confused or confounded. Washed without cleansing. Felt (for a certain purpose). Complications.A handful of herbs mixed together, fresh and dry. A handful of twigs of trees or shrubs or of the fruit-stalks of the raceme of a palm-tree. Whatever that is collected or bundled together and grasped with the hand.A deed that is of mixed kind, not pure or not sincere. Something which is no good.To be said of a she-camel, of which one doubts whether she be fat, and which one therefore feels with his hand (the hump), to know whether she be fat or not.One who hides himself in a thicket or the like, and frightens boys by a sound reiterated in his fauces.Rain that moistens the earth and the herbage.",
        "sentence":"The word أَضْغَاثُ comes from the root ض غ ث and is associated with the meanings: Collected, confused or confounded. Washed without cleansing. Felt (for a certain purpose). Complications.A handful of herbs mixed together, fresh and dry. A handful of twigs of trees or shrubs or of the fruit-stalks of the raceme of a palm-tree. Whatever that is collected or bundled together and grasped with the hand.A deed that is of mixed kind, not pure or not sincere. Something which is no good.To be said of a she-camel, of which one doubts whether she be fat, and which one therefore feels with his hand (the hump), to know whether she be fat or not.One who hides himself in a thicket or the like, and frightens boys by a sound reiterated in his fauces.Rain that moistens the earth and the herbage."
    },

    {
        "indexid":1640,
        "wordid":10656,
        "word":"أَحْلَامٍ",
        "rootid":1558,
        "rootword":"ح ل م",
        "meanings":"To dream, have a vision, attain to puberty.",
        "sentence":"The word أَحْلَامٍ comes from the root ح ل م and is associated with the meanings: To dream, have a vision, attain to puberty."
    },

    {
        "indexid":1640,
        "wordid":10657,
        "word":"بِتَأْوِيلِ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word بِتَأْوِيلِ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":1640,
        "wordid":10658,
        "word":"الْأَحْلَامِ",
        "rootid":1558,
        "rootword":"ح ل م",
        "meanings":"To dream, have a vision, attain to puberty.",
        "sentence":"The word الْأَحْلَامِ comes from the root ح ل م and is associated with the meanings: To dream, have a vision, attain to puberty."
    },

    {
        "indexid":1640,
        "wordid":10659,
        "word":"بِعَالِمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word بِعَالِمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}