{"data":[
    {
        "indexid":1642,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":1642,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1642,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1642,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1642,
        "wordid":6389,
        "word":"أَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word أَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":1642,
        "wordid":10641,
        "word":"بَقَرَاتٍ",
        "rootid":89,
        "rootword":"ب ق ر",
        "meanings":"Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities",
        "sentence":"The word بَقَرَاتٍ comes from the root ب ق ر and is associated with the meanings: Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities"
    },

    {
        "indexid":1642,
        "wordid":10642,
        "word":"سِمَانٍ",
        "rootid":841,
        "rootword":"س م ن",
        "meanings":"to be fat, become fleshy, nourish, fat one.",
        "sentence":"The word سِمَانٍ comes from the root س م ن and is associated with the meanings: to be fat, become fleshy, nourish, fat one."
    },

    {
        "indexid":1642,
        "wordid":10643,
        "word":"يَأْكُلُهُنَّ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word يَأْكُلُهُنَّ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":1642,
        "wordid":10644,
        "word":"سَبْعٌ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعٌ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1642,
        "wordid":10645,
        "word":"عِجَافٌ",
        "rootid":1125,
        "rootword":"ع ج ف",
        "meanings":"to become lean, emaciate (animal).",
        "sentence":"The word عِجَافٌ comes from the root ع ج ف and is associated with the meanings: to become lean, emaciate (animal)."
    },

    {
        "indexid":1642,
        "wordid":10647,
        "word":"سُنْبُلَاتٍ",
        "rootid":1034,
        "rootword":"س ن ب ل",
        "meanings":"to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn).",
        "sentence":"The word سُنْبُلَاتٍ comes from the root س ن ب ل and is associated with the meanings: to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn)."
    },

    {
        "indexid":1642,
        "wordid":10648,
        "word":"خُضْرٍ",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word خُضْرٍ comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":1642,
        "wordid":10649,
        "word":"وَأُخَرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word وَأُخَرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":1642,
        "wordid":10650,
        "word":"يَابِسَاتٍ",
        "rootid":775,
        "rootword":"ي ب س",
        "meanings":"withered, dry.",
        "sentence":"The word يَابِسَاتٍ comes from the root ي ب س and is associated with the meanings: withered, dry."
    },

    {
        "indexid":1642,
        "wordid":10663,
        "word":"الصِّدِّيقُ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word الصِّدِّيقُ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":1642,
        "wordid":10664,
        "word":"أَفْتِنَا",
        "rootid":1039,
        "rootword":"ف ت ي",
        "meanings":"to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation.",
        "sentence":"The word أَفْتِنَا comes from the root ف ت ي and is associated with the meanings: to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation."
    },

    {
        "indexid":1642,
        "wordid":10665,
        "word":"سَبْعِ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعِ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1642,
        "wordid":10666,
        "word":"وَسَبْعِ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word وَسَبْعِ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1642,
        "wordid":10668,
        "word":"أَرْجِعُ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word أَرْجِعُ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    }]}