{"data":[
    {
        "indexid":1643,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1643,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1643,
        "wordid":2301,
        "word":"سَبْعَ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعَ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":1643,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1643,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":1643,
        "wordid":4829,
        "word":"تَأْكُلُونَ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word تَأْكُلُونَ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":1643,
        "wordid":10639,
        "word":"سِنِينَ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word سِنِينَ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":1643,
        "wordid":10669,
        "word":"تَزْرَعُونَ",
        "rootid":681,
        "rootword":"ز ر ع",
        "meanings":"To sow seed, cast seed, till the ground, cause [the plants, children] to grow, give increase to, he who sows, reaps, what is raised by means of sowing, seed-produce, what is sown. (Zay Ra Waw 'Ayn = offspring, children, a child)",
        "sentence":"The word تَزْرَعُونَ comes from the root ز ر ع and is associated with the meanings: To sow seed, cast seed, till the ground, cause [the plants, children] to grow, give increase to, he who sows, reaps, what is raised by means of sowing, seed-produce, what is sown. (Zay Ra Waw 'Ayn = offspring, children, a child)"
    },

    {
        "indexid":1643,
        "wordid":10670,
        "word":"دَأَبًا",
        "rootid":1317,
        "rootword":"د ا ب",
        "meanings":"to strive\/exert\/labour\/toil, diligent, zealous, become wearied\/fatigued, held on \/ continue, urge, to drive out\/away, hunt, to pawn, to persevere, to persist, to last, to hold out.A custom\/habit\/manner\/wont, an affair\/business\/concern, deed\/work\/condition.",
        "sentence":"The word دَأَبًا comes from the root د ا ب and is associated with the meanings: to strive\/exert\/labour\/toil, diligent, zealous, become wearied\/fatigued, held on \/ continue, urge, to drive out\/away, hunt, to pawn, to persevere, to persist, to last, to hold out.A custom\/habit\/manner\/wont, an affair\/business\/concern, deed\/work\/condition."
    },

    {
        "indexid":1643,
        "wordid":10671,
        "word":"حَصَدْتُمْ",
        "rootid":932,
        "rootword":"ح ص د",
        "meanings":"To reap, mow, destroy, slay.",
        "sentence":"The word حَصَدْتُمْ comes from the root ح ص د and is associated with the meanings: To reap, mow, destroy, slay."
    },

    {
        "indexid":1643,
        "wordid":10672,
        "word":"فَذَرُوهُ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word فَذَرُوهُ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":1643,
        "wordid":10673,
        "word":"سُنْبُلِهِ",
        "rootid":1034,
        "rootword":"س ن ب ل",
        "meanings":"to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn).",
        "sentence":"The word سُنْبُلِهِ comes from the root س ن ب ل and is associated with the meanings: to put forth ears (of corn). Some consider it to be derived from: sabala - to allow, put out ears (crops), let down, hang down (hairs or ears of corn)."
    }]}