{"data":[
    {
        "indexid":1652,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1652,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1652,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1652,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1652,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1652,
        "wordid":2368,
        "word":"حَيْثُ",
        "rootid":839,
        "rootword":"ح ي ث",
        "meanings":"",
        "sentence":"The word حَيْثُ comes from the root ح ي ث and is associated with the meanings: "
    },

    {
        "indexid":1652,
        "wordid":2556,
        "word":"الْمُحْسِنِينَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْمُحْسِنِينَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1652,
        "wordid":2868,
        "word":"يَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1652,
        "wordid":5413,
        "word":"أَجْرَ",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word أَجْرَ comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    },

    {
        "indexid":1652,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1652,
        "wordid":8700,
        "word":"نُضِيعُ",
        "rootid":772,
        "rootword":"ض ي ع",
        "meanings":"perished, came to nought, passed away, became lost, left alone, neglected, unmindful, destroyed, wasted.",
        "sentence":"The word نُضِيعُ comes from the root ض ي ع and is associated with the meanings: perished, came to nought, passed away, became lost, left alone, neglected, unmindful, destroyed, wasted."
    },

    {
        "indexid":1652,
        "wordid":10520,
        "word":"مَكَّنَّا",
        "rootid":968,
        "rootword":"م ك ن",
        "meanings":"To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing.",
        "sentence":"The word مَكَّنَّا comes from the root م ك ن and is associated with the meanings: To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing."
    },

    {
        "indexid":1652,
        "wordid":10702,
        "word":"يَتَبَوَّأُ",
        "rootid":1076,
        "rootword":"ب و ا",
        "meanings":"returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling.",
        "sentence":"The word يَتَبَوَّأُ comes from the root ب و ا and is associated with the meanings: returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling."
    },

    {
        "indexid":1652,
        "wordid":10703,
        "word":"نُصِيبُ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word نُصِيبُ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":1652,
        "wordid":10704,
        "word":"بِرَحْمَتِنَا",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word بِرَحْمَتِنَا comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    }]}