{"data":[
    {
        "indexid":1687,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1687,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1687,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1687,
        "wordid":5377,
        "word":"لَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word لَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1687,
        "wordid":6225,
        "word":"كُنَّا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنَّا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1687,
        "wordid":10785,
        "word":"تَاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word تَاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1687,
        "wordid":10856,
        "word":"ءَاثَرَكَ",
        "rootid":156,
        "rootword":"ا ث ر",
        "meanings":"to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity.",
        "sentence":"The word ءَاثَرَكَ comes from the root ا ث ر and is associated with the meanings: to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity."
    },

    {
        "indexid":1687,
        "wordid":10857,
        "word":"لَخَاطِءِينَ",
        "rootid":177,
        "rootword":"خ ط ا",
        "meanings":"To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error.",
        "sentence":"The word لَخَاطِءِينَ comes from the root خ ط ا and is associated with the meanings: To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error."
    }]}