{"data":[
    {
        "indexid":1720,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1720,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1720,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1720,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1720,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1720,
        "wordid":2868,
        "word":"يَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1720,
        "wordid":3426,
        "word":"شَدِيدُ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word شَدِيدُ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":1720,
        "wordid":3799,
        "word":"وَالْمَلَائِكَةُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word وَالْمَلَائِكَةُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":1720,
        "wordid":7448,
        "word":"وَيُرْسِلُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَيُرْسِلُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1720,
        "wordid":10978,
        "word":"وَيُسَبِّحُ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word وَيُسَبِّحُ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":1720,
        "wordid":10979,
        "word":"الرَّعْدُ",
        "rootid":1015,
        "rootword":"ر ع د",
        "meanings":"to thunder, threaten of war.",
        "sentence":"The word الرَّعْدُ comes from the root ر ع د and is associated with the meanings: to thunder, threaten of war."
    },

    {
        "indexid":1720,
        "wordid":10980,
        "word":"بِحَمْدِهِ",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word بِحَمْدِهِ comes from the root ح م د and is associated with the meanings: To praise."
    },

    {
        "indexid":1720,
        "wordid":10981,
        "word":"خِيفَتِهِ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خِيفَتِهِ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":1720,
        "wordid":10982,
        "word":"الصَّوَاعِقَ",
        "rootid":622,
        "rootword":"ص ع ق",
        "meanings":"to smite or strike (lightning, thunderbolt), swoon, become unconscious, be stunned, faint.. sa'iqun - one in a swoon.. saAAiqat  (pl. sawaAAiq) - stunning noise as of a thunderbolt, vehement cry, thunderbolt, thunderclap, destructive calamity, death, noise.",
        "sentence":"The word الصَّوَاعِقَ comes from the root ص ع ق and is associated with the meanings: to smite or strike (lightning, thunderbolt), swoon, become unconscious, be stunned, faint.. sa'iqun - one in a swoon.. saAAiqat  (pl. sawaAAiq) - stunning noise as of a thunderbolt, vehement cry, thunderbolt, thunderclap, destructive calamity, death, noise."
    },

    {
        "indexid":1720,
        "wordid":10983,
        "word":"فَيُصِيبُ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word فَيُصِيبُ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":1720,
        "wordid":10984,
        "word":"يُجَادِلُونَ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word يُجَادِلُونَ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":1720,
        "wordid":10985,
        "word":"الْمِحَالِ",
        "rootid":959,
        "rootword":"م ح ل",
        "meanings":"To labour skillfully, excercise art or management.",
        "sentence":"The word الْمِحَالِ comes from the root م ح ل and is associated with the meanings: To labour skillfully, excercise art or management."
    }]}