{"data":[
    {
        "indexid":1815,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1815,
        "wordid":2034,
        "word":"يُؤْمِنُونَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُونَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1815,
        "wordid":2727,
        "word":"وَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1815,
        "wordid":3215,
        "word":"خَلَتْ",
        "rootid":1339,
        "rootword":"خ ل و",
        "meanings":"To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed).",
        "sentence":"The word خَلَتْ comes from the root خ ل و and is associated with the meanings: To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed)."
    },

    {
        "indexid":1815,
        "wordid":7297,
        "word":"الْأَوَّلِينَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word الْأَوَّلِينَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":1815,
        "wordid":11305,
        "word":"سُنَّةُ",
        "rootid":998,
        "rootword":"س ن ن",
        "meanings":"to clean (the teeth), seize with the teeth, establish the law, follow a path, form. sinnun - tooth. sunnatun\/sunanun - line of conduct, mode of life, behaviour, example, dispensation. masnun - formed, made\/moulded into shape, polished, shiny and bright (face).",
        "sentence":"The word سُنَّةُ comes from the root س ن ن and is associated with the meanings: to clean (the teeth), seize with the teeth, establish the law, follow a path, form. sinnun - tooth. sunnatun\/sunanun - line of conduct, mode of life, behaviour, example, dispensation. masnun - formed, made\/moulded into shape, polished, shiny and bright (face)."
    }]}