{"data":[
    {
        "indexid":1819,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1819,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1819,
        "wordid":11315,
        "word":"وَحَفِظْنَاهَا",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word وَحَفِظْنَاهَا comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":1819,
        "wordid":11317,
        "word":"رَجِيمٍ",
        "rootid":1542,
        "rootword":"ر ج م",
        "meanings":"to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned.",
        "sentence":"The word رَجِيمٍ comes from the root ر ج م and is associated with the meanings: to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned."
    }]}