{"data":[
    {
        "indexid":1820,
        "wordid":3446,
        "word":"مُبِينٌ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٌ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":1820,
        "wordid":3646,
        "word":"مَنِ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنِ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1820,
        "wordid":8717,
        "word":"فَأَتْبَعَهُ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word فَأَتْبَعَهُ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":1820,
        "wordid":9804,
        "word":"السَّمْعَ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word السَّمْعَ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":1820,
        "wordid":11318,
        "word":"اسْتَرَقَ",
        "rootid":639,
        "rootword":"س ر ق",
        "meanings":"to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals.",
        "sentence":"The word اسْتَرَقَ comes from the root س ر ق and is associated with the meanings: to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals."
    },

    {
        "indexid":1820,
        "wordid":11319,
        "word":"شِهَابٌ",
        "rootid":1391,
        "rootword":"ش ه ب",
        "meanings":"to burn\/scorch, become of a colour in which whiteness predominates over blackness. shihaab (pl. shuhub) - flaming fire, bright blaze\/meteor, star, penetrating flame, shining star, brisk\/sprightly, flame, brand, radiating or gleaming fire, shooting or falling star. shihaab al-herb - dauntless warrior, one who is penetrating sharp and energetic in war.",
        "sentence":"The word شِهَابٌ comes from the root ش ه ب and is associated with the meanings: to burn\/scorch, become of a colour in which whiteness predominates over blackness. shihaab (pl. shuhub) - flaming fire, bright blaze\/meteor, star, penetrating flame, shining star, brisk\/sprightly, flame, brand, radiating or gleaming fire, shooting or falling star. shihaab al-herb - dauntless warrior, one who is penetrating sharp and energetic in war."
    }]}