{"data":[
    {
        "indexid":1909,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1909,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1909,
        "wordid":2212,
        "word":"تَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1909,
        "wordid":11468,
        "word":"وَالْخَيْلَ",
        "rootid":656,
        "rootword":"خ ي ل",
        "meanings":"To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse).",
        "sentence":"The word وَالْخَيْلَ comes from the root خ ي ل and is associated with the meanings: To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse)."
    },

    {
        "indexid":1909,
        "wordid":11469,
        "word":"وَالْبِغَالَ",
        "rootid":509,
        "rootword":"ب غ ل",
        "meanings":"Affecting or showing stupidity, dullness or want of intelligenceBeing submissive, humbleBig, thick, rude, hard, strong, sturdy in body or physicallyAnimals going in a gentle mannerMule(s)",
        "sentence":"The word وَالْبِغَالَ comes from the root ب غ ل and is associated with the meanings: Affecting or showing stupidity, dullness or want of intelligenceBeing submissive, humbleBig, thick, rude, hard, strong, sturdy in body or physicallyAnimals going in a gentle mannerMule(s)"
    },

    {
        "indexid":1909,
        "wordid":11470,
        "word":"وَالْحَمِيرَ",
        "rootid":407,
        "rootword":"ح م ر",
        "meanings":"To excoriate, pare a thong of leather, flay (sheep), strip off superficial part (e.g. peel, bark, etc..)",
        "sentence":"The word وَالْحَمِيرَ comes from the root ح م ر and is associated with the meanings: To excoriate, pare a thong of leather, flay (sheep), strip off superficial part (e.g. peel, bark, etc..)"
    },

    {
        "indexid":1909,
        "wordid":11471,
        "word":"لِتَرْكَبُوهَا",
        "rootid":491,
        "rootword":"ر ك ب",
        "meanings":"to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend.",
        "sentence":"The word لِتَرْكَبُوهَا comes from the root ر ك ب and is associated with the meanings: to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend."
    },

    {
        "indexid":1909,
        "wordid":11472,
        "word":"وَزِينَةً",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word وَزِينَةً comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":1909,
        "wordid":11473,
        "word":"وَيَخْلُقُ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word وَيَخْلُقُ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    }]}