{"data":[
    {
        "indexid":1949,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1949,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1949,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1949,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1949,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1949,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1949,
        "wordid":2297,
        "word":"خَلَقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":1949,
        "wordid":2550,
        "word":"سُجَّدًا",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word سُجَّدًا comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":1949,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1949,
        "wordid":4295,
        "word":"أَوَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَوَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1949,
        "wordid":7218,
        "word":"يَرَوْا",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word يَرَوْا comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1949,
        "wordid":11549,
        "word":"يَتَفَيَّؤُا",
        "rootid":495,
        "rootword":"ف ي ا",
        "meanings":"to return, go back, go from (a vow), bring under the authority, change its place, shift, turn (shadow). fai - shade, gain of war, prisoner of war.",
        "sentence":"The word يَتَفَيَّؤُا comes from the root ف ي ا and is associated with the meanings: to return, go back, go from (a vow), bring under the authority, change its place, shift, turn (shadow). fai - shade, gain of war, prisoner of war."
    },

    {
        "indexid":1949,
        "wordid":11550,
        "word":"ظِلَالُهُ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word ظِلَالُهُ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    },

    {
        "indexid":1949,
        "wordid":11551,
        "word":"الْيَمِينِ",
        "rootid":114,
        "rootword":"ي م ن",
        "meanings":"right side, right, right hand, oath.",
        "sentence":"The word الْيَمِينِ comes from the root ي م ن and is associated with the meanings: right side, right, right hand, oath."
    },

    {
        "indexid":1949,
        "wordid":11552,
        "word":"وَالشَّمَائِلِ",
        "rootid":887,
        "rootword":"ش م ل",
        "meanings":"to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths.",
        "sentence":"The word وَالشَّمَائِلِ comes from the root ش م ل and is associated with the meanings: to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths."
    },

    {
        "indexid":1949,
        "wordid":11553,
        "word":"دَاخِرُونَ",
        "rootid":267,
        "rootword":"د خ ر",
        "meanings":"To be small, mean, lowly, of no value or account, abject, humbled.",
        "sentence":"The word دَاخِرُونَ comes from the root د خ ر and is associated with the meanings: To be small, mean, lowly, of no value or account, abject, humbled."
    }]}