{"data":[
    {
        "indexid":1963,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1963,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1963,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1963,
        "wordid":2231,
        "word":"النَّارَ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارَ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1963,
        "wordid":4953,
        "word":"الْكَذِبَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word الْكَذِبَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":1963,
        "wordid":6218,
        "word":"الْحُسْنَى",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْحُسْنَى comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1963,
        "wordid":10071,
        "word":"جَرَمَ",
        "rootid":387,
        "rootword":"ج ر م",
        "meanings":"",
        "sentence":"The word جَرَمَ comes from the root ج ر م and is associated with the meanings: "
    },

    {
        "indexid":1963,
        "wordid":11566,
        "word":"وَيَجْعَلُونَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَيَجْعَلُونَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1963,
        "wordid":11583,
        "word":"يَكْرَهُونَ",
        "rootid":49,
        "rootword":"ك ر ه",
        "meanings":"To find difficult, dislike, disapprove, feel aversion to, be averse from, loathe, abhor, hate, detest, be unwilling.",
        "sentence":"The word يَكْرَهُونَ comes from the root ك ر ه and is associated with the meanings: To find difficult, dislike, disapprove, feel aversion to, be averse from, loathe, abhor, hate, detest, be unwilling."
    },

    {
        "indexid":1963,
        "wordid":11584,
        "word":"وَتَصِفُ",
        "rootid":245,
        "rootword":"و ص ف",
        "meanings":"to describe (good or bad), assert something as a fact, achieve, ascribe, specify.",
        "sentence":"The word وَتَصِفُ comes from the root و ص ف and is associated with the meanings: to describe (good or bad), assert something as a fact, achieve, ascribe, specify."
    },

    {
        "indexid":1963,
        "wordid":11585,
        "word":"أَلْسِنَتُهُمُ",
        "rootid":227,
        "rootword":"ل س ن",
        "meanings":"a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech.",
        "sentence":"The word أَلْسِنَتُهُمُ comes from the root ل س ن and is associated with the meanings: a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech."
    },

    {
        "indexid":1963,
        "wordid":11586,
        "word":"مُفْرَطُونَ",
        "rootid":200,
        "rootword":"ف ر ط",
        "meanings":"to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left.",
        "sentence":"The word مُفْرَطُونَ comes from the root ف ر ط and is associated with the meanings: to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left."
    }]}