{"data":[
    {
        "indexid":1976,
        "wordid":2004,
        "word":"الْحَمْدُ",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word الْحَمْدُ comes from the root ح م د and is associated with the meanings: To praise."
    },

    {
        "indexid":1976,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1976,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1976,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1976,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1976,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1976,
        "wordid":2206,
        "word":"رِزْقًا",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word رِزْقًا comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":1976,
        "wordid":2261,
        "word":"مَثَلًا",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مَثَلًا comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":1976,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1976,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":1976,
        "wordid":2934,
        "word":"أَكْثَرُهُمْ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word أَكْثَرُهُمْ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":1976,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1976,
        "wordid":3162,
        "word":"مِنَّا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَّا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1976,
        "wordid":3565,
        "word":"فَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word فَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1976,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":1976,
        "wordid":4061,
        "word":"سِرًّا",
        "rootid":478,
        "rootword":"س ر ر",
        "meanings":"glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne.",
        "sentence":"The word سِرًّا comes from the root س ر ر and is associated with the meanings: glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne."
    },

    {
        "indexid":1976,
        "wordid":4117,
        "word":"حَسَنًا",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حَسَنًا comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1976,
        "wordid":4329,
        "word":"يُنْفِقُ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word يُنْفِقُ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":1976,
        "wordid":6525,
        "word":"عَبْدًا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَبْدًا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":1976,
        "wordid":9172,
        "word":"يَسْتَوُونَ",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word يَسْتَوُونَ comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":1976,
        "wordid":11183,
        "word":"ضَرَبَ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word ضَرَبَ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":1976,
        "wordid":11627,
        "word":"مَمْلُوكًا",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَمْلُوكًا comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":1976,
        "wordid":11628,
        "word":"يَقْدِرُ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word يَقْدِرُ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":1976,
        "wordid":11629,
        "word":"رَزَقْنَاهُ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word رَزَقْنَاهُ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":1976,
        "wordid":11630,
        "word":"وَجَهْرًا",
        "rootid":1244,
        "rootword":"ج ه ر",
        "meanings":"become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass",
        "sentence":"The word وَجَهْرًا comes from the root ج ه ر and is associated with the meanings: become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass"
    }]}