{"data":[
    {
        "indexid":2033,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2033,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2033,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2033,
        "wordid":2410,
        "word":"إِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word إِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":2033,
        "wordid":2779,
        "word":"بَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":2033,
        "wordid":2811,
        "word":"الْكِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":2033,
        "wordid":4496,
        "word":"كَبِيرًا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرًا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":2033,
        "wordid":9550,
        "word":"مَرَّتَيْنِ",
        "rootid":1074,
        "rootword":"م ر ر",
        "meanings":"To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile.",
        "sentence":"The word مَرَّتَيْنِ comes from the root م ر ر and is associated with the meanings: To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile."
    },

    {
        "indexid":2033,
        "wordid":11395,
        "word":"وَقَضَيْنَا",
        "rootid":1066,
        "rootword":"ق ض ي",
        "meanings":"to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal.",
        "sentence":"The word وَقَضَيْنَا comes from the root ق ض ي and is associated with the meanings: to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal."
    },

    {
        "indexid":2033,
        "wordid":11783,
        "word":"لَتُفْسِدُنَّ",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word لَتُفْسِدُنَّ comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":2033,
        "wordid":11784,
        "word":"وَلَتَعْلُنَّ",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word وَلَتَعْلُنَّ comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":2033,
        "wordid":11785,
        "word":"عُلُوًّا",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word عُلُوًّا comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    }]}