{"data":[
    {
        "indexid":2060,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2060,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":2060,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2060,
        "wordid":4042,
        "word":"أَوْلَادَكُمْ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word أَوْلَادَكُمْ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":2060,
        "wordid":4496,
        "word":"كَبِيرًا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرًا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":2060,
        "wordid":5812,
        "word":"تَقْتُلُوا",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word تَقْتُلُوا comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":2060,
        "wordid":6384,
        "word":"وَإِيَّاكُمْ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word وَإِيَّاكُمْ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":2060,
        "wordid":7924,
        "word":"إِمْلَاقٍ",
        "rootid":108,
        "rootword":"م ل ق",
        "meanings":"To flay a person, also to behave in a loving and affectionate manner towards someone, run swiftly, be vehement in journeying.",
        "sentence":"The word إِمْلَاقٍ comes from the root م ل ق and is associated with the meanings: To flay a person, also to behave in a loving and affectionate manner towards someone, run swiftly, be vehement in journeying."
    },

    {
        "indexid":2060,
        "wordid":11894,
        "word":"خَشْيَةَ",
        "rootid":649,
        "rootword":"خ ش ي",
        "meanings":"To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary.",
        "sentence":"The word خَشْيَةَ comes from the root خ ش ي and is associated with the meanings: To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary."
    },

    {
        "indexid":2060,
        "wordid":11895,
        "word":"نَرْزُقُهُمْ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word نَرْزُقُهُمْ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":2060,
        "wordid":11896,
        "word":"قَتْلَهُمْ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قَتْلَهُمْ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":2060,
        "wordid":11897,
        "word":"خِطْءًا",
        "rootid":177,
        "rootword":"خ ط ا",
        "meanings":"To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error.",
        "sentence":"The word خِطْءًا comes from the root خ ط ا and is associated with the meanings: To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error."
    }]}