{"data":[
    {
        "indexid":2105,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2105,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2105,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2105,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2105,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2105,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":2105,
        "wordid":2694,
        "word":"كَادُوا",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word كَادُوا comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":2105,
        "wordid":12034,
        "word":"لَيَسْتَفِزُّونَكَ",
        "rootid":647,
        "rootword":"ف ز ز",
        "meanings":"to remove, provoke, expel, unsettle, be scared away from, turn away, startle. istafazza (vb. 10) - to excite, make active, deceive, unsettle, remove, expel, lead to destruction, make weak by humiliating, entail loss of right of citizenship.",
        "sentence":"The word لَيَسْتَفِزُّونَكَ comes from the root ف ز ز and is associated with the meanings: to remove, provoke, expel, unsettle, be scared away from, turn away, startle. istafazza (vb. 10) - to excite, make active, deceive, unsettle, remove, expel, lead to destruction, make weak by humiliating, entail loss of right of citizenship."
    },

    {
        "indexid":2105,
        "wordid":12035,
        "word":"لِيُخْرِجُوكَ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word لِيُخْرِجُوكَ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":2105,
        "wordid":12036,
        "word":"يَلْبَثُونَ",
        "rootid":812,
        "rootword":"ل ب ث",
        "meanings":"to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb.",
        "sentence":"The word يَلْبَثُونَ comes from the root ل ب ث and is associated with the meanings: to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb."
    },

    {
        "indexid":2105,
        "wordid":12037,
        "word":"خِلَافَكَ",
        "rootid":1232,
        "rootword":"خ ل ف",
        "meanings":"To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar",
        "sentence":"The word خِلَافَكَ comes from the root خ ل ف and is associated with the meanings: To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar"
    }]}