{"data":[
    {
        "indexid":2108,
        "wordid":2074,
        "word":"وَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2108,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2108,
        "wordid":2308,
        "word":"رَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2108,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2108,
        "wordid":12049,
        "word":"فَتَهَجَّدْ",
        "rootid":1532,
        "rootword":"ه ج د",
        "meanings":"to sleep watch, remain awake. hajjada - to awake from sleep, pray in the night. ahjad - to lay the neck upon the ground (camel). tohajjad - remain awake.",
        "sentence":"The word فَتَهَجَّدْ comes from the root ه ج د and is associated with the meanings: to sleep watch, remain awake. hajjada - to awake from sleep, pray in the night. ahjad - to lay the neck upon the ground (camel). tohajjad - remain awake."
    },

    {
        "indexid":2108,
        "wordid":12050,
        "word":"نَافِلَةً",
        "rootid":977,
        "rootword":"ن ف ل",
        "meanings":"give spoil, gift, voluntary gift, accession\/addition, something that exceeds the original, a deed beyond what is obligatory.",
        "sentence":"The word نَافِلَةً comes from the root ن ف ل and is associated with the meanings: give spoil, gift, voluntary gift, accession\/addition, something that exceeds the original, a deed beyond what is obligatory."
    },

    {
        "indexid":2108,
        "wordid":12051,
        "word":"يَبْعَثَكَ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word يَبْعَثَكَ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":2108,
        "wordid":12052,
        "word":"مَقَامًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مَقَامًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":2108,
        "wordid":12053,
        "word":"مَحْمُودًا",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word مَحْمُودًا comes from the root ح م د and is associated with the meanings: To praise."
    }]}