{"data":[
    {
        "indexid":2118,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2118,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":2118,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2118,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2118,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2118,
        "wordid":2787,
        "word":"لِلنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word لِلنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":2118,
        "wordid":10894,
        "word":"أَكْثَرُ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word أَكْثَرُ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":2118,
        "wordid":11926,
        "word":"صَرَّفْنَا",
        "rootid":903,
        "rootword":"ص ر ف",
        "meanings":"to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside.",
        "sentence":"The word صَرَّفْنَا comes from the root ص ر ف and is associated with the meanings: to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside."
    },

    {
        "indexid":2118,
        "wordid":11927,
        "word":"الْقُرْءَانِ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانِ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":2118,
        "wordid":12081,
        "word":"مَثَلٍ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مَثَلٍ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":2118,
        "wordid":12082,
        "word":"فَأَبَى",
        "rootid":1575,
        "rootword":"ا ب ي",
        "meanings":"refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant.",
        "sentence":"The word فَأَبَى comes from the root ا ب ي and is associated with the meanings: refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant."
    },

    {
        "indexid":2118,
        "wordid":12083,
        "word":"كُفُورًا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كُفُورًا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}