{"data":[
    {
        "indexid":2137,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2137,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2137,
        "wordid":4574,
        "word":"رَبِّنَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّنَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2137,
        "wordid":4952,
        "word":"وَيَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَيَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2137,
        "wordid":11065,
        "word":"وَعْدُ",
        "rootid":732,
        "rootword":"و ع د",
        "meanings":"to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise.",
        "sentence":"The word وَعْدُ comes from the root و ع د and is associated with the meanings: to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise."
    },

    {
        "indexid":2137,
        "wordid":11772,
        "word":"سُبْحَانَ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word سُبْحَانَ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":2137,
        "wordid":12138,
        "word":"لَمَفْعُولًا",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word لَمَفْعُولًا comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    }]}