{"data":[
    {
        "indexid":2138,
        "wordid":6531,
        "word":"وَيَزِيدُهُمْ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word وَيَزِيدُهُمْ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":2138,
        "wordid":10484,
        "word":"يَبْكُونَ",
        "rootid":620,
        "rootword":"ب ك ي",
        "meanings":"wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak.",
        "sentence":"The word يَبْكُونَ comes from the root ب ك ي and is associated with the meanings: wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak."
    },

    {
        "indexid":2138,
        "wordid":12137,
        "word":"لِلْأَذْقَانِ",
        "rootid":81,
        "rootword":"ذ ق ن",
        "meanings":"to strike on the chin, lean the chin upon (with ala), chin, although its primary meaning is chin it may be rendered as face.To straighten.A decrepit\/old\/weak man.",
        "sentence":"The word لِلْأَذْقَانِ comes from the root ذ ق ن and is associated with the meanings: to strike on the chin, lean the chin upon (with ala), chin, although its primary meaning is chin it may be rendered as face.To straighten.A decrepit\/old\/weak man."
    },

    {
        "indexid":2138,
        "wordid":12139,
        "word":"وَيَخِرُّونَ",
        "rootid":1071,
        "rootword":"خ ر ر",
        "meanings":"To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another.",
        "sentence":"The word وَيَخِرُّونَ comes from the root خ ر ر and is associated with the meanings: To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another."
    },

    {
        "indexid":2138,
        "wordid":12140,
        "word":"خُشُوعًا",
        "rootid":1458,
        "rootword":"خ ش ع",
        "meanings":"Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful.",
        "sentence":"The word خُشُوعًا comes from the root خ ش ع and is associated with the meanings: Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful."
    }]}