{"data":[
    {
        "indexid":2151,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2151,
        "wordid":2164,
        "word":"ءَاذَانِهِمْ",
        "rootid":961,
        "rootword":"ا ذ ن",
        "meanings":"he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning.",
        "sentence":"The word ءَاذَانِهِمْ comes from the root ا ذ ن and is associated with the meanings: he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning."
    },

    {
        "indexid":2151,
        "wordid":10639,
        "word":"سِنِينَ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word سِنِينَ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":2151,
        "wordid":12169,
        "word":"الْكَهْفِ",
        "rootid":1472,
        "rootword":"ك ه ف",
        "meanings":"To fill caves or places of protection.",
        "sentence":"The word الْكَهْفِ comes from the root ك ه ف and is associated with the meanings: To fill caves or places of protection."
    },

    {
        "indexid":2151,
        "wordid":12175,
        "word":"فَضَرَبْنَا",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word فَضَرَبْنَا comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":2151,
        "wordid":12176,
        "word":"عَدَدًا",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word عَدَدًا comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    }]}