{"data":[
    {
        "indexid":2165,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2165,
        "wordid":10639,
        "word":"سِنِينَ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word سِنِينَ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":2165,
        "wordid":12197,
        "word":"كَهْفِهِمْ",
        "rootid":1472,
        "rootword":"ك ه ف",
        "meanings":"To fill caves or places of protection.",
        "sentence":"The word كَهْفِهِمْ comes from the root ك ه ف and is associated with the meanings: To fill caves or places of protection."
    },

    {
        "indexid":2165,
        "wordid":12257,
        "word":"وَلَبِثُوا",
        "rootid":812,
        "rootword":"ل ب ث",
        "meanings":"to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb.",
        "sentence":"The word وَلَبِثُوا comes from the root ل ب ث and is associated with the meanings: to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb."
    },

    {
        "indexid":2165,
        "wordid":12258,
        "word":"ثَلَاثَ",
        "rootid":193,
        "rootword":"ث ل ث",
        "meanings":"to make a third part of a thing, one third, by threes.",
        "sentence":"The word ثَلَاثَ comes from the root ث ل ث and is associated with the meanings: to make a third part of a thing, one third, by threes."
    },

    {
        "indexid":2165,
        "wordid":12259,
        "word":"مِائَةٍ",
        "rootid":425,
        "rootword":"م ا ي",
        "meanings":"hundred",
        "sentence":"The word مِائَةٍ comes from the root م ا ي and is associated with the meanings: hundred"
    },

    {
        "indexid":2165,
        "wordid":12260,
        "word":"وَازْدَادُوا",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word وَازْدَادُوا comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":2165,
        "wordid":12261,
        "word":"تِسْعًا",
        "rootid":508,
        "rootword":"ت س ع",
        "meanings":"To be the ninth, nine.",
        "sentence":"The word تِسْعًا comes from the root ت س ع and is associated with the meanings: To be the ninth, nine."
    }]}