{"data":[
    {
        "indexid":2168,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2168,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2168,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2168,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":2168,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2168,
        "wordid":2817,
        "word":"الْحَيَوةِ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةِ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":2168,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":2168,
        "wordid":3038,
        "word":"وَجْهَهُ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وَجْهَهُ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":2168,
        "wordid":3908,
        "word":"يَدْعُونَ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word يَدْعُونَ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":2168,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2168,
        "wordid":5552,
        "word":"رَبَّهُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2168,
        "wordid":5990,
        "word":"يُرِيدُونَ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُونَ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2168,
        "wordid":6121,
        "word":"نَفْسَكَ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word نَفْسَكَ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":2168,
        "wordid":6347,
        "word":"وَاتَّبَعَ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word وَاتَّبَعَ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":2168,
        "wordid":7405,
        "word":"بِالْغَدَوةِ",
        "rootid":1182,
        "rootword":"غ د و",
        "meanings":"early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day",
        "sentence":"The word بِالْغَدَوةِ comes from the root غ د و and is associated with the meanings: early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day"
    },

    {
        "indexid":2168,
        "wordid":7734,
        "word":"تُطِعْ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word تُطِعْ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":2168,
        "wordid":8106,
        "word":"زِينَةَ",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word زِينَةَ comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":2168,
        "wordid":8724,
        "word":"هَوَاهُ",
        "rootid":1497,
        "rootword":"ه و ي",
        "meanings":"to fall steep as a bird to its prey, rev, perish, pull down, destroy, disappear, yearn, fancy, beguile, infatuate, be blown, inspire with low passion.",
        "sentence":"The word هَوَاهُ comes from the root ه و ي and is associated with the meanings: to fall steep as a bird to its prey, rev, perish, pull down, destroy, disappear, yearn, fancy, beguile, infatuate, be blown, inspire with low passion."
    },

    {
        "indexid":2168,
        "wordid":10008,
        "word":"وَاصْبِرْ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word وَاصْبِرْ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":2168,
        "wordid":12267,
        "word":"تَعْدُ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word تَعْدُ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":2168,
        "wordid":12268,
        "word":"عَيْنَاكَ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عَيْنَاكَ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":2168,
        "wordid":12269,
        "word":"تُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word تُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2168,
        "wordid":12270,
        "word":"أَغْفَلْنَا",
        "rootid":921,
        "rootword":"غ ف ل",
        "meanings":"unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away",
        "sentence":"The word أَغْفَلْنَا comes from the root غ ف ل and is associated with the meanings: unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away"
    },

    {
        "indexid":2168,
        "wordid":12271,
        "word":"قَلْبَهُ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قَلْبَهُ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":2168,
        "wordid":12272,
        "word":"ذِكْرِنَا",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرِنَا comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2168,
        "wordid":12273,
        "word":"أَمْرُهُ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرُهُ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2168,
        "wordid":12274,
        "word":"فُرُطًا",
        "rootid":200,
        "rootword":"ف ر ط",
        "meanings":"to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left.",
        "sentence":"The word فُرُطًا comes from the root ف ر ط and is associated with the meanings: to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left."
    }]}