{"data":[
    {
        "indexid":2169,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2169,
        "wordid":2140,
        "word":"نَارًا",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارًا comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":2169,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2169,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2169,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":2169,
        "wordid":2400,
        "word":"فَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2169,
        "wordid":2490,
        "word":"رَبِّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2169,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2169,
        "wordid":4386,
        "word":"لِلظَّالِمِينَ",
        "rootid":434,
        "rootword":"ظ ل م",
        "meanings":"Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]",
        "sentence":"The word لِلظَّالِمِينَ comes from the root ظ ل م and is associated with the meanings: Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]"
    },

    {
        "indexid":2169,
        "wordid":5715,
        "word":"أَعْتَدْنَا",
        "rootid":851,
        "rootword":"ع ت د",
        "meanings":"to be ready, prepared, at hand, provide a thing for the future.",
        "sentence":"The word أَعْتَدْنَا comes from the root ع ت د and is associated with the meanings: to be ready, prepared, at hand, provide a thing for the future."
    },

    {
        "indexid":2169,
        "wordid":6230,
        "word":"وَسَاءَتْ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word وَسَاءَتْ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":2169,
        "wordid":9568,
        "word":"وَقُلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقُلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2169,
        "wordid":10354,
        "word":"بِئْسَ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word بِئْسَ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":2169,
        "wordid":10933,
        "word":"بِمَاءٍ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word بِمَاءٍ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":2169,
        "wordid":11979,
        "word":"أَحَاطَ",
        "rootid":289,
        "rootword":"ح و ط",
        "meanings":"To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method.",
        "sentence":"The word أَحَاطَ comes from the root ح و ط and is associated with the meanings: To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method."
    },

    {
        "indexid":2169,
        "wordid":12275,
        "word":"فَلْيُؤْمِنْ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word فَلْيُؤْمِنْ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2169,
        "wordid":12276,
        "word":"فَلْيَكْفُرْ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word فَلْيَكْفُرْ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":2169,
        "wordid":12277,
        "word":"سُرَادِقُهَا",
        "rootid":964,
        "rootword":"س ر د ق",
        "meanings":"to set a pavilion, cover with an awning, set upper story or housetop, shed (courtyard).",
        "sentence":"The word سُرَادِقُهَا comes from the root س ر د ق and is associated with the meanings: to set a pavilion, cover with an awning, set upper story or housetop, shed (courtyard)."
    },

    {
        "indexid":2169,
        "wordid":12278,
        "word":"يَسْتَغِيثُوا",
        "rootid":803,
        "rootword":"غ و ث",
        "meanings":"name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity.",
        "sentence":"The word يَسْتَغِيثُوا comes from the root غ و ث and is associated with the meanings: name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity."
    },

    {
        "indexid":2169,
        "wordid":12279,
        "word":"يُغَاثُوا",
        "rootid":803,
        "rootword":"غ و ث",
        "meanings":"name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity.",
        "sentence":"The word يُغَاثُوا comes from the root غ و ث and is associated with the meanings: name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity."
    },

    {
        "indexid":2169,
        "wordid":12280,
        "word":"كَالْمُهْلِ",
        "rootid":905,
        "rootword":"م ه ل",
        "meanings":"To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite.",
        "sentence":"The word كَالْمُهْلِ comes from the root م ه ل and is associated with the meanings: To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite."
    },

    {
        "indexid":2169,
        "wordid":12281,
        "word":"يَشْوِي",
        "rootid":1087,
        "rootword":"ش و ي",
        "meanings":"to roast\/scald\/grill. shawan - scalp, skin of head, skin even to the extremities (of the body).",
        "sentence":"The word يَشْوِي comes from the root ش و ي and is associated with the meanings: to roast\/scald\/grill. shawan - scalp, skin of head, skin even to the extremities (of the body)."
    },

    {
        "indexid":2169,
        "wordid":12282,
        "word":"الْوُجُوهَ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word الْوُجُوهَ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":2169,
        "wordid":12283,
        "word":"الشَّرَابُ",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word الشَّرَابُ comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":2169,
        "wordid":12284,
        "word":"مُرْتَفَقًا",
        "rootid":1367,
        "rootword":"ر ف ق",
        "meanings":"to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow.",
        "sentence":"The word مُرْتَفَقًا comes from the root ر ف ق and is associated with the meanings: to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow."
    }]}