{"data":[
    {
        "indexid":2171,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2171,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":2171,
        "wordid":2244,
        "word":"الْأَنْهَارُ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word الْأَنْهَارُ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":2171,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2171,
        "wordid":8144,
        "word":"تَحْتِهِمُ",
        "rootid":1266,
        "rootword":"ت ح ت",
        "meanings":"(taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran.",
        "sentence":"The word تَحْتِهِمُ comes from the root ت ح ت and is associated with the meanings: (taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran."
    },

    {
        "indexid":2171,
        "wordid":8967,
        "word":"نِعْمَ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":2171,
        "wordid":9433,
        "word":"عَدْنٍ",
        "rootid":1402,
        "rootword":"ع د ن",
        "meanings":"to abide constantly, stay in (a place), remain, everlasting.",
        "sentence":"The word عَدْنٍ comes from the root ع د ن and is associated with the meanings: to abide constantly, stay in (a place), remain, everlasting."
    },

    {
        "indexid":2171,
        "wordid":11034,
        "word":"جَنَّاتُ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word جَنَّاتُ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":2171,
        "wordid":12284,
        "word":"مُرْتَفَقًا",
        "rootid":1367,
        "rootword":"ر ف ق",
        "meanings":"to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow.",
        "sentence":"The word مُرْتَفَقًا comes from the root ر ف ق and is associated with the meanings: to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow."
    },

    {
        "indexid":2171,
        "wordid":12285,
        "word":"يُحَلَّوْنَ",
        "rootid":1788,
        "rootword":"ح ل ي",
        "meanings":"To give ornaments, adorn with ornaments.",
        "sentence":"The word يُحَلَّوْنَ comes from the root ح ل ي and is associated with the meanings: To give ornaments, adorn with ornaments."
    },

    {
        "indexid":2171,
        "wordid":12286,
        "word":"أَسَاوِرَ",
        "rootid":1014,
        "rootword":"س و ر",
        "meanings":"leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure.",
        "sentence":"The word أَسَاوِرَ comes from the root س و ر and is associated with the meanings: leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure."
    },

    {
        "indexid":2171,
        "wordid":12287,
        "word":"ذَهَبٍ",
        "rootid":1657,
        "rootword":"ذ ه ب",
        "meanings":"to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold.",
        "sentence":"The word ذَهَبٍ comes from the root ذ ه ب and is associated with the meanings: to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold."
    },

    {
        "indexid":2171,
        "wordid":12288,
        "word":"وَيَلْبَسُونَ",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word وَيَلْبَسُونَ comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    },

    {
        "indexid":2171,
        "wordid":12289,
        "word":"ثِيَابًا",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word ثِيَابًا comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    },

    {
        "indexid":2171,
        "wordid":12290,
        "word":"خُضْرًا",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word خُضْرًا comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":2171,
        "wordid":12291,
        "word":"سُنْدُسٍ",
        "rootid":506,
        "rootword":"س ن د س",
        "meanings":"fine silk-brocade (also see siin-nun-dal).",
        "sentence":"The word سُنْدُسٍ comes from the root س ن د س and is associated with the meanings: fine silk-brocade (also see siin-nun-dal)."
    },

    {
        "indexid":2171,
        "wordid":12292,
        "word":"وَإِسْتَبْرَقٍ",
        "rootid":918,
        "rootword":"ب ر ق",
        "meanings":"Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness",
        "sentence":"The word وَإِسْتَبْرَقٍ comes from the root ب ر ق and is associated with the meanings: Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness"
    },

    {
        "indexid":2171,
        "wordid":12293,
        "word":"مُتَّكِئِينَ",
        "rootid":1201,
        "rootword":"و ك ا",
        "meanings":"to recline.",
        "sentence":"The word مُتَّكِئِينَ comes from the root و ك ا and is associated with the meanings: to recline."
    },

    {
        "indexid":2171,
        "wordid":12294,
        "word":"الْأَرَائِكِ",
        "rootid":341,
        "rootword":"ا ر ك",
        "meanings":"camels feeding\/eating on a certain tree termed (Alif-Ra-Alif-Kaf) or camels remained, or continued, among trees of that kind; to persist or preserver; He compelled him or constrained him, to do the thing, or affair; or made him to keep, or cleave, to it; herbage in which the camels remain or continue, couch.",
        "sentence":"The word الْأَرَائِكِ comes from the root ا ر ك and is associated with the meanings: camels feeding\/eating on a certain tree termed (Alif-Ra-Alif-Kaf) or camels remained, or continued, among trees of that kind; to persist or preserver; He compelled him or constrained him, to do the thing, or affair; or made him to keep, or cleave, to it; herbage in which the camels remain or continue, couch."
    },

    {
        "indexid":2171,
        "wordid":12295,
        "word":"الثَّوَابُ",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word الثَّوَابُ comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    },

    {
        "indexid":2171,
        "wordid":12296,
        "word":"وَحَسُنَتْ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word وَحَسُنَتْ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    }]}