{"data":[
    {
        "indexid":2182,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":2182,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2182,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2182,
        "wordid":4270,
        "word":"وَهِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word وَهِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":2182,
        "wordid":4271,
        "word":"خَاوِيَةٌ",
        "rootid":558,
        "rootword":"خ و ي",
        "meanings":"Become empty\/vacant\/unoccupied, become devoid or destitute of it's occupants ( a place), fall down or become demolished, become empty of food (hunger in the belly), call or cry out, seize\/take\/carry off by force, make a space between one's upper arms and sides in prostration, lower the eyes or look towards the ground and desiring to be silent, dig a hole or hollow in the ground, abstain from food, lose reason or intellect, take away another person's possession.",
        "sentence":"The word خَاوِيَةٌ comes from the root خ و ي and is associated with the meanings: Become empty\/vacant\/unoccupied, become devoid or destitute of it's occupants ( a place), fall down or become demolished, become empty of food (hunger in the belly), call or cry out, seize\/take\/carry off by force, make a space between one's upper arms and sides in prostration, lower the eyes or look towards the ground and desiring to be silent, dig a hole or hollow in the ground, abstain from food, lose reason or intellect, take away another person's possession."
    },

    {
        "indexid":2182,
        "wordid":4272,
        "word":"عُرُوشِهَا",
        "rootid":228,
        "rootword":"ع ر ش",
        "meanings":"to construct\/build, make trellis (for grape-wine), make a vine-stalk, roof, raise (a house or structure), settle. arsh - throne, arbour, pavillion, roof, power, dominion, sovereignty.",
        "sentence":"The word عُرُوشِهَا comes from the root ع ر ش and is associated with the meanings: to construct\/build, make trellis (for grape-wine), make a vine-stalk, roof, raise (a house or structure), settle. arsh - throne, arbour, pavillion, roof, power, dominion, sovereignty."
    },

    {
        "indexid":2182,
        "wordid":6053,
        "word":"يَالَيْتَنِي",
        "rootid":696,
        "rootword":"ل ي ت",
        "meanings":"To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo.",
        "sentence":"The word يَالَيْتَنِي comes from the root ل ي ت and is associated with the meanings: To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo."
    },

    {
        "indexid":2182,
        "wordid":6685,
        "word":"أَحَدًا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدًا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":2182,
        "wordid":6744,
        "word":"فَأَصْبَحَ",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word فَأَصْبَحَ comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    },

    {
        "indexid":2182,
        "wordid":6879,
        "word":"وَيَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَيَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2182,
        "wordid":10989,
        "word":"كَفَّيْهِ",
        "rootid":1285,
        "rootword":"ك ف ف",
        "meanings":"To withhold, desist, refrain from, withdraw, keep back, hold out the hand.",
        "sentence":"The word كَفَّيْهِ comes from the root ك ف ف and is associated with the meanings: To withhold, desist, refrain from, withdraw, keep back, hold out the hand."
    },

    {
        "indexid":2182,
        "wordid":12328,
        "word":"بِرَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word بِرَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2182,
        "wordid":12345,
        "word":"وَأُحِيطَ",
        "rootid":289,
        "rootword":"ح و ط",
        "meanings":"To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method.",
        "sentence":"The word وَأُحِيطَ comes from the root ح و ط and is associated with the meanings: To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method."
    },

    {
        "indexid":2182,
        "wordid":12346,
        "word":"بِثَمَرِهِ",
        "rootid":1562,
        "rootword":"ث م ر",
        "meanings":"to bear fruit, fructify, get rich, increase. thamar - fruit, wealth, possession, profit, income.",
        "sentence":"The word بِثَمَرِهِ comes from the root ث م ر and is associated with the meanings: to bear fruit, fructify, get rich, increase. thamar - fruit, wealth, possession, profit, income."
    },

    {
        "indexid":2182,
        "wordid":12347,
        "word":"يُقَلِّبُ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word يُقَلِّبُ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":2182,
        "wordid":12348,
        "word":"أَنْفَقَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word أَنْفَقَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":2182,
        "wordid":12349,
        "word":"أُشْرِكْ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أُشْرِكْ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    }]}