{"data":[
    {
        "indexid":2195,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2195,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":2195,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2195,
        "wordid":2444,
        "word":"النَّاسَ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسَ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":2195,
        "wordid":2726,
        "word":"يُؤْمِنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2195,
        "wordid":2827,
        "word":"الْعَذَابُ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابُ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":2195,
        "wordid":3057,
        "word":"مَنَعَ",
        "rootid":752,
        "rootword":"م ن ع",
        "meanings":"To prevent or hinder or hold back, to impede\/withhold\/arrest\/restrain, to keep\/debar\/preclude\/inhibit, to forbid\/prohibit\/interdict, deny or refuse, also to protect or defend or guard a thing, dispute or contest, resist or withstand, to strengthen or fortify, to make a thing inaccessible or unapproachable or difficult of access.",
        "sentence":"The word مَنَعَ comes from the root م ن ع and is associated with the meanings: To prevent or hinder or hold back, to impede\/withhold\/arrest\/restrain, to keep\/debar\/preclude\/inhibit, to forbid\/prohibit\/interdict, deny or refuse, also to protect or defend or guard a thing, dispute or contest, resist or withstand, to strengthen or fortify, to make a thing inaccessible or unapproachable or difficult of access."
    },

    {
        "indexid":2195,
        "wordid":3106,
        "word":"الْهُدَى",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word الْهُدَى comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":2195,
        "wordid":3796,
        "word":"يَأْتِيَهُمُ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يَأْتِيَهُمُ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":2195,
        "wordid":4643,
        "word":"جَاءَهُمُ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَهُمُ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":2195,
        "wordid":5552,
        "word":"رَبَّهُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2195,
        "wordid":7297,
        "word":"الْأَوَّلِينَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word الْأَوَّلِينَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":2195,
        "wordid":7712,
        "word":"قُبُلًا",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قُبُلًا comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":2195,
        "wordid":10899,
        "word":"تَأْتِيَهُمْ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word تَأْتِيَهُمْ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":2195,
        "wordid":11305,
        "word":"سُنَّةُ",
        "rootid":998,
        "rootword":"س ن ن",
        "meanings":"to clean (the teeth), seize with the teeth, establish the law, follow a path, form. sinnun - tooth. sunnatun\/sunanun - line of conduct, mode of life, behaviour, example, dispensation. masnun - formed, made\/moulded into shape, polished, shiny and bright (face).",
        "sentence":"The word سُنَّةُ comes from the root س ن ن and is associated with the meanings: to clean (the teeth), seize with the teeth, establish the law, follow a path, form. sinnun - tooth. sunnatun\/sunanun - line of conduct, mode of life, behaviour, example, dispensation. masnun - formed, made\/moulded into shape, polished, shiny and bright (face)."
    },

    {
        "indexid":2195,
        "wordid":12398,
        "word":"وَيَسْتَغْفِرُوا",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word وَيَسْتَغْفِرُوا comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    }]}