{"data":[
    {
        "indexid":2208,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":2208,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2208,
        "wordid":5050,
        "word":"وَكَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word وَكَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":2208,
        "wordid":12448,
        "word":"تَصْبِرُ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word تَصْبِرُ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":2208,
        "wordid":12449,
        "word":"تُحِطْ",
        "rootid":289,
        "rootword":"ح و ط",
        "meanings":"To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method.",
        "sentence":"The word تُحِطْ comes from the root ح و ط and is associated with the meanings: To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method."
    },

    {
        "indexid":2208,
        "wordid":12450,
        "word":"خُبْرًا",
        "rootid":109,
        "rootword":"خ ب ر",
        "meanings":"To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account.",
        "sentence":"The word خُبْرًا comes from the root خ ب ر and is associated with the meanings: To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account."
    }]}