{"data":[
    {
        "indexid":2225,
        "wordid":12523,
        "word":"سَبَبًا",
        "rootid":458,
        "rootword":"س ب ب",
        "meanings":"to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie.",
        "sentence":"The word سَبَبًا comes from the root س ب ب and is associated with the meanings: to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie."
    },

    {
        "indexid":2225,
        "wordid":12524,
        "word":"فَأَتْبَعَ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word فَأَتْبَعَ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    }]}