{"data":[
    {
        "indexid":2239,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2239,
        "wordid":2737,
        "word":"بَعْضٍ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضٍ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":2239,
        "wordid":4200,
        "word":"بَعْضَهُمْ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضَهُمْ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":2239,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2239,
        "wordid":7508,
        "word":"الصُّورِ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word الصُّورِ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":2239,
        "wordid":10487,
        "word":"وَتَرَكْنَا",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word وَتَرَكْنَا comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":2239,
        "wordid":12572,
        "word":"يَمُوجُ",
        "rootid":1599,
        "rootword":"م و ج",
        "meanings":"To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side.",
        "sentence":"The word يَمُوجُ comes from the root م و ج and is associated with the meanings: To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side."
    },

    {
        "indexid":2239,
        "wordid":12573,
        "word":"وَنُفِخَ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word وَنُفِخَ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":2239,
        "wordid":12574,
        "word":"فَجَمَعْنَاهُمْ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word فَجَمَعْنَاهُمْ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":2239,
        "wordid":12575,
        "word":"جَمْعًا",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word جَمْعًا comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    }]}