{"data":[
    {
        "indexid":2241,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2241,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2241,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2241,
        "wordid":2617,
        "word":"وَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2241,
        "wordid":2887,
        "word":"كَانَتْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَتْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2241,
        "wordid":4405,
        "word":"يَسْتَطِيعُونَ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word يَسْتَطِيعُونَ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":2241,
        "wordid":12578,
        "word":"أَعْيُنُهُمْ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word أَعْيُنُهُمْ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":2241,
        "wordid":12580,
        "word":"ذِكْرِي",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرِي comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2241,
        "wordid":12581,
        "word":"سَمْعًا",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمْعًا comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    }]}