{"data":[
    {
        "indexid":226,
        "wordid":2040,
        "word":"يُنْفِقُونَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word يُنْفِقُونَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":226,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":226,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":226,
        "wordid":2270,
        "word":"مَاذَا",
        "rootid":995,
        "rootword":"م ا ذ ا",
        "meanings":"What",
        "sentence":"The word مَاذَا comes from the root م ا ذ ا and is associated with the meanings: What"
    },

    {
        "indexid":226,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":226,
        "wordid":2787,
        "word":"لِلنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word لِلنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":226,
        "wordid":3626,
        "word":"يُبَيِّنُ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word يُبَيِّنُ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":226,
        "wordid":3635,
        "word":"يَسْءَلُونَكَ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word يَسْءَلُونَكَ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":226,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":226,
        "wordid":3855,
        "word":"كَبِيرٌ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرٌ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":226,
        "wordid":3861,
        "word":"أَكْبَرُ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word أَكْبَرُ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":226,
        "wordid":3878,
        "word":"الْخَمْرِ",
        "rootid":1438,
        "rootword":"خ م ر",
        "meanings":"cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured.",
        "sentence":"The word الْخَمْرِ comes from the root خ م ر and is associated with the meanings: cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured."
    },

    {
        "indexid":226,
        "wordid":3879,
        "word":"وَالْمَيْسِرِ",
        "rootid":706,
        "rootword":"ي س ر",
        "meanings":"become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling.",
        "sentence":"The word وَالْمَيْسِرِ comes from the root ي س ر and is associated with the meanings: become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling."
    },

    {
        "indexid":226,
        "wordid":3880,
        "word":"فِيهِمَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِمَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":226,
        "wordid":3881,
        "word":"إِثْمٌ",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word إِثْمٌ comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    },

    {
        "indexid":226,
        "wordid":3882,
        "word":"وَمَنَافِعُ",
        "rootid":744,
        "rootword":"ن ف ع",
        "meanings":"to profit, do good, be useful, beneficial.",
        "sentence":"The word وَمَنَافِعُ comes from the root ن ف ع and is associated with the meanings: to profit, do good, be useful, beneficial."
    },

    {
        "indexid":226,
        "wordid":3883,
        "word":"وَإِثْمُهُمَا",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word وَإِثْمُهُمَا comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    },

    {
        "indexid":226,
        "wordid":3884,
        "word":"نَفْعِهِمَا",
        "rootid":744,
        "rootword":"ن ف ع",
        "meanings":"to profit, do good, be useful, beneficial.",
        "sentence":"The word نَفْعِهِمَا comes from the root ن ف ع and is associated with the meanings: to profit, do good, be useful, beneficial."
    },

    {
        "indexid":226,
        "wordid":3885,
        "word":"وَيَسْءَلُونَكَ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word وَيَسْءَلُونَكَ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":226,
        "wordid":3886,
        "word":"قُلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":226,
        "wordid":3887,
        "word":"الْعَفْوَ",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word الْعَفْوَ comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    },

    {
        "indexid":226,
        "wordid":3888,
        "word":"تَتَفَكَّرُونَ",
        "rootid":771,
        "rootword":"ف ك ر",
        "meanings":"thought upon it, considered it in order to obtain a clear knowledge of it, examined it (mentally), to employ the mind, having much thought, reflect.",
        "sentence":"The word تَتَفَكَّرُونَ comes from the root ف ك ر and is associated with the meanings: thought upon it, considered it in order to obtain a clear knowledge of it, examined it (mentally), to employ the mind, having much thought, reflect."
    }]}