{"data":[
    {
        "indexid":2266,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2266,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2266,
        "wordid":2811,
        "word":"الْكِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":2266,
        "wordid":2833,
        "word":"مَرْيَمَ",
        "rootid":1302,
        "rootword":"م ر ي م",
        "meanings":"Mariam, Mary",
        "sentence":"The word مَرْيَمَ comes from the root م ر ي م and is associated with the meanings: Mariam, Mary"
    },

    {
        "indexid":2266,
        "wordid":4779,
        "word":"وَاذْكُرْ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word وَاذْكُرْ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2266,
        "wordid":5858,
        "word":"أَهْلِهَا",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلِهَا comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":2266,
        "wordid":6918,
        "word":"مَكَانًا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانًا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2266,
        "wordid":12657,
        "word":"انْتَبَذَتْ",
        "rootid":225,
        "rootword":"ن ب ذ",
        "meanings":"(Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account.",
        "sentence":"The word انْتَبَذَتْ comes from the root ن ب ذ and is associated with the meanings: (Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account."
    },

    {
        "indexid":2266,
        "wordid":12658,
        "word":"شَرْقِيًّا",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word شَرْقِيًّا comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    }]}