{"data":[
    {
        "indexid":2308,
        "wordid":2002,
        "word":"الرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2308,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2308,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":2308,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2308,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2308,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":2308,
        "wordid":2550,
        "word":"سُجَّدًا",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word سُجَّدًا comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":2308,
        "wordid":2613,
        "word":"النَّبِيِّينَ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word النَّبِيِّينَ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":2308,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2308,
        "wordid":5051,
        "word":"تُتْلَى",
        "rootid":920,
        "rootword":"ت ل و",
        "meanings":"To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing.",
        "sentence":"The word تُتْلَى comes from the root ت ل و and is associated with the meanings: To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing."
    },

    {
        "indexid":2308,
        "wordid":6035,
        "word":"أَنْعَمَ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word أَنْعَمَ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":2308,
        "wordid":6492,
        "word":"نُوحٍ",
        "rootid":194,
        "rootword":"ن و ح",
        "meanings":"Noah\/Nuh. To lament, wail, coo.",
        "sentence":"The word نُوحٍ comes from the root ن و ح and is associated with the meanings: Noah\/Nuh. To lament, wail, coo."
    },

    {
        "indexid":2308,
        "wordid":7560,
        "word":"هَدَيْنَا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word هَدَيْنَا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":2308,
        "wordid":7816,
        "word":"ذُرِّيَّةِ",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّةِ comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":2308,
        "wordid":8746,
        "word":"وَمِمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِمَّنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2308,
        "wordid":11781,
        "word":"حَمَلْنَا",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word حَمَلْنَا comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":2308,
        "wordid":12773,
        "word":"وَإِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word وَإِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":2308,
        "wordid":12774,
        "word":"وَاجْتَبَيْنَا",
        "rootid":532,
        "rootword":"ج ب ي",
        "meanings":"He collected (e.g. water\/tax). A mode\/manner of collecting. He chose it\/selected it for himself. He returned\/receded\/retreated\/went back. Collecting in a way of choice\/selection (i.e. God blessing Solomon more than others etc.) He forged\/produced\/invented it. Water collected. A watering trough in which water is collected. The place where a well is dug. What is around a well\/watering trough. Dug wells in which shoots of grape-vines are set. A collector of water for camels. Locust (it collects everything by eating it), A company of men.",
        "sentence":"The word وَاجْتَبَيْنَا comes from the root ج ب ي and is associated with the meanings: He collected (e.g. water\/tax). A mode\/manner of collecting. He chose it\/selected it for himself. He returned\/receded\/retreated\/went back. Collecting in a way of choice\/selection (i.e. God blessing Solomon more than others etc.) He forged\/produced\/invented it. Water collected. A watering trough in which water is collected. The place where a well is dug. What is around a well\/watering trough. Dug wells in which shoots of grape-vines are set. A collector of water for camels. Locust (it collects everything by eating it), A company of men."
    },

    {
        "indexid":2308,
        "wordid":12775,
        "word":"خَرُّوا",
        "rootid":1071,
        "rootword":"خ ر ر",
        "meanings":"To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another.",
        "sentence":"The word خَرُّوا comes from the root خ ر ر and is associated with the meanings: To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another."
    },

    {
        "indexid":2308,
        "wordid":12776,
        "word":"وَبُكِيًّا",
        "rootid":620,
        "rootword":"ب ك ي",
        "meanings":"wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak.",
        "sentence":"The word وَبُكِيًّا comes from the root ب ك ي and is associated with the meanings: wept, lamented\/grieved, shed tears, crying, cause to weep, rain, unable to speak."
    }]}