{"data":[
    {
        "indexid":234,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":234,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":234,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":234,
        "wordid":3548,
        "word":"سَمِيعٌ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِيعٌ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":234,
        "wordid":3947,
        "word":"عَزَمُوا",
        "rootid":980,
        "rootword":"ع ز م",
        "meanings":"to resolve, determine, decide, propose, carry out a resolution, set one's heart upon, fixed determination.. . 'Azama (imp. 3rd. m. sing.): resolved.. 'Azamta (prf. 2nd. m. sing.): thou had resolved.. 'Azamuu (prf. 3rd. m. pl.): they resolved.. Laa Ta'zimuu (prt. neg. m. pl.): do not resolve.. 'Azmun (v. n.): resolution, firm determination, consistency.",
        "sentence":"The word عَزَمُوا comes from the root ع ز م and is associated with the meanings: to resolve, determine, decide, propose, carry out a resolution, set one's heart upon, fixed determination.. . 'Azama (imp. 3rd. m. sing.): resolved.. 'Azamta (prf. 2nd. m. sing.): thou had resolved.. 'Azamuu (prf. 3rd. m. pl.): they resolved.. Laa Ta'zimuu (prt. neg. m. pl.): do not resolve.. 'Azmun (v. n.): resolution, firm determination, consistency."
    },

    {
        "indexid":234,
        "wordid":3948,
        "word":"الطَّلَاقَ",
        "rootid":935,
        "rootword":"ط ل ق",
        "meanings":"to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose.",
        "sentence":"The word الطَّلَاقَ comes from the root ط ل ق and is associated with the meanings: to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose."
    }]}