{"data":[
    {
        "indexid":2368,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":2368,
        "wordid":12900,
        "word":"تَسْعَى",
        "rootid":1050,
        "rootword":"س ع ي",
        "meanings":"he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child).",
        "sentence":"The word تَسْعَى comes from the root س ع ي and is associated with the meanings: he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child)."
    },

    {
        "indexid":2368,
        "wordid":12911,
        "word":"فَأَلْقَاهَا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَأَلْقَاهَا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2368,
        "wordid":12912,
        "word":"حَيَّةٌ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word حَيَّةٌ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    }]}