{"data":[
    {
        "indexid":237,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":237,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":237,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":237,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":237,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":237,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":237,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":237,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":237,
        "wordid":3369,
        "word":"جُنَاحَ",
        "rootid":1378,
        "rootword":"ج ن ح",
        "meanings":"to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame.",
        "sentence":"The word جُنَاحَ comes from the root ج ن ح and is associated with the meanings: to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame."
    },

    {
        "indexid":237,
        "wordid":3624,
        "word":"حُدُودُ",
        "rootid":862,
        "rootword":"ح د د",
        "meanings":"To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen.",
        "sentence":"The word حُدُودُ comes from the root ح د د and is associated with the meanings: To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen."
    },

    {
        "indexid":237,
        "wordid":3977,
        "word":"يُقِيمَا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word يُقِيمَا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":237,
        "wordid":3978,
        "word":"حُدُودَ",
        "rootid":862,
        "rootword":"ح د د",
        "meanings":"To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen.",
        "sentence":"The word حُدُودَ comes from the root ح د د and is associated with the meanings: To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen."
    },

    {
        "indexid":237,
        "wordid":3985,
        "word":"طَلَّقَهَا",
        "rootid":935,
        "rootword":"ط ل ق",
        "meanings":"to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose.",
        "sentence":"The word طَلَّقَهَا comes from the root ط ل ق and is associated with the meanings: to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose."
    },

    {
        "indexid":237,
        "wordid":3986,
        "word":"تَحِلُّ",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word تَحِلُّ comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":237,
        "wordid":3987,
        "word":"بَعْدُ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدُ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":237,
        "wordid":3988,
        "word":"تَنْكِحَ",
        "rootid":379,
        "rootword":"ن ك ح",
        "meanings":"to tie, make a knot, contract, to marry, marriage.",
        "sentence":"The word تَنْكِحَ comes from the root ن ك ح and is associated with the meanings: to tie, make a knot, contract, to marry, marriage."
    },

    {
        "indexid":237,
        "wordid":3989,
        "word":"زَوْجًا",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word زَوْجًا comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":237,
        "wordid":3990,
        "word":"غَيْرَهُ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَهُ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":237,
        "wordid":3991,
        "word":"يَتَرَاجَعَا",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word يَتَرَاجَعَا comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":237,
        "wordid":3992,
        "word":"ظَنَّا",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word ظَنَّا comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":237,
        "wordid":3994,
        "word":"يُبَيِّنُهَا",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word يُبَيِّنُهَا comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    }]}