{"data":[
    {
        "indexid":2381,
        "wordid":2274,
        "word":"كَثِيرًا",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرًا comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":2381,
        "wordid":12936,
        "word":"كَيْ",
        "rootid":1783,
        "rootword":"ك ي",
        "meanings":"",
        "sentence":"The word كَيْ comes from the root ك ي and is associated with the meanings: "
    },

    {
        "indexid":2381,
        "wordid":12937,
        "word":"نُسَبِّحَكَ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word نُسَبِّحَكَ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    }]}