{"data":[
    {
        "indexid":2416,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2416,
        "wordid":2338,
        "word":"أَنْتَ",
        "rootid":1639,
        "rootword":"ا ن ت",
        "meanings":"you (singular)",
        "sentence":"The word أَنْتَ comes from the root ا ن ت and is associated with the meanings: you (singular)"
    },

    {
        "indexid":2416,
        "wordid":2353,
        "word":"قُلْنَا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْنَا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2416,
        "wordid":10246,
        "word":"تَخَفْ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word تَخَفْ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":2416,
        "wordid":11581,
        "word":"الْأَعْلَى",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word الْأَعْلَى comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    }]}