{"data":[
    {
        "indexid":2425,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2425,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2425,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2425,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2425,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2425,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2425,
        "wordid":3404,
        "word":"الْبَحْرِ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word الْبَحْرِ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":2425,
        "wordid":6514,
        "word":"طَرِيقًا",
        "rootid":539,
        "rootword":"ط ر ق",
        "meanings":"to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour.",
        "sentence":"The word طَرِيقًا comes from the root ط ر ق and is associated with the meanings: to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour."
    },

    {
        "indexid":2425,
        "wordid":13063,
        "word":"بِعِبَادِي",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word بِعِبَادِي comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":2425,
        "wordid":13064,
        "word":"فَاضْرِبْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word فَاضْرِبْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":2425,
        "wordid":13065,
        "word":"يَبَسًا",
        "rootid":775,
        "rootword":"ي ب س",
        "meanings":"withered, dry.",
        "sentence":"The word يَبَسًا comes from the root ي ب س and is associated with the meanings: withered, dry."
    },

    {
        "indexid":2425,
        "wordid":13066,
        "word":"تَخَافُ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word تَخَافُ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":2425,
        "wordid":13067,
        "word":"دَرَكًا",
        "rootid":183,
        "rootword":"د ر ك",
        "meanings":"To overtake, follow up, drop closely.",
        "sentence":"The word دَرَكًا comes from the root د ر ك and is associated with the meanings: To overtake, follow up, drop closely."
    },

    {
        "indexid":2425,
        "wordid":13068,
        "word":"تَخْشَى",
        "rootid":649,
        "rootword":"خ ش ي",
        "meanings":"To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary.",
        "sentence":"The word تَخْشَى comes from the root خ ش ي and is associated with the meanings: To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary."
    }]}