{"data":[
    {
        "indexid":2450,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2450,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2450,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2450,
        "wordid":7421,
        "word":"الْمُجْرِمِينَ",
        "rootid":387,
        "rootword":"ج ر م",
        "meanings":"",
        "sentence":"The word الْمُجْرِمِينَ comes from the root ج ر م and is associated with the meanings: "
    },

    {
        "indexid":2450,
        "wordid":7507,
        "word":"يُنْفَخُ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word يُنْفَخُ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":2450,
        "wordid":7508,
        "word":"الصُّورِ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word الصُّورِ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":2450,
        "wordid":13144,
        "word":"وَنَحْشُرُ",
        "rootid":761,
        "rootword":"ح ش ر",
        "meanings":"To gather together, raise from the dead, banish.",
        "sentence":"The word وَنَحْشُرُ comes from the root ح ش ر and is associated with the meanings: To gather together, raise from the dead, banish."
    },

    {
        "indexid":2450,
        "wordid":13145,
        "word":"زُرْقًا",
        "rootid":1223,
        "rootword":"ز ر ق",
        "meanings":"blue-eyed, grey-eyed, greenish hue in the eye, blindness (due to the pupil being grey due to ctaract), become very clear\/bright, to show the whites of the eye, piercing (e.g. with a spear), look sharply\/intently, intense colour of the eye.",
        "sentence":"The word زُرْقًا comes from the root ز ر ق and is associated with the meanings: blue-eyed, grey-eyed, greenish hue in the eye, blindness (due to the pupil being grey due to ctaract), become very clear\/bright, to show the whites of the eye, piercing (e.g. with a spear), look sharply\/intently, intense colour of the eye."
    }]}