{"data":[
    {
        "indexid":2468,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2468,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2468,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2468,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":2468,
        "wordid":8045,
        "word":"فَوَسْوَسَ",
        "rootid":658,
        "rootword":"و س و س",
        "meanings":"to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer.",
        "sentence":"The word فَوَسْوَسَ comes from the root و س و س and is associated with the meanings: to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer."
    },

    {
        "indexid":2468,
        "wordid":9851,
        "word":"الْخُلْدِ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word الْخُلْدِ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":2468,
        "wordid":13188,
        "word":"أَدُلُّكَ",
        "rootid":715,
        "rootword":"د ل ل",
        "meanings":"To show, point out, indicate, direct, point at, guide, delude, discover, lead.",
        "sentence":"The word أَدُلُّكَ comes from the root د ل ل and is associated with the meanings: To show, point out, indicate, direct, point at, guide, delude, discover, lead."
    },

    {
        "indexid":2468,
        "wordid":13189,
        "word":"شَجَرَةِ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word شَجَرَةِ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":2468,
        "wordid":13190,
        "word":"وَمُلْكٍ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word وَمُلْكٍ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":2468,
        "wordid":13191,
        "word":"يَبْلَى",
        "rootid":350,
        "rootword":"ب ل ي",
        "meanings":"decay, wear out.",
        "sentence":"The word يَبْلَى comes from the root ب ل ي and is associated with the meanings: decay, wear out."
    }]}