{"data":[
    {
        "indexid":247,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":247,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":247,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":247,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":247,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":247,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":247,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":247,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":247,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":247,
        "wordid":3369,
        "word":"جُنَاحَ",
        "rootid":1378,
        "rootword":"ج ن ح",
        "meanings":"to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame.",
        "sentence":"The word جُنَاحَ comes from the root ج ن ح and is associated with the meanings: to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame."
    },

    {
        "indexid":247,
        "wordid":3792,
        "word":"عَزِيزٌ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word عَزِيزٌ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":247,
        "wordid":3793,
        "word":"حَكِيمٌ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حَكِيمٌ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":247,
        "wordid":4045,
        "word":"يُتَوَفَّوْنَ",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word يُتَوَفَّوْنَ comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":247,
        "wordid":4046,
        "word":"وَيَذَرُونَ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word وَيَذَرُونَ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":247,
        "wordid":4047,
        "word":"أَزْوَاجًا",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word أَزْوَاجًا comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":247,
        "wordid":4051,
        "word":"فَعَلْنَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَعَلْنَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":247,
        "wordid":4052,
        "word":"أَنْفُسِهِنَّ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسِهِنَّ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":247,
        "wordid":4075,
        "word":"مَتَاعًا",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word مَتَاعًا comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":247,
        "wordid":4097,
        "word":"وَصِيَّةً",
        "rootid":1754,
        "rootword":"و ص ي",
        "meanings":"to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will.",
        "sentence":"The word وَصِيَّةً comes from the root و ص ي and is associated with the meanings: to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will."
    },

    {
        "indexid":247,
        "wordid":4098,
        "word":"لِأَزْوَاجِهِمْ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word لِأَزْوَاجِهِمْ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":247,
        "wordid":4099,
        "word":"الْحَوْلِ",
        "rootid":46,
        "rootword":"ح و ل",
        "meanings":"(Ha-Alif-Lam) To be changed, come in between, pass by.",
        "sentence":"The word الْحَوْلِ comes from the root ح و ل and is associated with the meanings: (Ha-Alif-Lam) To be changed, come in between, pass by."
    },

    {
        "indexid":247,
        "wordid":4100,
        "word":"إِخْرَاجٍ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word إِخْرَاجٍ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":247,
        "wordid":4101,
        "word":"خَرَجْنَ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word خَرَجْنَ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":247,
        "wordid":4102,
        "word":"مَعْرُوفٍ",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word مَعْرُوفٍ comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    }]}