{"data":[
    {
        "indexid":2501,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":2501,
        "wordid":2692,
        "word":"بِالْحَقِّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word بِالْحَقِّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":2501,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":2501,
        "wordid":10499,
        "word":"تَصِفُونَ",
        "rootid":245,
        "rootword":"و ص ف",
        "meanings":"to describe (good or bad), assert something as a fact, achieve, ascribe, specify.",
        "sentence":"The word تَصِفُونَ comes from the root و ص ف and is associated with the meanings: to describe (good or bad), assert something as a fact, achieve, ascribe, specify."
    },

    {
        "indexid":2501,
        "wordid":13263,
        "word":"نَقْذِفُ",
        "rootid":1273,
        "rootword":"ق ذ ف",
        "meanings":"to pelt, cast, inspire, hurt, do away, throw, plunge, charge anyone with (foul and evil actions), shoot, dart.",
        "sentence":"The word نَقْذِفُ comes from the root ق ذ ف and is associated with the meanings: to pelt, cast, inspire, hurt, do away, throw, plunge, charge anyone with (foul and evil actions), shoot, dart."
    },

    {
        "indexid":2501,
        "wordid":13264,
        "word":"الْبَاطِلِ",
        "rootid":751,
        "rootword":"ب ط ل",
        "meanings":"Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies.",
        "sentence":"The word الْبَاطِلِ comes from the root ب ط ل and is associated with the meanings: Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies."
    },

    {
        "indexid":2501,
        "wordid":13265,
        "word":"فَيَدْمَغُهُ",
        "rootid":1533,
        "rootword":"د م غ",
        "meanings":"To destroy, damage the brain, overcome, prevail upon (error), disgrace, knock out.",
        "sentence":"The word فَيَدْمَغُهُ comes from the root د م غ and is associated with the meanings: To destroy, damage the brain, overcome, prevail upon (error), disgrace, knock out."
    },

    {
        "indexid":2501,
        "wordid":13266,
        "word":"زَاهِقٌ",
        "rootid":259,
        "rootword":"ز ه ق",
        "meanings":"went\/passed forth, departed, perished, dying, came to naught, went swiftly.",
        "sentence":"The word زَاهِقٌ comes from the root ز ه ق and is associated with the meanings: went\/passed forth, departed, perished, dying, came to naught, went swiftly."
    },

    {
        "indexid":2501,
        "wordid":13268,
        "word":"الْوَيْلُ",
        "rootid":232,
        "rootword":"و ي ل",
        "meanings":"word of interjection, dispraise or threat, woe!",
        "sentence":"The word الْوَيْلُ comes from the root و ي ل and is associated with the meanings: word of interjection, dispraise or threat, woe!"
    }]}