{"data":[
    {
        "indexid":253,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":253,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":253,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":253,
        "wordid":4127,
        "word":"مَلِكًا",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلِكًا comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":253,
        "wordid":3514,
        "word":"كُتِبَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كُتِبَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":253,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":253,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":253,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":253,
        "wordid":2345,
        "word":"أَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":253,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":253,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":253,
        "wordid":2896,
        "word":"بِالظَّالِمِينَ",
        "rootid":434,
        "rootword":"ظ ل م",
        "meanings":"Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]",
        "sentence":"The word بِالظَّالِمِينَ comes from the root ظ ل م and is associated with the meanings: Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]"
    },

    {
        "indexid":253,
        "wordid":4132,
        "word":"أُخْرِجْنَا",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word أُخْرِجْنَا comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":253,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":253,
        "wordid":4125,
        "word":"لِنَبِيٍّ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word لِنَبِيٍّ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":253,
        "wordid":2779,
        "word":"بَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":4134,
        "word":"وَأَبْنَائِنَا",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word وَأَبْنَائِنَا comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":2410,
        "word":"إِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word إِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":253,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":253,
        "wordid":3846,
        "word":"الْقِتَالُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word الْقِتَالُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":253,
        "wordid":4128,
        "word":"نُقَاتِلْ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word نُقَاتِلْ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":253,
        "wordid":4130,
        "word":"تُقَاتِلُوا",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word تُقَاتِلُوا comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":253,
        "wordid":4131,
        "word":"نُقَاتِلَ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word نُقَاتِلَ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":253,
        "wordid":4105,
        "word":"تَرَ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word تَرَ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":253,
        "wordid":4126,
        "word":"ابْعَثْ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word ابْعَثْ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":253,
        "wordid":2727,
        "word":"وَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":253,
        "wordid":3235,
        "word":"تَوَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word تَوَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":253,
        "wordid":4133,
        "word":"دِيَارِنَا",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word دِيَارِنَا comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":253,
        "wordid":3345,
        "word":"سَبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":253,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":253,
        "wordid":4124,
        "word":"الْمَلَإِ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word الْمَلَإِ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    }]}