{"data":[
    {
        "indexid":254,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":254,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":254,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":254,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":254,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":254,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":254,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":254,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":254,
        "wordid":2317,
        "word":"وَنَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word وَنَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":254,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":254,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":254,
        "wordid":2868,
        "word":"يَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":254,
        "wordid":3072,
        "word":"وَاسِعٌ",
        "rootid":1606,
        "rootword":"و س ع",
        "meanings":"to be ample, take in, comprehend, embrace.",
        "sentence":"The word وَاسِعٌ comes from the root و س ع and is associated with the meanings: to be ample, take in, comprehend, embrace."
    },

    {
        "indexid":254,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":254,
        "wordid":3112,
        "word":"الْعِلْمِ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعِلْمِ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":254,
        "wordid":3959,
        "word":"أَحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word أَحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":254,
        "wordid":4127,
        "word":"مَلِكًا",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلِكًا comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":254,
        "wordid":4135,
        "word":"نَبِيُّهُمْ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word نَبِيُّهُمْ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":254,
        "wordid":4136,
        "word":"بَعَثَ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word بَعَثَ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":254,
        "wordid":4138,
        "word":"يَكُونُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":254,
        "wordid":4139,
        "word":"الْمُلْكُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمُلْكُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":254,
        "wordid":4140,
        "word":"بِالْمُلْكِ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word بِالْمُلْكِ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":254,
        "wordid":4141,
        "word":"وَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word وَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":254,
        "wordid":4142,
        "word":"يُؤْتَ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يُؤْتَ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":254,
        "wordid":4143,
        "word":"سَعَةً",
        "rootid":1606,
        "rootword":"و س ع",
        "meanings":"to be ample, take in, comprehend, embrace.",
        "sentence":"The word سَعَةً comes from the root و س ع and is associated with the meanings: to be ample, take in, comprehend, embrace."
    },

    {
        "indexid":254,
        "wordid":4144,
        "word":"الْمَالِ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word الْمَالِ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":254,
        "wordid":4145,
        "word":"اصْطَفَاهُ",
        "rootid":206,
        "rootword":"ص ف و",
        "meanings":"it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh.",
        "sentence":"The word اصْطَفَاهُ comes from the root ص ف و and is associated with the meanings: it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh."
    },

    {
        "indexid":254,
        "wordid":4146,
        "word":"وَزَادَهُ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word وَزَادَهُ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":254,
        "wordid":4147,
        "word":"بَسْطَةً",
        "rootid":368,
        "rootword":"ب س ط",
        "meanings":"Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)",
        "sentence":"The word بَسْطَةً comes from the root ب س ط and is associated with the meanings: Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)"
    },

    {
        "indexid":254,
        "wordid":4148,
        "word":"وَالْجِسْمِ",
        "rootid":1454,
        "rootword":"ج س م",
        "meanings":"To be great or large, big\/bulky\/large in body, corpulent or corporeal, big-bodied.",
        "sentence":"The word وَالْجِسْمِ comes from the root ج س م and is associated with the meanings: To be great or large, big\/bulky\/large in body, corpulent or corporeal, big-bodied."
    },

    {
        "indexid":254,
        "wordid":4149,
        "word":"يُؤْتِي",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يُؤْتِي comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":254,
        "wordid":4150,
        "word":"مُلْكَهُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مُلْكَهُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    }]}