{"data":[
    {
        "indexid":2608,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2608,
        "wordid":2976,
        "word":"وَلَبِئْسَ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word وَلَبِئْسَ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":2608,
        "wordid":3909,
        "word":"يَدْعُوا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word يَدْعُوا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":2608,
        "wordid":4085,
        "word":"أَقْرَبُ",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word أَقْرَبُ comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":2608,
        "wordid":5555,
        "word":"لَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word لَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2608,
        "wordid":6925,
        "word":"لَبِئْسَ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word لَبِئْسَ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":2608,
        "wordid":8968,
        "word":"الْمَوْلَى",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word الْمَوْلَى comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":2608,
        "wordid":13514,
        "word":"ضَرُّهُ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word ضَرُّهُ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":2608,
        "wordid":13515,
        "word":"نَفْعِهِ",
        "rootid":744,
        "rootword":"ن ف ع",
        "meanings":"to profit, do good, be useful, beneficial.",
        "sentence":"The word نَفْعِهِ comes from the root ن ف ع and is associated with the meanings: to profit, do good, be useful, beneficial."
    },

    {
        "indexid":2608,
        "wordid":13516,
        "word":"الْعَشِيرُ",
        "rootid":1676,
        "rootword":"ع ش ر",
        "meanings":"to take away a tenth part, make ten by adding one to nine, be the tenth. ashrun\/asharun (f.), asharatun\/ashratun (m.): ten, decade, period from three to ten. After twenty there is no difference between feminine and masculine. ashara - to consort, live with, cultivate one's society, become familiar. ashirun - companion, ashiratun - kindred, ma'sharun - company, race, multitude, who live in close communion with (pl. ashair).",
        "sentence":"The word الْعَشِيرُ comes from the root ع ش ر and is associated with the meanings: to take away a tenth part, make ten by adding one to nine, be the tenth. ashrun\/asharun (f.), asharatun\/ashratun (m.): ten, decade, period from three to ten. After twenty there is no difference between feminine and masculine. ashara - to consort, live with, cultivate one's society, become familiar. ashirun - companion, ashiratun - kindred, ma'sharun - company, race, multitude, who live in close communion with (pl. ashair)."
    }]}