{"data":[
    {
        "indexid":2610,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2610,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2610,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2610,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2610,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2610,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":2610,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2610,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":2610,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2610,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":2610,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":2610,
        "wordid":3873,
        "word":"وَالْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word وَالْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":2610,
        "wordid":9647,
        "word":"يَغِيظُ",
        "rootid":23,
        "rootword":"غ ي ظ",
        "meanings":"anger, wrath, rage, vehemence, distress; cooking-pot",
        "sentence":"The word يَغِيظُ comes from the root غ ي ظ and is associated with the meanings: anger, wrath, rage, vehemence, distress; cooking-pot"
    },

    {
        "indexid":2610,
        "wordid":12221,
        "word":"فَلْيَنْظُرْ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَلْيَنْظُرْ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":2610,
        "wordid":12812,
        "word":"فَلْيَمْدُدْ",
        "rootid":234,
        "rootword":"م د د",
        "meanings":"to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung).",
        "sentence":"The word فَلْيَمْدُدْ comes from the root م د د and is associated with the meanings: to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung)."
    },

    {
        "indexid":2610,
        "wordid":13518,
        "word":"يَظُنُّ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word يَظُنُّ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":2610,
        "wordid":13519,
        "word":"يَنْصُرَهُ",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word يَنْصُرَهُ comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":2610,
        "wordid":13520,
        "word":"بِسَبَبٍ",
        "rootid":458,
        "rootword":"س ب ب",
        "meanings":"to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie.",
        "sentence":"The word بِسَبَبٍ comes from the root س ب ب and is associated with the meanings: to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie."
    },

    {
        "indexid":2610,
        "wordid":13521,
        "word":"لْيَقْطَعْ",
        "rootid":395,
        "rootword":"ق ط ع",
        "meanings":"to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion.",
        "sentence":"The word لْيَقْطَعْ comes from the root ق ط ع and is associated with the meanings: to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion."
    },

    {
        "indexid":2610,
        "wordid":13522,
        "word":"يُذْهِبَنَّ",
        "rootid":1657,
        "rootword":"ذ ه ب",
        "meanings":"to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold.",
        "sentence":"The word يُذْهِبَنَّ comes from the root ذ ه ب and is associated with the meanings: to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold."
    },

    {
        "indexid":2610,
        "wordid":13523,
        "word":"كَيْدُهُ",
        "rootid":1295,
        "rootword":"ك ي د",
        "meanings":"(Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish.",
        "sentence":"The word كَيْدُهُ comes from the root ك ي د and is associated with the meanings: (Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish."
    }]}