{"data":[
    {
        "indexid":2619,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2619,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2619,
        "wordid":5448,
        "word":"الطَّيِّبِ",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word الطَّيِّبِ comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":2619,
        "wordid":6290,
        "word":"الْقَوْلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word الْقَوْلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2619,
        "wordid":11103,
        "word":"صِرَاطِ",
        "rootid":451,
        "rootword":"ص ر ط",
        "meanings":"a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword.",
        "sentence":"The word صِرَاطِ comes from the root ص ر ط and is associated with the meanings: a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword."
    },

    {
        "indexid":2619,
        "wordid":11104,
        "word":"الْحَمِيدِ",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word الْحَمِيدِ comes from the root ح م د and is associated with the meanings: To praise."
    },

    {
        "indexid":2619,
        "wordid":13548,
        "word":"وَهُدُوا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word وَهُدُوا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    }]}