{"data":[
    {
        "indexid":2633,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2633,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2633,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2633,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2633,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":2633,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2633,
        "wordid":13612,
        "word":"يُدَافِعُ",
        "rootid":1675,
        "rootword":"د ف ع",
        "meanings":"To push, pay over to, repel, drive away, avert, defend, discard, refute, quiet, plead, deliver up, dash (torrent), struggle, hinder.",
        "sentence":"The word يُدَافِعُ comes from the root د ف ع and is associated with the meanings: To push, pay over to, repel, drive away, avert, defend, discard, refute, quiet, plead, deliver up, dash (torrent), struggle, hinder."
    },

    {
        "indexid":2633,
        "wordid":13613,
        "word":"خَوَّانٍ",
        "rootid":1366,
        "rootword":"خ و ن",
        "meanings":"To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion.",
        "sentence":"The word خَوَّانٍ comes from the root خ و ن and is associated with the meanings: To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion."
    },

    {
        "indexid":2633,
        "wordid":13614,
        "word":"كَفُورٍ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفُورٍ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}