{"data":[
    {
        "indexid":2663,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2663,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2663,
        "wordid":2322,
        "word":"أَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word أَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2663,
        "wordid":2724,
        "word":"تَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word تَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":2663,
        "wordid":13686,
        "word":"جَادَلُوكَ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word جَادَلُوكَ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":2663,
        "wordid":13687,
        "word":"فَقُلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقُلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    }]}