{"data":[
    {
        "indexid":267,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":267,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":267,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":267,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":267,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":267,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":267,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":267,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":267,
        "wordid":2704,
        "word":"الْمَوْتَى",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتَى comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":267,
        "wordid":2771,
        "word":"بَلَى",
        "rootid":350,
        "rootword":"ب ل ي",
        "meanings":"decay, wear out.",
        "sentence":"The word بَلَى comes from the root ب ل ي and is associated with the meanings: decay, wear out."
    },

    {
        "indexid":267,
        "wordid":3146,
        "word":"اجْعَلْ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word اجْعَلْ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":267,
        "wordid":3792,
        "word":"عَزِيزٌ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word عَزِيزٌ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":267,
        "wordid":3793,
        "word":"حَكِيمٌ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حَكِيمٌ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":267,
        "wordid":4293,
        "word":"أَرِنِي",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word أَرِنِي comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":267,
        "wordid":4294,
        "word":"تُحْيِي",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word تُحْيِي comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":267,
        "wordid":4295,
        "word":"أَوَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَوَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":267,
        "wordid":4296,
        "word":"تُؤْمِنْ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word تُؤْمِنْ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":267,
        "wordid":4298,
        "word":"قَلْبِي",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قَلْبِي comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":267,
        "wordid":4299,
        "word":"فَخُذْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word فَخُذْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":267,
        "wordid":4300,
        "word":"أَرْبَعَةً",
        "rootid":1796,
        "rootword":"ر ب ع",
        "meanings":"four, fourth, quarter, forty",
        "sentence":"The word أَرْبَعَةً comes from the root ر ب ع and is associated with the meanings: four, fourth, quarter, forty"
    },

    {
        "indexid":267,
        "wordid":4301,
        "word":"الطَّيْرِ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word الطَّيْرِ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":267,
        "wordid":4302,
        "word":"فَصُرْهُنَّ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word فَصُرْهُنَّ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":267,
        "wordid":4303,
        "word":"جَبَلٍ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word جَبَلٍ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":267,
        "wordid":4304,
        "word":"مِنْهُنَّ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُنَّ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":267,
        "wordid":4305,
        "word":"جُزْءًا",
        "rootid":1078,
        "rootword":"ج ز ا",
        "meanings":"",
        "sentence":"The word جُزْءًا comes from the root ج ز ا and is associated with the meanings: "
    },

    {
        "indexid":267,
        "wordid":4306,
        "word":"ادْعُهُنَّ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word ادْعُهُنَّ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":267,
        "wordid":4307,
        "word":"يَأْتِينَكَ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يَأْتِينَكَ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":267,
        "wordid":4308,
        "word":"سَعْيًا",
        "rootid":1050,
        "rootword":"س ع ي",
        "meanings":"he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child).",
        "sentence":"The word سَعْيًا comes from the root س ع ي and is associated with the meanings: he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child)."
    },

    {
        "indexid":267,
        "wordid":4309,
        "word":"وَاعْلَمْ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَاعْلَمْ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}