{"data":[
    {
        "indexid":2676,
        "wordid":2789,
        "word":"مُعْرِضُونَ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word مُعْرِضُونَ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":2676,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2676,
        "wordid":13714,
        "word":"اللَّغْوِ",
        "rootid":511,
        "rootword":"ل غ و",
        "meanings":"To talk nonsense speech, to make mistake consciously or unconsciously, use vain words, idle talk, make noise and raise a hue and cry (to interrupt), talk frivolously (to drown the hearing of another), a slip in talk, unintentional talk, babble. laghiya vb.",
        "sentence":"The word اللَّغْوِ comes from the root ل غ و and is associated with the meanings: To talk nonsense speech, to make mistake consciously or unconsciously, use vain words, idle talk, make noise and raise a hue and cry (to interrupt), talk frivolously (to drown the hearing of another), a slip in talk, unintentional talk, babble. laghiya vb."
    }]}