{"data":[
    {
        "indexid":2697,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2697,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":2697,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2697,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2697,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2697,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":2697,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2697,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2697,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2697,
        "wordid":2882,
        "word":"سَمِعْنَا",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِعْنَا comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":2697,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2697,
        "wordid":4810,
        "word":"بَشَرٌ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word بَشَرٌ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":2697,
        "wordid":7297,
        "word":"الْأَوَّلِينَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word الْأَوَّلِينَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":2697,
        "wordid":7555,
        "word":"قَوْمِهِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمِهِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":2697,
        "wordid":8227,
        "word":"الْمَلَأُ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word الْمَلَأُ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":2697,
        "wordid":11131,
        "word":"مِثْلُكُمْ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مِثْلُكُمْ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":2697,
        "wordid":13759,
        "word":"يَتَفَضَّلَ",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word يَتَفَضَّلَ comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":2697,
        "wordid":13760,
        "word":"لَأَنْزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word لَأَنْزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2697,
        "wordid":13761,
        "word":"مَلَائِكَةً",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَائِكَةً comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":2697,
        "wordid":13762,
        "word":"ءَابَائِنَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَائِنَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    }]}