{"data":[
    {
        "indexid":2765,
        "wordid":4792,
        "word":"الْغَيْبِ",
        "rootid":623,
        "rootword":"غ ي ب",
        "meanings":"absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible.",
        "sentence":"The word الْغَيْبِ comes from the root غ ي ب and is associated with the meanings: absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible."
    },

    {
        "indexid":2765,
        "wordid":7510,
        "word":"وَالشَّهَادَةِ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word وَالشَّهَادَةِ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":2765,
        "wordid":8789,
        "word":"فَتَعَالَى",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word فَتَعَالَى comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":2765,
        "wordid":8790,
        "word":"يُشْرِكُونَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word يُشْرِكُونَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":2765,
        "wordid":9519,
        "word":"عَالِمِ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَالِمِ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}