{"data":[
    {
        "indexid":2770,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2770,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2770,
        "wordid":2661,
        "word":"أَعُوذُ",
        "rootid":1751,
        "rootword":"ع و ذ",
        "meanings":"to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge.",
        "sentence":"The word أَعُوذُ comes from the root ع و ذ and is associated with the meanings: to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge."
    },

    {
        "indexid":2770,
        "wordid":4650,
        "word":"وَقُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2770,
        "wordid":13859,
        "word":"هَمَزَاتِ",
        "rootid":204,
        "rootword":"ه م ز",
        "meanings":"to backbite, defame, push back with a blow, pinch, repel, find fault with, suggest evil, break, throw (on the ground), squeeze, bite.",
        "sentence":"The word هَمَزَاتِ comes from the root ه م ز and is associated with the meanings: to backbite, defame, push back with a blow, pinch, repel, find fault with, suggest evil, break, throw (on the ground), squeeze, bite."
    }]}