{"data":[
    {
        "indexid":2792,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2792,
        "wordid":2536,
        "word":"وَأَنْزَلْنَا",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word وَأَنْزَلْنَا comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2792,
        "wordid":2927,
        "word":"بَيِّنَاتٍ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيِّنَاتٍ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":2792,
        "wordid":7940,
        "word":"تَذَكَّرُونَ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word تَذَكَّرُونَ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2792,
        "wordid":9386,
        "word":"سُورَةٌ",
        "rootid":1014,
        "rootword":"س و ر",
        "meanings":"leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure.",
        "sentence":"The word سُورَةٌ comes from the root س و ر and is associated with the meanings: leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure."
    },

    {
        "indexid":2792,
        "wordid":13889,
        "word":"أَنْزَلْنَاهَا",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أَنْزَلْنَاهَا comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2792,
        "wordid":13890,
        "word":"وَفَرَضْنَاهَا",
        "rootid":880,
        "rootword":"ف ر ض",
        "meanings":"to impose law, prescribe, ordain, enact, settle, fix, ratify, appoint, command an observation or obedience to, sanction, assign, be aged. faridzun - old cow. faridzatun - ordinance, settlement, settled portion, jointure stipulation. mafrudz - appointed, determinate, settled one, allotted.",
        "sentence":"The word وَفَرَضْنَاهَا comes from the root ف ر ض and is associated with the meanings: to impose law, prescribe, ordain, enact, settle, fix, ratify, appoint, command an observation or obedience to, sanction, assign, be aged. faridzun - old cow. faridzatun - ordinance, settlement, settled portion, jointure stipulation. mafrudz - appointed, determinate, settled one, allotted."
    }]}