{"data":[
    {
        "indexid":283,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":283,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":283,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":283,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":283,
        "wordid":4389,
        "word":"الصَّدَقَاتِ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word الصَّدَقَاتِ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":283,
        "wordid":4417,
        "word":"الرِّبَوا",
        "rootid":413,
        "rootword":"ر ب و",
        "meanings":"it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased.",
        "sentence":"The word الرِّبَوا comes from the root ر ب و and is associated with the meanings: it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased."
    },

    {
        "indexid":283,
        "wordid":4432,
        "word":"يَمْحَقُ",
        "rootid":1286,
        "rootword":"م ح ق",
        "meanings":"To render a thing deficient and deprive it of its blessing or increase, annihilate\/annull\/obliterate a thing, do away with a thing wholly so that no trace of it remains.",
        "sentence":"The word يَمْحَقُ comes from the root م ح ق and is associated with the meanings: To render a thing deficient and deprive it of its blessing or increase, annihilate\/annull\/obliterate a thing, do away with a thing wholly so that no trace of it remains."
    },

    {
        "indexid":283,
        "wordid":4433,
        "word":"وَيُرْبِي",
        "rootid":413,
        "rootword":"ر ب و",
        "meanings":"it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased.",
        "sentence":"The word وَيُرْبِي comes from the root ر ب و and is associated with the meanings: it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased."
    },

    {
        "indexid":283,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":283,
        "wordid":4435,
        "word":"كَفَّارٍ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَّارٍ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":283,
        "wordid":4436,
        "word":"أَثِيمٍ",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word أَثِيمٍ comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    }]}