{"data":[
    {
        "indexid":2836,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2836,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2836,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2836,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2836,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2836,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2836,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2836,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2836,
        "wordid":2187,
        "word":"قَدِيرٌ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word قَدِيرٌ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":2836,
        "wordid":2297,
        "word":"خَلَقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2836,
        "wordid":2745,
        "word":"وَمِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2836,
        "wordid":2868,
        "word":"يَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2836,
        "wordid":3406,
        "word":"مَاءٍ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءٍ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":2836,
        "wordid":3410,
        "word":"دَابَّةٍ",
        "rootid":1326,
        "rootword":"د ب ب",
        "meanings":"(or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main.",
        "sentence":"The word دَابَّةٍ comes from the root د ب ب and is associated with the meanings: (or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main."
    },

    {
        "indexid":2836,
        "wordid":4215,
        "word":"فَمِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2836,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2836,
        "wordid":4812,
        "word":"يَخْلُقُ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word يَخْلُقُ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2836,
        "wordid":7760,
        "word":"يَمْشِي",
        "rootid":466,
        "rootword":"م ش ي",
        "meanings":"To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about.",
        "sentence":"The word يَمْشِي comes from the root م ش ي and is associated with the meanings: To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about."
    },

    {
        "indexid":2836,
        "wordid":14096,
        "word":"بَطْنِهِ",
        "rootid":378,
        "rootword":"ب ط ن",
        "meanings":"Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward.",
        "sentence":"The word بَطْنِهِ comes from the root ب ط ن and is associated with the meanings: Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward."
    },

    {
        "indexid":2836,
        "wordid":14097,
        "word":"رِجْلَيْنِ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رِجْلَيْنِ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":2836,
        "wordid":14098,
        "word":"أَرْبَعٍ",
        "rootid":1796,
        "rootword":"ر ب ع",
        "meanings":"four, fourth, quarter, forty",
        "sentence":"The word أَرْبَعٍ comes from the root ر ب ع and is associated with the meanings: four, fourth, quarter, forty"
    }]}