{"data":[
    {
        "indexid":2868,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2868,
        "wordid":6918,
        "word":"مَكَانًا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانًا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2868,
        "wordid":7780,
        "word":"ضَيِّقًا",
        "rootid":686,
        "rootword":"ض ي ق",
        "meanings":"Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition.",
        "sentence":"The word ضَيِّقًا comes from the root ض ي ق and is associated with the meanings: Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition."
    },

    {
        "indexid":2868,
        "wordid":11277,
        "word":"مُقَرَّنِينَ",
        "rootid":1492,
        "rootword":"ق ر ن",
        "meanings":"to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs.",
        "sentence":"The word مُقَرَّنِينَ comes from the root ق ر ن and is associated with the meanings: to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs."
    },

    {
        "indexid":2868,
        "wordid":12851,
        "word":"دَعَوْا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دَعَوْا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":2868,
        "wordid":14194,
        "word":"أُلْقُوا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word أُلْقُوا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2868,
        "wordid":14195,
        "word":"ثُبُورًا",
        "rootid":699,
        "rootword":"ث ب ر",
        "meanings":"to keep back, lose, perish, disappoint, expel, curse, destroy.",
        "sentence":"The word ثُبُورًا comes from the root ث ب ر and is associated with the meanings: to keep back, lose, perish, disappoint, expel, curse, destroy."
    }]}