{"data":[
    {
        "indexid":2871,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2871,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2871,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2871,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2871,
        "wordid":3392,
        "word":"خَالِدِينَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word خَالِدِينَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":2871,
        "wordid":9601,
        "word":"وَعْدًا",
        "rootid":732,
        "rootword":"و ع د",
        "meanings":"to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise.",
        "sentence":"The word وَعْدًا comes from the root و ع د and is associated with the meanings: to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise."
    },

    {
        "indexid":2871,
        "wordid":11527,
        "word":"يَشَاءُونَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُونَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2871,
        "wordid":11905,
        "word":"مَسْءُولًا",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word مَسْءُولًا comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    }]}