{"data":[
    {
        "indexid":2928,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2928,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":2928,
        "wordid":6648,
        "word":"ذُكِّرُوا",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذُكِّرُوا comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2928,
        "wordid":14323,
        "word":"يَخِرُّوا",
        "rootid":1071,
        "rootword":"خ ر ر",
        "meanings":"To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another.",
        "sentence":"The word يَخِرُّوا comes from the root خ ر ر and is associated with the meanings: To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another."
    },

    {
        "indexid":2928,
        "wordid":14324,
        "word":"صُمًّا",
        "rootid":605,
        "rootword":"ص م م",
        "meanings":"to be deaf, cork (a bottle), stop (a flask), be obstructed (ear-hole).",
        "sentence":"The word صُمًّا comes from the root ص م م and is associated with the meanings: to be deaf, cork (a bottle), stop (a flask), be obstructed (ear-hole)."
    },

    {
        "indexid":2928,
        "wordid":14325,
        "word":"وَعُمْيَانًا",
        "rootid":482,
        "rootword":"ع م ي",
        "meanings":"to swerve from duty, stray from the right course, be or become blind, ignorant, obscure and dubious, deprive of the sight, rend abstruse, blind, dark, conceal. amaha - mental blindness, amaya - mental and physical blindness.",
        "sentence":"The word وَعُمْيَانًا comes from the root ع م ي and is associated with the meanings: to swerve from duty, stray from the right course, be or become blind, ignorant, obscure and dubious, deprive of the sight, rend abstruse, blind, dark, conceal. amaha - mental blindness, amaya - mental and physical blindness."
    }]}