{"data":[
    {
        "indexid":2946,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2946,
        "wordid":14346,
        "word":"ذَنْبٌ",
        "rootid":1758,
        "rootword":"ذ ن ب",
        "meanings":"to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression.",
        "sentence":"The word ذَنْبٌ comes from the root ذ ن ب and is associated with the meanings: to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression."
    },

    {
        "indexid":2946,
        "wordid":14347,
        "word":"فَأَخَافُ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word فَأَخَافُ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":2946,
        "wordid":14348,
        "word":"يَقْتُلُونِ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word يَقْتُلُونِ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    }]}