{"data":[
    {
        "indexid":2972,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2972,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2972,
        "wordid":3451,
        "word":"نَتَّبِعُ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word نَتَّبِعُ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":2972,
        "wordid":8412,
        "word":"الْغَالِبِينَ",
        "rootid":948,
        "rootword":"غ ل ب",
        "meanings":"overcame, conquered, subdued, mastered, surpassed, superior in power or force",
        "sentence":"The word الْغَالِبِينَ comes from the root غ ل ب and is associated with the meanings: overcame, conquered, subdued, mastered, surpassed, superior in power or force"
    },

    {
        "indexid":2972,
        "wordid":14382,
        "word":"السَّحَرَةَ",
        "rootid":1083,
        "rootword":"س ح ر",
        "meanings":"To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding.",
        "sentence":"The word السَّحَرَةَ comes from the root س ح ر and is associated with the meanings: To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding."
    }]}