{"data":[
    {
        "indexid":2976,
        "wordid":2479,
        "word":"فِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":2976,
        "wordid":2759,
        "word":"وَقَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2976,
        "wordid":6902,
        "word":"الْغَالِبُونَ",
        "rootid":948,
        "rootword":"غ ل ب",
        "meanings":"overcame, conquered, subdued, mastered, surpassed, superior in power or force",
        "sentence":"The word الْغَالِبُونَ comes from the root غ ل ب and is associated with the meanings: overcame, conquered, subdued, mastered, surpassed, superior in power or force"
    },

    {
        "indexid":2976,
        "wordid":11331,
        "word":"لَنَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word لَنَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":2976,
        "wordid":11670,
        "word":"فَأَلْقَوْا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَأَلْقَوْا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2976,
        "wordid":14385,
        "word":"حِبَالَهُمْ",
        "rootid":983,
        "rootword":"ح ب ل",
        "meanings":"tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians).",
        "sentence":"The word حِبَالَهُمْ comes from the root ح ب ل and is associated with the meanings: tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians)."
    },

    {
        "indexid":2976,
        "wordid":14386,
        "word":"وَعِصِيَّهُمْ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word وَعِصِيَّهُمْ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":2976,
        "wordid":14387,
        "word":"بِعِزَّةِ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word بِعِزَّةِ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    }]}