{"data":[
    {
        "indexid":2995,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2995,
        "wordid":2493,
        "word":"الْبَحْرَ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word الْبَحْرَ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":2995,
        "wordid":2567,
        "word":"اضْرِبْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word اضْرِبْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":2995,
        "wordid":2568,
        "word":"بِعَصَاكَ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word بِعَصَاكَ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":2995,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2995,
        "wordid":2991,
        "word":"الْعَظِيمِ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word الْعَظِيمِ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":2995,
        "wordid":6022,
        "word":"أَنِ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنِ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2995,
        "wordid":8718,
        "word":"فَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word فَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2995,
        "wordid":14406,
        "word":"فَانْفَلَقَ",
        "rootid":979,
        "rootword":"ف ل ق",
        "meanings":"it became split\/cleft\/cloven\/cracked, divided it lengthwise, fissure, longitudinal division, daybreak\/dawn, uttered\/performed what was admirable\/wonderful, to strive\/exert, become big\/bulky\/fat\/plump, whole creation, all beings\/things that are created, a piece\/fragment broken off, the cleaver.",
        "sentence":"The word فَانْفَلَقَ comes from the root ف ل ق and is associated with the meanings: it became split\/cleft\/cloven\/cracked, divided it lengthwise, fissure, longitudinal division, daybreak\/dawn, uttered\/performed what was admirable\/wonderful, to strive\/exert, become big\/bulky\/fat\/plump, whole creation, all beings\/things that are created, a piece\/fragment broken off, the cleaver."
    },

    {
        "indexid":2995,
        "wordid":14407,
        "word":"فِرْقٍ",
        "rootid":1165,
        "rootword":"ف ر ق",
        "meanings":"o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear.",
        "sentence":"The word فِرْقٍ comes from the root ف ر ق and is associated with the meanings: o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear."
    },

    {
        "indexid":2995,
        "wordid":14408,
        "word":"كَالطَّوْدِ",
        "rootid":121,
        "rootword":"ط و د",
        "meanings":"to be firm and immoveable, steadfast, it rose or ascended in the air, lofty\/great\/mighty\/high mountain\/building, cliff, mound, elevated or overlooking tract of land, go round about\/much.",
        "sentence":"The word كَالطَّوْدِ comes from the root ط و د and is associated with the meanings: to be firm and immoveable, steadfast, it rose or ascended in the air, lofty\/great\/mighty\/high mountain\/building, cliff, mound, elevated or overlooking tract of land, go round about\/much."
    }]}