{"data":[
    {
        "indexid":301,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":301,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":301,
        "wordid":2338,
        "word":"أَنْتَ",
        "rootid":1639,
        "rootword":"ا ن ت",
        "meanings":"you (singular)",
        "sentence":"The word أَنْتَ comes from the root ا ن ت and is associated with the meanings: you (singular)"
    },

    {
        "indexid":301,
        "wordid":3110,
        "word":"بَعْدَ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدَ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":301,
        "wordid":3160,
        "word":"رَبَّنَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّنَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":301,
        "wordid":4575,
        "word":"تُزِغْ",
        "rootid":519,
        "rootword":"ز ي غ",
        "meanings":"decline\/deviate\/swerve, turned aside, a doubting.",
        "sentence":"The word تُزِغْ comes from the root ز ي غ and is associated with the meanings: decline\/deviate\/swerve, turned aside, a doubting."
    },

    {
        "indexid":301,
        "wordid":4576,
        "word":"قُلُوبَنَا",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبَنَا comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":301,
        "wordid":4577,
        "word":"هَدَيْتَنَا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word هَدَيْتَنَا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":301,
        "wordid":4578,
        "word":"وَهَبْ",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word وَهَبْ comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    },

    {
        "indexid":301,
        "wordid":4579,
        "word":"لَدُنْكَ",
        "rootid":1731,
        "rootword":"ل د ن",
        "meanings":"At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same.",
        "sentence":"The word لَدُنْكَ comes from the root ل د ن and is associated with the meanings: At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same."
    },

    {
        "indexid":301,
        "wordid":4580,
        "word":"رَحْمَةً",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحْمَةً comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":301,
        "wordid":4581,
        "word":"الْوَهَّابُ",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word الْوَهَّابُ comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    }]}