{"data":[
    {
        "indexid":3019,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3019,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":3019,
        "wordid":8028,
        "word":"يُبْعَثُونَ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word يُبْعَثُونَ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":3019,
        "wordid":14436,
        "word":"تُخْزِنِي",
        "rootid":107,
        "rootword":"خ ز ي",
        "meanings":"To be or become abased\/vile\/despicable\/abject, fall into trial or affliction and evil, manifest foul actions or qualities, to be confounded or perplexed by reason of disgrace, moved or affected with shame.",
        "sentence":"The word تُخْزِنِي comes from the root خ ز ي and is associated with the meanings: To be or become abased\/vile\/despicable\/abject, fall into trial or affliction and evil, manifest foul actions or qualities, to be confounded or perplexed by reason of disgrace, moved or affected with shame."
    }]}