{"data":[
    {
        "indexid":3050,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3050,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3050,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3050,
        "wordid":6150,
        "word":"وَبَيْنَهُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word وَبَيْنَهُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3050,
        "wordid":7265,
        "word":"بَيْنِي",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنِي comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3050,
        "wordid":8390,
        "word":"مَعِيَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعِيَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":3050,
        "wordid":14461,
        "word":"فَافْتَحْ",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word فَافْتَحْ comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":3050,
        "wordid":14462,
        "word":"فَتْحًا",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word فَتْحًا comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":3050,
        "wordid":14463,
        "word":"وَنَجِّنِي",
        "rootid":171,
        "rootword":"ن ج و",
        "meanings":"to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide.",
        "sentence":"The word وَنَجِّنِي comes from the root ن ج و and is associated with the meanings: to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide."
    }]}