{"data":[
    {
        "indexid":3062,
        "wordid":6689,
        "word":"جَبَّارِينَ",
        "rootid":842,
        "rootword":"ج ب ر",
        "meanings":"To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence.",
        "sentence":"The word جَبَّارِينَ comes from the root ج ب ر and is associated with the meanings: To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence."
    },

    {
        "indexid":3062,
        "wordid":14473,
        "word":"بَطَشْتُمْ",
        "rootid":518,
        "rootword":"ب ط ش",
        "meanings":"An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault",
        "sentence":"The word بَطَشْتُمْ comes from the root ب ط ش and is associated with the meanings: An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault"
    }]}