{"data":[
    {
        "indexid":3080,
        "wordid":14481,
        "word":"وَزُرُوعٍ",
        "rootid":681,
        "rootword":"ز ر ع",
        "meanings":"To sow seed, cast seed, till the ground, cause [the plants, children] to grow, give increase to, he who sows, reaps, what is raised by means of sowing, seed-produce, what is sown. (Zay Ra Waw 'Ayn = offspring, children, a child)",
        "sentence":"The word وَزُرُوعٍ comes from the root ز ر ع and is associated with the meanings: To sow seed, cast seed, till the ground, cause [the plants, children] to grow, give increase to, he who sows, reaps, what is raised by means of sowing, seed-produce, what is sown. (Zay Ra Waw 'Ayn = offspring, children, a child)"
    },

    {
        "indexid":3080,
        "wordid":14482,
        "word":"وَنَخْلٍ",
        "rootid":1547,
        "rootword":"ن خ ل",
        "meanings":"to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice.",
        "sentence":"The word وَنَخْلٍ comes from the root ن خ ل and is associated with the meanings: to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice."
    },

    {
        "indexid":3080,
        "wordid":14483,
        "word":"طَلْعُهَا",
        "rootid":1517,
        "rootword":"ط ل ع",
        "meanings":"to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah).",
        "sentence":"The word طَلْعُهَا comes from the root ط ل ع and is associated with the meanings: to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah)."
    },

    {
        "indexid":3080,
        "wordid":14484,
        "word":"هَضِيمٌ",
        "rootid":210,
        "rootword":"ه ض م",
        "meanings":"o withold one's dues, be near break, oppress, do wrong, fall on each other, be slander.",
        "sentence":"The word هَضِيمٌ comes from the root ه ض م and is associated with the meanings: o withold one's dues, be near break, oppress, do wrong, fall on each other, be slander."
    }]}