{"data":[
    {
        "indexid":3103,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3103,
        "wordid":8317,
        "word":"الْغَابِرِينَ",
        "rootid":1613,
        "rootword":"غ ب ر",
        "meanings":"remained, lasted, continued, tarried, stayed, waited, passed\/went away, recrudescent, dust-colored",
        "sentence":"The word الْغَابِرِينَ comes from the root غ ب ر and is associated with the meanings: remained, lasted, continued, tarried, stayed, waited, passed\/went away, recrudescent, dust-colored"
    },

    {
        "indexid":3103,
        "wordid":14500,
        "word":"عَجُوزًا",
        "rootid":453,
        "rootword":"ع ج ز",
        "meanings":"to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. ",
        "sentence":"The word عَجُوزًا comes from the root ع ج ز and is associated with the meanings: to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. "
    }]}