{"data":[
    {
        "indexid":3109,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3109,
        "wordid":2194,
        "word":"تَتَّقُونَ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word تَتَّقُونَ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":3109,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3109,
        "wordid":14504,
        "word":"شُعَيْبٌ",
        "rootid":1624,
        "rootword":"ش ع ب",
        "meanings":"to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites.",
        "sentence":"The word شُعَيْبٌ comes from the root ش ع ب and is associated with the meanings: to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites."
    }]}