{"data":[
    {
        "indexid":3125,
        "wordid":12074,
        "word":"الرُّوحُ",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word الرُّوحُ comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    },

    {
        "indexid":3125,
        "wordid":12128,
        "word":"نَزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word نَزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":3125,
        "wordid":14512,
        "word":"الْأَمِينُ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْأَمِينُ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    }]}