{"data":[
    {
        "indexid":3127,
        "wordid":5380,
        "word":"مُبِينٍ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٍ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3127,
        "wordid":14514,
        "word":"بِلِسَانٍ",
        "rootid":227,
        "rootword":"ل س ن",
        "meanings":"a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech.",
        "sentence":"The word بِلِسَانٍ comes from the root ل س ن and is associated with the meanings: a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech."
    },

    {
        "indexid":3127,
        "wordid":14515,
        "word":"عَرَبِيٍّ",
        "rootid":1594,
        "rootword":"ع ر ب",
        "meanings":"Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven.",
        "sentence":"The word عَرَبِيٍّ comes from the root ع ر ب and is associated with the meanings: Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven."
    }]}