{"data":[
    {
        "indexid":313,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":313,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":313,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":313,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":313,
        "wordid":2449,
        "word":"الْكِتَابَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":313,
        "wordid":2909,
        "word":"بَصِيرٌ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word بَصِيرٌ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":313,
        "wordid":2936,
        "word":"أُوتُوا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word أُوتُوا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":313,
        "wordid":3192,
        "word":"أَسْلَمْتُ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word أَسْلَمْتُ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":313,
        "wordid":3233,
        "word":"فَقَدِ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدِ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":313,
        "wordid":3234,
        "word":"اهْتَدَوْا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word اهْتَدَوْا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":313,
        "wordid":3235,
        "word":"تَوَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word تَوَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":313,
        "wordid":3785,
        "word":"بِالْعِبَادِ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word بِالْعِبَادِ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":313,
        "wordid":4645,
        "word":"حَاجُّوكَ",
        "rootid":374,
        "rootword":"ح ج ج",
        "meanings":"to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain.",
        "sentence":"The word حَاجُّوكَ comes from the root ح ج ج and is associated with the meanings: to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain."
    },

    {
        "indexid":313,
        "wordid":4646,
        "word":"فَقُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":313,
        "wordid":4647,
        "word":"وَجْهِيَ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وَجْهِيَ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":313,
        "wordid":4648,
        "word":"وَمَنِ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنِ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":313,
        "wordid":4649,
        "word":"اتَّبَعَنِ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word اتَّبَعَنِ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":313,
        "wordid":4650,
        "word":"وَقُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":313,
        "wordid":4651,
        "word":"وَالْأُمِّيِّينَ",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word وَالْأُمِّيِّينَ comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    },

    {
        "indexid":313,
        "wordid":4652,
        "word":"ءَأَسْلَمْتُمْ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word ءَأَسْلَمْتُمْ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":313,
        "wordid":4653,
        "word":"أَسْلَمُوا",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word أَسْلَمُوا comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":313,
        "wordid":4654,
        "word":"الْبَلَاغُ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word الْبَلَاغُ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    }]}