{"data":[
    {
        "indexid":3153,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3153,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":3153,
        "wordid":6910,
        "word":"أُنَبِّئُكُمْ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word أُنَبِّئُكُمْ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":3153,
        "wordid":14541,
        "word":"تَنَزَّلُ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word تَنَزَّلُ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    }]}