{"data":[
    {
        "indexid":3178,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3178,
        "wordid":2020,
        "word":"أَنْعَمْتَ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word أَنْعَمْتَ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":3178,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3178,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3178,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3178,
        "wordid":2624,
        "word":"صَالِحًا",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word صَالِحًا comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":3178,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3178,
        "wordid":3189,
        "word":"الصَّالِحِينَ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word الصَّالِحِينَ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":3178,
        "wordid":3449,
        "word":"وَأَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَأَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3178,
        "wordid":6324,
        "word":"عِبَادِكَ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عِبَادِكَ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":3178,
        "wordid":9933,
        "word":"بِرَحْمَتِكَ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word بِرَحْمَتِكَ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":3178,
        "wordid":14595,
        "word":"فَتَبَسَّمَ",
        "rootid":1716,
        "rootword":"ب س م",
        "meanings":"smile, laugh a little but without sound, part lips to show teeth.",
        "sentence":"The word فَتَبَسَّمَ comes from the root ب س م and is associated with the meanings: smile, laugh a little but without sound, part lips to show teeth."
    },

    {
        "indexid":3178,
        "wordid":14596,
        "word":"ضَاحِكًا",
        "rootid":1725,
        "rootword":"ض ح ك",
        "meanings":"to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear.",
        "sentence":"The word ضَاحِكًا comes from the root ض ح ك and is associated with the meanings: to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear."
    },

    {
        "indexid":3178,
        "wordid":14597,
        "word":"قَوْلِهَا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَوْلِهَا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3178,
        "wordid":14598,
        "word":"أَوْزِعْنِي",
        "rootid":991,
        "rootword":"و ز ع",
        "meanings":"to keep pace, rouse, grant, inspire, set in ranks according to the battle order.",
        "sentence":"The word أَوْزِعْنِي comes from the root و ز ع and is associated with the meanings: to keep pace, rouse, grant, inspire, set in ranks according to the battle order."
    },

    {
        "indexid":3178,
        "wordid":14599,
        "word":"أَشْكُرَ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word أَشْكُرَ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":3178,
        "wordid":14600,
        "word":"نِعْمَتَكَ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَتَكَ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":3178,
        "wordid":14601,
        "word":"وَالِدَيَّ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word وَالِدَيَّ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":3178,
        "wordid":14602,
        "word":"أَعْمَلَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَلَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":3178,
        "wordid":14603,
        "word":"تَرْضَاهُ",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word تَرْضَاهُ comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":3178,
        "wordid":14604,
        "word":"وَأَدْخِلْنِي",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word وَأَدْخِلْنِي comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    }]}