{"data":[
    {
        "indexid":3193,
        "wordid":2695,
        "word":"يَفْعَلُونَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word يَفْعَلُونَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":3193,
        "wordid":4730,
        "word":"قَالَتْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3193,
        "wordid":5858,
        "word":"أَهْلِهَا",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلِهَا comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":3193,
        "wordid":6921,
        "word":"دَخَلُوا",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word دَخَلُوا comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":3193,
        "wordid":7662,
        "word":"وَجَعَلُوا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلُوا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":3193,
        "wordid":11738,
        "word":"قَرْيَةً",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word قَرْيَةً comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":3193,
        "wordid":14640,
        "word":"الْمُلُوكَ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمُلُوكَ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":3193,
        "wordid":14641,
        "word":"أَفْسَدُوهَا",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word أَفْسَدُوهَا comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":3193,
        "wordid":14642,
        "word":"أَعِزَّةَ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word أَعِزَّةَ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":3193,
        "wordid":14643,
        "word":"أَذِلَّةً",
        "rootid":461,
        "rootword":"ذ ل ل",
        "meanings":"to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken.",
        "sentence":"The word أَذِلَّةً comes from the root ذ ل ل and is associated with the meanings: to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken."
    }]}