{"data":[
    {
        "indexid":3199,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3199,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3199,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":3199,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3199,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3199,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3199,
        "wordid":2811,
        "word":"الْكِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":3199,
        "wordid":2946,
        "word":"كَفَرَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3199,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3199,
        "wordid":3254,
        "word":"عِنْدَهُ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَهُ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":3199,
        "wordid":4258,
        "word":"أَنَا",
        "rootid":1523,
        "rootword":"ا ن ا",
        "meanings":"",
        "sentence":"The word أَنَا comes from the root ا ن ا and is associated with the meanings: "
    },

    {
        "indexid":3199,
        "wordid":4324,
        "word":"غَنِيٌّ",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word غَنِيٌّ comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":3199,
        "wordid":4839,
        "word":"رَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3199,
        "wordid":4917,
        "word":"عِلْمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3199,
        "wordid":6477,
        "word":"قَبْلَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":3199,
        "wordid":6886,
        "word":"يَرْتَدَّ",
        "rootid":1636,
        "rootword":"ر د د",
        "meanings":"to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro.",
        "sentence":"The word يَرْتَدَّ comes from the root ر د د and is associated with the meanings: to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro."
    },

    {
        "indexid":3199,
        "wordid":8847,
        "word":"كَرِيمٌ",
        "rootid":27,
        "rootword":"ك ر م",
        "meanings":"To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous",
        "sentence":"The word كَرِيمٌ comes from the root ك ر م and is associated with the meanings: To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous"
    },

    {
        "indexid":3199,
        "wordid":10006,
        "word":"لِنَفْسِهِ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word لِنَفْسِهِ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":3199,
        "wordid":10620,
        "word":"فَضْلِ",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word فَضْلِ comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":3199,
        "wordid":14659,
        "word":"ءَاتِيكَ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word ءَاتِيكَ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":3199,
        "wordid":14661,
        "word":"طَرْفُكَ",
        "rootid":1291,
        "rootword":"ط ر ف",
        "meanings":"",
        "sentence":"The word طَرْفُكَ comes from the root ط ر ف and is associated with the meanings: "
    },

    {
        "indexid":3199,
        "wordid":14662,
        "word":"رَءَاهُ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word رَءَاهُ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":3199,
        "wordid":14663,
        "word":"مُسْتَقِرًّا",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word مُسْتَقِرًّا comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":3199,
        "wordid":14664,
        "word":"لِيَبْلُوَنِي",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word لِيَبْلُوَنِي comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    },

    {
        "indexid":3199,
        "wordid":14665,
        "word":"ءَأَشْكُرُ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word ءَأَشْكُرُ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":3199,
        "wordid":14666,
        "word":"أَكْفُرُ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word أَكْفُرُ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3199,
        "wordid":14667,
        "word":"شَكَرَ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word شَكَرَ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":3199,
        "wordid":14668,
        "word":"يَشْكُرُ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word يَشْكُرُ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    }]}