{"data":[
    {
        "indexid":3213,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":3213,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3213,
        "wordid":2512,
        "word":"لِقَوْمِهِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمِهِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":3213,
        "wordid":5690,
        "word":"الْفَاحِشَةَ",
        "rootid":1329,
        "rootword":"ف ح ش",
        "meanings":"became excessive\/immoderate\/enormous\/exorbitant\/overmuch\/beyond measure, foul\/bad\/evil\/unseemly\/indecency\/abominable, lewd\/gross\/obscene, committing excess which is forbidden, transgress the bounds\/limits, avaricious, adultery\/fornication.",
        "sentence":"The word الْفَاحِشَةَ comes from the root ف ح ش and is associated with the meanings: became excessive\/immoderate\/enormous\/exorbitant\/overmuch\/beyond measure, foul\/bad\/evil\/unseemly\/indecency\/abominable, lewd\/gross\/obscene, committing excess which is forbidden, transgress the bounds\/limits, avaricious, adultery\/fornication."
    },

    {
        "indexid":3213,
        "wordid":7569,
        "word":"وَلُوطًا",
        "rootid":7,
        "rootword":"ل و ط",
        "meanings":"Also see Lam-Tay Lut",
        "sentence":"The word وَلُوطًا comes from the root ل و ط and is associated with the meanings: Also see Lam-Tay Lut"
    },

    {
        "indexid":3213,
        "wordid":8304,
        "word":"أَتَأْتُونَ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word أَتَأْتُونَ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":3213,
        "wordid":13239,
        "word":"تُبْصِرُونَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word تُبْصِرُونَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    }]}