{"data":[
    {
        "indexid":3259,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3259,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3259,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3259,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3259,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3259,
        "wordid":4206,
        "word":"الْمُرْسَلِينَ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الْمُرْسَلِينَ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":3259,
        "wordid":8493,
        "word":"الْيَمِّ",
        "rootid":405,
        "rootword":"ي م م",
        "meanings":"sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for.",
        "sentence":"The word الْيَمِّ comes from the root ي م م and is associated with the meanings: sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for."
    },

    {
        "indexid":3259,
        "wordid":12680,
        "word":"تَحْزَنِي",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word تَحْزَنِي comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":3259,
        "wordid":12684,
        "word":"إِلَيْكِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3259,
        "wordid":14777,
        "word":"أُمِّ",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word أُمِّ comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    },

    {
        "indexid":3259,
        "wordid":14778,
        "word":"أَرْضِعِيهِ",
        "rootid":311,
        "rootword":"ر ض ع",
        "meanings":"he sucked the breast of his mother (said of a child), to suckle, wet nurse \/ suckling woman. ",
        "sentence":"The word أَرْضِعِيهِ comes from the root ر ض ع and is associated with the meanings: he sucked the breast of his mother (said of a child), to suckle, wet nurse \/ suckling woman. "
    },

    {
        "indexid":3259,
        "wordid":14779,
        "word":"خِفْتِ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خِفْتِ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":3259,
        "wordid":14780,
        "word":"فَأَلْقِيهِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَأَلْقِيهِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":3259,
        "wordid":14781,
        "word":"تَخَافِي",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word تَخَافِي comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":3259,
        "wordid":14782,
        "word":"رَادُّوهُ",
        "rootid":1636,
        "rootword":"ر د د",
        "meanings":"to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro.",
        "sentence":"The word رَادُّوهُ comes from the root ر د د and is associated with the meanings: to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro."
    },

    {
        "indexid":3259,
        "wordid":14783,
        "word":"وَجَاعِلُوهُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَاعِلُوهُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    }]}