{"data":[
    {
        "indexid":3264,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3264,
        "wordid":2250,
        "word":"قَبْلُ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلُ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":3264,
        "wordid":2983,
        "word":"أَهْلِ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلِ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":3264,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":3264,
        "wordid":5032,
        "word":"بَيْتٍ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word بَيْتٍ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":3264,
        "wordid":12958,
        "word":"أَدُلُّكُمْ",
        "rootid":715,
        "rootword":"د ل ل",
        "meanings":"To show, point out, indicate, direct, point at, guide, delude, discover, lead.",
        "sentence":"The word أَدُلُّكُمْ comes from the root د ل ل and is associated with the meanings: To show, point out, indicate, direct, point at, guide, delude, discover, lead."
    },

    {
        "indexid":3264,
        "wordid":14800,
        "word":"وَحَرَّمْنَا",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word وَحَرَّمْنَا comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":3264,
        "wordid":14801,
        "word":"الْمَرَاضِعَ",
        "rootid":311,
        "rootword":"ر ض ع",
        "meanings":"he sucked the breast of his mother (said of a child), to suckle, wet nurse \/ suckling woman. ",
        "sentence":"The word الْمَرَاضِعَ comes from the root ر ض ع and is associated with the meanings: he sucked the breast of his mother (said of a child), to suckle, wet nurse \/ suckling woman. "
    },

    {
        "indexid":3264,
        "wordid":14802,
        "word":"فَقَالَتْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَتْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3264,
        "wordid":14803,
        "word":"يَكْفُلُونَهُ",
        "rootid":139,
        "rootword":"ك ف ل",
        "meanings":"To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety.",
        "sentence":"The word يَكْفُلُونَهُ comes from the root ك ف ل and is associated with the meanings: To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety."
    },

    {
        "indexid":3264,
        "wordid":14804,
        "word":"نَاصِحُونَ",
        "rootid":1519,
        "rootword":"ن ص ح",
        "meanings":"to be pure, unmixed, genuine, act sincerely, give sincere advice, counsel earnestly, be faithful.",
        "sentence":"The word نَاصِحُونَ comes from the root ن ص ح and is associated with the meanings: to be pure, unmixed, genuine, act sincerely, give sincere advice, counsel earnestly, be faithful."
    }]}