{"data":[
    {
        "indexid":3274,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3274,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3274,
        "wordid":3012,
        "word":"سَوَاءَ",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word سَوَاءَ comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":3274,
        "wordid":3013,
        "word":"السَّبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word السَّبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":3274,
        "wordid":4839,
        "word":"رَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3274,
        "wordid":8167,
        "word":"تِلْقَاءَ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word تِلْقَاءَ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":3274,
        "wordid":14834,
        "word":"تَوَجَّهَ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word تَوَجَّهَ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":3274,
        "wordid":14835,
        "word":"يَهْدِيَنِي",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word يَهْدِيَنِي comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    }]}