{"data":[
    {
        "indexid":328,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":328,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":328,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":328,
        "wordid":2338,
        "word":"أَنْتَ",
        "rootid":1639,
        "rootword":"ا ن ت",
        "meanings":"you (singular)",
        "sentence":"The word أَنْتَ comes from the root ا ن ت and is associated with the meanings: you (singular)"
    },

    {
        "indexid":328,
        "wordid":2339,
        "word":"الْعَلِيمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعَلِيمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":328,
        "wordid":2399,
        "word":"مِنِّي",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنِّي comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":328,
        "wordid":3163,
        "word":"السَّمِيعُ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word السَّمِيعُ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":328,
        "wordid":4720,
        "word":"عِمْرَانَ",
        "rootid":507,
        "rootword":"ع م ر",
        "meanings":"to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age.",
        "sentence":"The word عِمْرَانَ comes from the root ع م ر and is associated with the meanings: to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age."
    },

    {
        "indexid":328,
        "wordid":4723,
        "word":"قَالَتِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":328,
        "wordid":4724,
        "word":"امْرَأَتُ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word امْرَأَتُ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":328,
        "wordid":4725,
        "word":"نَذَرْتُ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word نَذَرْتُ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":328,
        "wordid":4726,
        "word":"بَطْنِي",
        "rootid":378,
        "rootword":"ب ط ن",
        "meanings":"Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward.",
        "sentence":"The word بَطْنِي comes from the root ب ط ن and is associated with the meanings: Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward."
    },

    {
        "indexid":328,
        "wordid":4727,
        "word":"مُحَرَّرًا",
        "rootid":399,
        "rootword":"ح ر ر",
        "meanings":"To be free (slave), be freeborn.",
        "sentence":"The word مُحَرَّرًا comes from the root ح ر ر and is associated with the meanings: To be free (slave), be freeborn."
    },

    {
        "indexid":328,
        "wordid":4728,
        "word":"فَتَقَبَّلْ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word فَتَقَبَّلْ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    }]}