{"data":[
    {
        "indexid":3335,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3335,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3335,
        "wordid":2033,
        "word":"لِلْمُتَّقِينَ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word لِلْمُتَّقِينَ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":3335,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3335,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":3335,
        "wordid":2888,
        "word":"الدَّارُ",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word الدَّارُ comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":3335,
        "wordid":2889,
        "word":"الْءَاخِرَةُ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةُ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":3335,
        "wordid":5990,
        "word":"يُرِيدُونَ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُونَ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":3335,
        "wordid":6770,
        "word":"فَسَادًا",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word فَسَادًا comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":3335,
        "wordid":8459,
        "word":"وَالْعَاقِبَةُ",
        "rootid":1507,
        "rootword":"ع ق ب",
        "meanings":"to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged.",
        "sentence":"The word وَالْعَاقِبَةُ comes from the root ع ق ب and is associated with the meanings: to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged."
    },

    {
        "indexid":3335,
        "wordid":11785,
        "word":"عُلُوًّا",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word عُلُوًّا comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":3335,
        "wordid":14994,
        "word":"نَجْعَلُهَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word نَجْعَلُهَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    }]}