{"data":[
    {
        "indexid":335,
        "wordid":2007,
        "word":"الْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":335,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":335,
        "wordid":4161,
        "word":"الْمَلَائِكَةُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمَلَائِكَةُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":335,
        "wordid":4723,
        "word":"قَالَتِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":335,
        "wordid":4754,
        "word":"يَامَرْيَمُ",
        "rootid":1302,
        "rootword":"م ر ي م",
        "meanings":"Mariam, Mary",
        "sentence":"The word يَامَرْيَمُ comes from the root م ر ي م and is associated with the meanings: Mariam, Mary"
    },

    {
        "indexid":335,
        "wordid":4783,
        "word":"اصْطَفَاكِ",
        "rootid":206,
        "rootword":"ص ف و",
        "meanings":"it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh.",
        "sentence":"The word اصْطَفَاكِ comes from the root ص ف و and is associated with the meanings: it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh."
    },

    {
        "indexid":335,
        "wordid":4784,
        "word":"وَطَهَّرَكِ",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word وَطَهَّرَكِ comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    },

    {
        "indexid":335,
        "wordid":4785,
        "word":"وَاصْطَفَاكِ",
        "rootid":206,
        "rootword":"ص ف و",
        "meanings":"it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh.",
        "sentence":"The word وَاصْطَفَاكِ comes from the root ص ف و and is associated with the meanings: it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh."
    },

    {
        "indexid":335,
        "wordid":4786,
        "word":"نِسَاءِ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word نِسَاءِ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    }]}