{"data":[
    {
        "indexid":3357,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3357,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3357,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3357,
        "wordid":2206,
        "word":"رِزْقًا",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word رِزْقًا comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":3357,
        "wordid":2224,
        "word":"دُونِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":3357,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3357,
        "wordid":2295,
        "word":"تُرْجَعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word تُرْجَعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":3357,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":3357,
        "wordid":2780,
        "word":"تَعْبُدُونَ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word تَعْبُدُونَ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":3357,
        "wordid":3338,
        "word":"وَاشْكُرُوا",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word وَاشْكُرُوا comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":3357,
        "wordid":10997,
        "word":"يَمْلِكُونَ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word يَمْلِكُونَ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":3357,
        "wordid":11042,
        "word":"الرِّزْقَ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word الرِّزْقَ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":3357,
        "wordid":15034,
        "word":"أَوْثَانًا",
        "rootid":709,
        "rootword":"و ث ن",
        "meanings":"to remain on one condition, set up as a sign, raise to dignity, erect, raise for honouring, set up, remain in a place. wathan - idol.",
        "sentence":"The word أَوْثَانًا comes from the root و ث ن and is associated with the meanings: to remain on one condition, set up as a sign, raise to dignity, erect, raise for honouring, set up, remain in a place. wathan - idol."
    },

    {
        "indexid":3357,
        "wordid":15035,
        "word":"وَتَخْلُقُونَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word وَتَخْلُقُونَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":3357,
        "wordid":15036,
        "word":"إِفْكًا",
        "rootid":924,
        "rootword":"ا ف ك",
        "meanings":"change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn.",
        "sentence":"The word إِفْكًا comes from the root ا ف ك and is associated with the meanings: change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn."
    },

    {
        "indexid":3357,
        "wordid":15037,
        "word":"فَابْتَغُوا",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word فَابْتَغُوا comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":3357,
        "wordid":15038,
        "word":"وَاعْبُدُوهُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word وَاعْبُدُوهُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    }]}