{"data":[
    {
        "indexid":3376,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3376,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3376,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3376,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":3376,
        "wordid":2189,
        "word":"اعْبُدُوا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word اعْبُدُوا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":3376,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3376,
        "wordid":2513,
        "word":"يَاقَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word يَاقَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":3376,
        "wordid":2582,
        "word":"تَعْثَوْا",
        "rootid":1118,
        "rootword":"ع ث و",
        "meanings":"to do evil, perpetrate crime, act corruptly\/wickedly.",
        "sentence":"The word تَعْثَوْا comes from the root ع ث و and is associated with the meanings: to do evil, perpetrate crime, act corruptly\/wickedly."
    },

    {
        "indexid":3376,
        "wordid":2583,
        "word":"مُفْسِدِينَ",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word مُفْسِدِينَ comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":3376,
        "wordid":3802,
        "word":"وَإِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3376,
        "wordid":4176,
        "word":"الْيَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word الْيَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":3376,
        "wordid":8244,
        "word":"أَخَاهُمْ",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word أَخَاهُمْ comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":3376,
        "wordid":8321,
        "word":"شُعَيْبًا",
        "rootid":1624,
        "rootword":"ش ع ب",
        "meanings":"to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites.",
        "sentence":"The word شُعَيْبًا comes from the root ش ع ب and is associated with the meanings: to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites."
    },

    {
        "indexid":3376,
        "wordid":15069,
        "word":"وَارْجُوا",
        "rootid":1344,
        "rootword":"ر ج و",
        "meanings":"to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62).",
        "sentence":"The word وَارْجُوا comes from the root ر ج و and is associated with the meanings: to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62)."
    },

    {
        "indexid":3376,
        "wordid":15070,
        "word":"الْءَاخِرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    }]}