{"data":[
    {
        "indexid":34,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":34,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":34,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":34,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":34,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":34,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":34,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":34,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":34,
        "wordid":2277,
        "word":"يَنْقُضُونَ",
        "rootid":297,
        "rootword":"ن ق ض",
        "meanings":"to pull down, demolish, break (contract), undo a thing, violate (treaty), unravel\/untwist.",
        "sentence":"The word يَنْقُضُونَ comes from the root ن ق ض and is associated with the meanings: to pull down, demolish, break (contract), undo a thing, violate (treaty), unravel\/untwist."
    },

    {
        "indexid":34,
        "wordid":2278,
        "word":"عَهْدَ",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word عَهْدَ comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":34,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":34,
        "wordid":2280,
        "word":"مِيثَاقِهِ",
        "rootid":582,
        "rootword":"و ث ق",
        "meanings":"to place trust in any one, rely upon, bind.",
        "sentence":"The word مِيثَاقِهِ comes from the root و ث ق and is associated with the meanings: to place trust in any one, rely upon, bind."
    },

    {
        "indexid":34,
        "wordid":2281,
        "word":"وَيَقْطَعُونَ",
        "rootid":395,
        "rootword":"ق ط ع",
        "meanings":"to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion.",
        "sentence":"The word وَيَقْطَعُونَ comes from the root ق ط ع and is associated with the meanings: to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion."
    },

    {
        "indexid":34,
        "wordid":2282,
        "word":"أَمَرَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمَرَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":34,
        "wordid":2283,
        "word":"يُوصَلَ",
        "rootid":1686,
        "rootword":"و ص ل",
        "meanings":"attain, reach, connect, apply, make close, to come\/deliver\/convey, to continue, union (of companions\/friends\/lovers).",
        "sentence":"The word يُوصَلَ comes from the root و ص ل and is associated with the meanings: attain, reach, connect, apply, make close, to come\/deliver\/convey, to continue, union (of companions\/friends\/lovers)."
    },

    {
        "indexid":34,
        "wordid":2284,
        "word":"وَيُفْسِدُونَ",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word وَيُفْسِدُونَ comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":34,
        "wordid":2285,
        "word":"الْخَاسِرُونَ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word الْخَاسِرُونَ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    }]}