{"data":[
    {
        "indexid":343,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":343,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":343,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":343,
        "wordid":2230,
        "word":"فَاتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word فَاتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":343,
        "wordid":2424,
        "word":"لِمَا",
        "rootid":1155,
        "rootword":"ل م ا",
        "meanings":"Why? For what reason?",
        "sentence":"The word لِمَا comes from the root ل م ا and is associated with the meanings: Why? For what reason?"
    },

    {
        "indexid":343,
        "wordid":2490,
        "word":"رَبِّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":343,
        "wordid":2652,
        "word":"بَيْنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":343,
        "wordid":4279,
        "word":"بَعْضَ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضَ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":343,
        "wordid":4832,
        "word":"وَمُصَدِّقًا",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word وَمُصَدِّقًا comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":343,
        "wordid":4833,
        "word":"يَدَيَّ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word يَدَيَّ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":343,
        "wordid":4835,
        "word":"وَلِأُحِلَّ",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word وَلِأُحِلَّ comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":343,
        "wordid":4836,
        "word":"حُرِّمَ",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حُرِّمَ comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":343,
        "wordid":4837,
        "word":"وَجِئْتُكُمْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word وَجِئْتُكُمْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":343,
        "wordid":4838,
        "word":"وَأَطِيعُونِ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word وَأَطِيعُونِ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    }]}