{"data":[
    {
        "indexid":3475,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3475,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":3475,
        "wordid":2072,
        "word":"عَذَابٌ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابٌ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":3475,
        "wordid":2074,
        "word":"وَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3475,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":3475,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3475,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":3475,
        "wordid":2614,
        "word":"بِغَيْرِ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word بِغَيْرِ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":3475,
        "wordid":2660,
        "word":"هُزُوًا",
        "rootid":1496,
        "rootword":"ه ز ا",
        "meanings":"to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) .",
        "sentence":"The word هُزُوًا comes from the root ه ز ا and is associated with the meanings: to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) ."
    },

    {
        "indexid":3475,
        "wordid":2873,
        "word":"مُهِينٌ",
        "rootid":470,
        "rootword":"ه و ن",
        "meanings":"to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn.",
        "sentence":"The word مُهِينٌ comes from the root ه و ن and is associated with the meanings: to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn."
    },

    {
        "indexid":3475,
        "wordid":3345,
        "word":"سَبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":3475,
        "wordid":6471,
        "word":"عِلْمٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3475,
        "wordid":7883,
        "word":"لِيُضِلَّ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word لِيُضِلَّ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":3475,
        "wordid":12163,
        "word":"الْحَدِيثِ",
        "rootid":1086,
        "rootword":"ح د ث",
        "meanings":"something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\"",
        "sentence":"The word الْحَدِيثِ comes from the root ح د ث and is associated with the meanings: something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\""
    },

    {
        "indexid":3475,
        "wordid":15215,
        "word":"يَشْتَرِي",
        "rootid":120,
        "rootword":"ش ر ي",
        "meanings":"to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another.",
        "sentence":"The word يَشْتَرِي comes from the root ش ر ي and is associated with the meanings: to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another."
    },

    {
        "indexid":3475,
        "wordid":15216,
        "word":"لَهْوَ",
        "rootid":473,
        "rootword":"ل ه و",
        "meanings":"become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless.",
        "sentence":"The word لَهْوَ comes from the root ل ه و and is associated with the meanings: become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless."
    },

    {
        "indexid":3475,
        "wordid":15217,
        "word":"وَيَتَّخِذَهَا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word وَيَتَّخِذَهَا comes from the root ا خ ذ and is associated with the meanings: "
    }]}