{"data":[
    {
        "indexid":3487,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3487,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3487,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3487,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3487,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":3487,
        "wordid":2787,
        "word":"لِلنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word لِلنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":3487,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":3487,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3487,
        "wordid":11913,
        "word":"تَمْشِ",
        "rootid":466,
        "rootword":"م ش ي",
        "meanings":"To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about.",
        "sentence":"The word تَمْشِ comes from the root م ش ي and is associated with the meanings: To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about."
    },

    {
        "indexid":3487,
        "wordid":11914,
        "word":"مَرَحًا",
        "rootid":763,
        "rootword":"م ر ح",
        "meanings":"To be weak, to leak or let flow water or tears, to be joyful or glad, rejoice above measure (excessively\/exceedingly), proud and self-conceited, behave unthankfully or ungratefully.",
        "sentence":"The word مَرَحًا comes from the root م ر ح and is associated with the meanings: To be weak, to leak or let flow water or tears, to be joyful or glad, rejoice above measure (excessively\/exceedingly), proud and self-conceited, behave unthankfully or ungratefully."
    },

    {
        "indexid":3487,
        "wordid":15244,
        "word":"تُصَعِّرْ",
        "rootid":288,
        "rootword":"ص ع ر",
        "meanings":"to turn (the face), have (the face) distorted. sa'ara (vb. 2) - to make wry face.",
        "sentence":"The word تُصَعِّرْ comes from the root ص ع ر and is associated with the meanings: to turn (the face), have (the face) distorted. sa'ara (vb. 2) - to make wry face."
    },

    {
        "indexid":3487,
        "wordid":15245,
        "word":"خَدَّكَ",
        "rootid":1166,
        "rootword":"خ د د",
        "meanings":"To furrow\/trench\/clave, to mark or impress, to contract\/shrink\/wrinkle, to oppose, divide into distinct parties, to rank or class.",
        "sentence":"The word خَدَّكَ comes from the root خ د د and is associated with the meanings: To furrow\/trench\/clave, to mark or impress, to contract\/shrink\/wrinkle, to oppose, divide into distinct parties, to rank or class."
    },

    {
        "indexid":3487,
        "wordid":15246,
        "word":"مُخْتَالٍ",
        "rootid":656,
        "rootword":"خ ي ل",
        "meanings":"To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse).",
        "sentence":"The word مُخْتَالٍ comes from the root خ ي ل and is associated with the meanings: To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse)."
    },

    {
        "indexid":3487,
        "wordid":15247,
        "word":"فَخُورٍ",
        "rootid":1138,
        "rootword":"ف خ ر",
        "meanings":"self-glorification\/magnification, boast, to disdain\/scorn, proud\/haughty, long\/tall\/great, excellent quality, baked pottery\/clay, earthen vessel.",
        "sentence":"The word فَخُورٍ comes from the root ف خ ر and is associated with the meanings: self-glorification\/magnification, boast, to disdain\/scorn, proud\/haughty, long\/tall\/great, excellent quality, baked pottery\/clay, earthen vessel."
    }]}