{"data":[
    {
        "indexid":3506,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3506,
        "wordid":2047,
        "word":"قَبْلِكَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِكَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":3506,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":3506,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3506,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":3506,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":3506,
        "wordid":2752,
        "word":"يَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3506,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":3506,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3506,
        "wordid":3456,
        "word":"يَهْتَدُونَ",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word يَهْتَدُونَ comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":3506,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":3506,
        "wordid":6679,
        "word":"نَذِيرٍ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word نَذِيرٍ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":3506,
        "wordid":7330,
        "word":"أَتَاهُمْ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word أَتَاهُمْ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":3506,
        "wordid":7995,
        "word":"لِتُنْذِرَ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word لِتُنْذِرَ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":3506,
        "wordid":9825,
        "word":"افْتَرَاهُ",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word افْتَرَاهُ comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    }]}