{"data":[
    {
        "indexid":3582,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3582,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3582,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3582,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":3582,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3582,
        "wordid":4068,
        "word":"تَمَسُّوهُنَّ",
        "rootid":797,
        "rootword":"م س س",
        "meanings":"To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment.",
        "sentence":"The word تَمَسُّوهُنَّ comes from the root م س س and is associated with the meanings: To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment."
    },

    {
        "indexid":3582,
        "wordid":4076,
        "word":"طَلَّقْتُمُوهُنَّ",
        "rootid":935,
        "rootword":"ط ل ق",
        "meanings":"to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose.",
        "sentence":"The word طَلَّقْتُمُوهُنَّ comes from the root ط ل ق and is associated with the meanings: to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose."
    },

    {
        "indexid":3582,
        "wordid":4077,
        "word":"قَبْلِ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":3582,
        "wordid":5784,
        "word":"الْمُؤْمِنَاتِ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنَاتِ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3582,
        "wordid":15423,
        "word":"سَرَاحًا",
        "rootid":1187,
        "rootword":"س ر ح",
        "meanings":"to send, release, set free, drive to pasture (flock).",
        "sentence":"The word سَرَاحًا comes from the root س ر ح and is associated with the meanings: to send, release, set free, drive to pasture (flock)."
    },

    {
        "indexid":3582,
        "wordid":15424,
        "word":"جَمِيلًا",
        "rootid":310,
        "rootword":"ج م ل",
        "meanings":"To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope.",
        "sentence":"The word جَمِيلًا comes from the root ج م ل and is associated with the meanings: To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope."
    },

    {
        "indexid":3582,
        "wordid":15496,
        "word":"نَكَحْتُمُ",
        "rootid":379,
        "rootword":"ن ك ح",
        "meanings":"to tie, make a knot, contract, to marry, marriage.",
        "sentence":"The word نَكَحْتُمُ comes from the root ن ك ح and is associated with the meanings: to tie, make a knot, contract, to marry, marriage."
    },

    {
        "indexid":3582,
        "wordid":15497,
        "word":"عِدَّةٍ",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word عِدَّةٍ comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    },

    {
        "indexid":3582,
        "wordid":15498,
        "word":"تَعْتَدُّونَهَا",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word تَعْتَدُّونَهَا comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    },

    {
        "indexid":3582,
        "wordid":15499,
        "word":"فَمَتِّعُوهُنَّ",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word فَمَتِّعُوهُنَّ comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":3582,
        "wordid":15500,
        "word":"وَسَرِّحُوهُنَّ",
        "rootid":1187,
        "rootword":"س ر ح",
        "meanings":"to send, release, set free, drive to pasture (flock).",
        "sentence":"The word وَسَرِّحُوهُنَّ comes from the root س ر ح and is associated with the meanings: to send, release, set free, drive to pasture (flock)."
    }]}