{"data":[
    {
        "indexid":3584,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3584,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3584,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3584,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3584,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3584,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3584,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3584,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3584,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3584,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3584,
        "wordid":2598,
        "word":"أَدْنَى",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word أَدْنَى comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":3584,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3584,
        "wordid":3056,
        "word":"مِمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِمَّنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3584,
        "wordid":3369,
        "word":"جُنَاحَ",
        "rootid":1378,
        "rootword":"ج ن ح",
        "meanings":"to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame.",
        "sentence":"The word جُنَاحَ comes from the root ج ن ح and is associated with the meanings: to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame."
    },

    {
        "indexid":3584,
        "wordid":4304,
        "word":"مِنْهُنَّ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُنَّ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3584,
        "wordid":4648,
        "word":"وَمَنِ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنِ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3584,
        "wordid":4675,
        "word":"تَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word تَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3584,
        "wordid":5062,
        "word":"قُلُوبِكُمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبِكُمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":3584,
        "wordid":5657,
        "word":"عَلِيمًا",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمًا comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3584,
        "wordid":11937,
        "word":"حَلِيمًا",
        "rootid":1558,
        "rootword":"ح ل م",
        "meanings":"To dream, have a vision, attain to puberty.",
        "sentence":"The word حَلِيمًا comes from the root ح ل م and is associated with the meanings: To dream, have a vision, attain to puberty."
    },

    {
        "indexid":3584,
        "wordid":12961,
        "word":"تَقَرَّ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word تَقَرَّ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":3584,
        "wordid":15517,
        "word":"تُرْجِي",
        "rootid":1344,
        "rootword":"ر ج و",
        "meanings":"to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62).",
        "sentence":"The word تُرْجِي comes from the root ر ج و and is associated with the meanings: to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62)."
    },

    {
        "indexid":3584,
        "wordid":15518,
        "word":"وَتُءْوِي",
        "rootid":1225,
        "rootword":"ا و ي",
        "meanings":"a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to.",
        "sentence":"The word وَتُءْوِي comes from the root ا و ي and is associated with the meanings: a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to."
    },

    {
        "indexid":3584,
        "wordid":15519,
        "word":"ابْتَغَيْتَ",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word ابْتَغَيْتَ comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":3584,
        "wordid":15520,
        "word":"عَزَلْتَ",
        "rootid":501,
        "rootword":"ع ز ل",
        "meanings":"to set aside, remove from. ma'zilun - a place separate from the rest, secluded spot, place of retirement, far away. ma'zulun - removed. i'tizal (vb. 8) to separate or remove one self from.. . 'Azalta (prt. 2nd. m. sing.): Thou put aside (in the matter) provisionally.. I'tazala (prf. 3rd. m. sing. VIII): He withdrew, kept away.. I'tazalaa (prf. 3rd. m. plu.): They kept away, left you alone.. I'tazaltumuu (prf.2nd p. m. plu. juss.): You have left (them).. Ya'taziluu (imp. 3rd. m. plu. final Nun dropped): They withdraw, leave (you) alone.. A'tazilu (imp. 1st. sing. VIII): I shall withdraw, shall keep away.. I'taziluu (prt. n. plu.): You keep away.. I'taziluuni (comp. I'tazilu + nii prt. m. plu.): Keep away from me.. Ma'zuuluuna (pct. pic. n. plu.): Removed ones; Precluded ones.. Ma`zilun (n. of place): Place where one is set aloof.",
        "sentence":"The word عَزَلْتَ comes from the root ع ز ل and is associated with the meanings: to set aside, remove from. ma'zilun - a place separate from the rest, secluded spot, place of retirement, far away. ma'zulun - removed. i'tizal (vb. 8) to separate or remove one self from.. . 'Azalta (prt. 2nd. m. sing.): Thou put aside (in the matter) provisionally.. I'tazala (prf. 3rd. m. sing. VIII): He withdrew, kept away.. I'tazalaa (prf. 3rd. m. plu.): They kept away, left you alone.. I'tazaltumuu (prf.2nd p. m. plu. juss.): You have left (them).. Ya'taziluu (imp. 3rd. m. plu. final Nun dropped): They withdraw, leave (you) alone.. A'tazilu (imp. 1st. sing. VIII): I shall withdraw, shall keep away.. I'taziluu (prt. n. plu.): You keep away.. I'taziluuni (comp. I'tazilu + nii prt. m. plu.): Keep away from me.. Ma'zuuluuna (pct. pic. n. plu.): Removed ones; Precluded ones.. Ma`zilun (n. of place): Place where one is set aloof."
    },

    {
        "indexid":3584,
        "wordid":15521,
        "word":"أَعْيُنُهُنَّ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word أَعْيُنُهُنَّ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":3584,
        "wordid":15522,
        "word":"يَحْزَنَّ",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word يَحْزَنَّ comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":3584,
        "wordid":15523,
        "word":"وَيَرْضَيْنَ",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word وَيَرْضَيْنَ comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":3584,
        "wordid":15524,
        "word":"ءَاتَيْتَهُنَّ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word ءَاتَيْتَهُنَّ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":3584,
        "wordid":15525,
        "word":"كُلُّهُنَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّهُنَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    }]}