{"data":[
    {
        "indexid":3637,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3637,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3637,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3637,
        "wordid":2077,
        "word":"يَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3637,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3637,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":3637,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":3637,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":3637,
        "wordid":2525,
        "word":"نُؤْمِنَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word نُؤْمِنَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3637,
        "wordid":2652,
        "word":"بَيْنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3637,
        "wordid":2736,
        "word":"بَعْضُهُمْ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضُهُمْ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":3637,
        "wordid":2737,
        "word":"بَعْضٍ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضٍ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":3637,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":3637,
        "wordid":2879,
        "word":"مُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word مُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3637,
        "wordid":2917,
        "word":"يَدَيْهِ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word يَدَيْهِ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":3637,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3637,
        "wordid":3984,
        "word":"الظَّالِمُونَ",
        "rootid":434,
        "rootword":"ظ ل م",
        "meanings":"Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]",
        "sentence":"The word الظَّالِمُونَ comes from the root ظ ل م and is associated with the meanings: Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]"
    },

    {
        "indexid":3637,
        "wordid":6992,
        "word":"تَرَى",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word تَرَى comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":3637,
        "wordid":7951,
        "word":"لَكُنَّا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word لَكُنَّا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3637,
        "wordid":8288,
        "word":"اسْتَكْبَرُوا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word اسْتَكْبَرُوا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":3637,
        "wordid":8289,
        "word":"اسْتُضْعِفُوا",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word اسْتُضْعِفُوا comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":3637,
        "wordid":10963,
        "word":"الْقَوْلَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word الْقَوْلَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3637,
        "wordid":11927,
        "word":"الْقُرْءَانِ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانِ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":3637,
        "wordid":13106,
        "word":"يَرْجِعُ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word يَرْجِعُ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":3637,
        "wordid":15689,
        "word":"مَوْقُوفُونَ",
        "rootid":892,
        "rootword":"و ق ف",
        "meanings":"to stand, make someone to stand.",
        "sentence":"The word مَوْقُوفُونَ comes from the root و ق ف and is associated with the meanings: to stand, make someone to stand."
    }]}