{"data":[
    {
        "indexid":3655,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3655,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":3655,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3655,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":3655,
        "wordid":12059,
        "word":"الْبَاطِلُ",
        "rootid":751,
        "rootword":"ب ط ل",
        "meanings":"Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies.",
        "sentence":"The word الْبَاطِلُ comes from the root ب ط ل and is associated with the meanings: Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies."
    },

    {
        "indexid":3655,
        "wordid":15040,
        "word":"يُبْدِئُ",
        "rootid":361,
        "rootword":"ب د ا",
        "meanings":"Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs.",
        "sentence":"The word يُبْدِئُ comes from the root ب د ا and is associated with the meanings: Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs."
    },

    {
        "indexid":3655,
        "wordid":15718,
        "word":"يُعِيدُ",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word يُعِيدُ comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    }]}