{"data":[
    {
        "indexid":3669,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3669,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3669,
        "wordid":2197,
        "word":"الْأَرْضَ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضَ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":3669,
        "wordid":3110,
        "word":"بَعْدَ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدَ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":3669,
        "wordid":3408,
        "word":"مَوْتِهَا",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word مَوْتِهَا comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":3669,
        "wordid":8207,
        "word":"الرِّيَاحَ",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word الرِّيَاحَ comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    },

    {
        "indexid":3669,
        "wordid":8212,
        "word":"سَحَابًا",
        "rootid":684,
        "rootword":"س ح ب",
        "meanings":"to drag, trail, drag along the ground. sahab - cloud.",
        "sentence":"The word سَحَابًا comes from the root س ح ب and is associated with the meanings: to drag, trail, drag along the ground. sahab - cloud."
    },

    {
        "indexid":3669,
        "wordid":8216,
        "word":"مَيِّتٍ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word مَيِّتٍ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":3669,
        "wordid":9233,
        "word":"أَرْسَلَ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word أَرْسَلَ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":3669,
        "wordid":11464,
        "word":"بَلَدٍ",
        "rootid":745,
        "rootword":"ب ل د",
        "meanings":"A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others",
        "sentence":"The word بَلَدٍ comes from the root ب ل د and is associated with the meanings: A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others"
    },

    {
        "indexid":3669,
        "wordid":15191,
        "word":"فَتُثِيرُ",
        "rootid":1717,
        "rootword":"ث و ر",
        "meanings":"to rise and spread in the air (dust), be stirred (quarrel), be kindled (war), rush on, assault anyone, till (the ground). athaara - to plough, break up (the earth). atharana - raising up (clouds of dust).",
        "sentence":"The word فَتُثِيرُ comes from the root ث و ر and is associated with the meanings: to rise and spread in the air (dust), be stirred (quarrel), be kindled (war), rush on, assault anyone, till (the ground). athaara - to plough, break up (the earth). atharana - raising up (clouds of dust)."
    },

    {
        "indexid":3669,
        "wordid":15743,
        "word":"فَسُقْنَاهُ",
        "rootid":542,
        "rootword":"س و ق",
        "meanings":"to drive\/impel\/urge. yusaquna - they are driven or led. saiqun - driver. suq (pl. aswaq) - market, stem, leg, kashafat an saqaiha (27:44) is a well known Arabic idiom meaning to become prepared to meet the difficulty or to become perturbed\/perplexed or taken aback, the literal meaning is \"she uncovered and bared her shanks\". yukshafu an saqin (68:42) means ther eis severe affliction and the truth laid here, it is indicative of a grievous and terrible calamity and difficulty. masaq - the act of driving.",
        "sentence":"The word فَسُقْنَاهُ comes from the root س و ق and is associated with the meanings: to drive\/impel\/urge. yusaquna - they are driven or led. saiqun - driver. suq (pl. aswaq) - market, stem, leg, kashafat an saqaiha (27:44) is a well known Arabic idiom meaning to become prepared to meet the difficulty or to become perturbed\/perplexed or taken aback, the literal meaning is \"she uncovered and bared her shanks\". yukshafu an saqin (68:42) means ther eis severe affliction and the truth laid here, it is indicative of a grievous and terrible calamity and difficulty. masaq - the act of driving."
    },

    {
        "indexid":3669,
        "wordid":15744,
        "word":"فَأَحْيَيْنَا",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word فَأَحْيَيْنَا comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":3669,
        "wordid":15745,
        "word":"النُّشُورُ",
        "rootid":993,
        "rootword":"ن ش ر",
        "meanings":"to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad.",
        "sentence":"The word النُّشُورُ comes from the root ن ش ر and is associated with the meanings: to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad."
    }]}