{"data":[
    {
        "indexid":3696,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3696,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3696,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3696,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3696,
        "wordid":2825,
        "word":"يُخَفَّفُ",
        "rootid":726,
        "rootword":"خ ف ف",
        "meanings":"To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable.",
        "sentence":"The word يُخَفَّفُ comes from the root خ ف ف and is associated with the meanings: To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable."
    },

    {
        "indexid":3696,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3696,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":3696,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":3696,
        "wordid":7564,
        "word":"نَجْزِي",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word نَجْزِي comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":3696,
        "wordid":9475,
        "word":"نَارُ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارُ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":3696,
        "wordid":13174,
        "word":"يُقْضَى",
        "rootid":1066,
        "rootword":"ق ض ي",
        "meanings":"to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal.",
        "sentence":"The word يُقْضَى comes from the root ق ض ي and is associated with the meanings: to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal."
    },

    {
        "indexid":3696,
        "wordid":13614,
        "word":"كَفُورٍ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفُورٍ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3696,
        "wordid":15804,
        "word":"فَيَمُوتُوا",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word فَيَمُوتُوا comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":3696,
        "wordid":15805,
        "word":"عَذَابِهَا",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابِهَا comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    }]}