{"data":[
    {
        "indexid":3718,
        "wordid":2261,
        "word":"مَثَلًا",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مَثَلًا comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":3718,
        "wordid":5939,
        "word":"أَصْحَابَ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word أَصْحَابَ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":3718,
        "wordid":6069,
        "word":"الْقَرْيَةِ",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word الْقَرْيَةِ comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":3718,
        "wordid":11386,
        "word":"الْمُرْسَلُونَ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الْمُرْسَلُونَ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":3718,
        "wordid":12297,
        "word":"وَاضْرِبْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word وَاضْرِبْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":3718,
        "wordid":14562,
        "word":"جَاءَهَا",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَهَا comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    }]}