{"data":[
    {
        "indexid":3727,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3727,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3727,
        "wordid":2295,
        "word":"تُرْجَعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word تُرْجَعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":3727,
        "wordid":4123,
        "word":"وَإِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3727,
        "wordid":9992,
        "word":"أَعْبُدُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word أَعْبُدُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":3727,
        "wordid":10182,
        "word":"فَطَرَنِي",
        "rootid":67,
        "rootword":"ف ط ر",
        "meanings":"to create out of nothing, cleave\/split\/crack\/break, be broken into pieces, cleave asunder, begin to create. fitrat - natural disposition or constitution with which a child is created. The faculty of knowing God and capability of accepting the religion of truth, religion. fatir -creator, one of the names of Allah. futur - crack\/flaw. munfatirun - split one, cloven one, one rent asunder.",
        "sentence":"The word فَطَرَنِي comes from the root ف ط ر and is associated with the meanings: to create out of nothing, cleave\/split\/crack\/break, be broken into pieces, cleave asunder, begin to create. fitrat - natural disposition or constitution with which a child is created. The faculty of knowing God and capability of accepting the religion of truth, religion. fatir -creator, one of the names of Allah. futur - crack\/flaw. munfatirun - split one, cloven one, one rent asunder."
    }]}