{"data":[
    {
        "indexid":3747,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3747,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3747,
        "wordid":2221,
        "word":"مِثْلِهِ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مِثْلِهِ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":3747,
        "wordid":15892,
        "word":"وَخَلَقْنَا",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word وَخَلَقْنَا comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":3747,
        "wordid":15893,
        "word":"يَرْكَبُونَ",
        "rootid":491,
        "rootword":"ر ك ب",
        "meanings":"to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend.",
        "sentence":"The word يَرْكَبُونَ comes from the root ر ك ب and is associated with the meanings: to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend."
    }]}