{"data":[
    {
        "indexid":3771,
        "wordid":2016,
        "word":"الصِّرَاطَ",
        "rootid":451,
        "rootword":"ص ر ط",
        "meanings":"a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword.",
        "sentence":"The word الصِّرَاطَ comes from the root ص ر ط and is associated with the meanings: a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword."
    },

    {
        "indexid":3771,
        "wordid":2149,
        "word":"يُبْصِرُونَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word يُبْصِرُونَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":3771,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":3771,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3771,
        "wordid":8996,
        "word":"أَعْيُنِهِمْ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word أَعْيُنِهِمْ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":3771,
        "wordid":15924,
        "word":"لَطَمَسْنَا",
        "rootid":213,
        "rootword":"ط م س",
        "meanings":"to be effaced, disappear, go far away, destroy, be corrupted, wipe out, obliterate, alter, put out, lose brightness, be remote, blot out the trace of.",
        "sentence":"The word لَطَمَسْنَا comes from the root ط م س and is associated with the meanings: to be effaced, disappear, go far away, destroy, be corrupted, wipe out, obliterate, alter, put out, lose brightness, be remote, blot out the trace of."
    },

    {
        "indexid":3771,
        "wordid":15925,
        "word":"فَاسْتَبَقُوا",
        "rootid":882,
        "rootword":"س ب ق",
        "meanings":"to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race.",
        "sentence":"The word فَاسْتَبَقُوا comes from the root س ب ق and is associated with the meanings: to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race."
    }]}