{"data":[
    {
        "indexid":3781,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3781,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3781,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3781,
        "wordid":2743,
        "word":"يُسِرُّونَ",
        "rootid":478,
        "rootword":"س ر ر",
        "meanings":"glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne.",
        "sentence":"The word يُسِرُّونَ comes from the root س ر ر and is associated with the meanings: glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne."
    },

    {
        "indexid":3781,
        "wordid":2744,
        "word":"يُعْلِنُونَ",
        "rootid":1143,
        "rootword":"ع ل ن",
        "meanings":"to be open\/manifest\/public, become known, reveal.",
        "sentence":"The word يُعْلِنُونَ comes from the root ع ل ن and is associated with the meanings: to be open\/manifest\/public, become known, reveal."
    },

    {
        "indexid":3781,
        "wordid":5390,
        "word":"نَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word نَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3781,
        "wordid":5435,
        "word":"يَحْزُنْكَ",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word يَحْزُنْكَ comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":3781,
        "wordid":9222,
        "word":"قَوْلُهُمْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَوْلُهُمْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    }]}