{"data":[
    {
        "indexid":3785,
        "wordid":2140,
        "word":"نَارًا",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارًا comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":3785,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3785,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":3785,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3785,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":3785,
        "wordid":11605,
        "word":"الشَّجَرِ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word الشَّجَرِ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":3785,
        "wordid":15944,
        "word":"الْأَخْضَرِ",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word الْأَخْضَرِ comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":3785,
        "wordid":15945,
        "word":"تُوقِدُونَ",
        "rootid":421,
        "rootword":"و ق د",
        "meanings":"to set fire, kindle, light fire.",
        "sentence":"The word تُوقِدُونَ comes from the root و ق د and is associated with the meanings: to set fire, kindle, light fire."
    }]}