{"data":[
    {
        "indexid":3795,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3795,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3795,
        "wordid":15955,
        "word":"وَحِفْظًا",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word وَحِفْظًا comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":3795,
        "wordid":15956,
        "word":"مَارِدٍ",
        "rootid":218,
        "rootword":"م ر د",
        "meanings":"To seep or soak bread (or corn) in water, to crumble or soften, rub a thing in water, make a thing soft, to polish a thing, to be beardless or without facial hair (youth or young man), exalt oneself, to be insolent and audacious\/bold, excessively proud or corrupt, extravagant in acts of wrongdoing and disobedience, to be accustomed\/habituated\/inured to a thing, care not for a thing, be destitute of good, to strip or peel a thing, lofty or high, to be brisk\/lively\/sprightly.",
        "sentence":"The word مَارِدٍ comes from the root م ر د and is associated with the meanings: To seep or soak bread (or corn) in water, to crumble or soften, rub a thing in water, make a thing soft, to polish a thing, to be beardless or without facial hair (youth or young man), exalt oneself, to be insolent and audacious\/bold, excessively proud or corrupt, extravagant in acts of wrongdoing and disobedience, to be accustomed\/habituated\/inured to a thing, care not for a thing, be destitute of good, to strip or peel a thing, lofty or high, to be brisk\/lively\/sprightly."
    }]}