{"data":[
    {
        "indexid":3798,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3798,
        "wordid":8717,
        "word":"فَأَتْبَعَهُ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word فَأَتْبَعَهُ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":3798,
        "wordid":11319,
        "word":"شِهَابٌ",
        "rootid":1391,
        "rootword":"ش ه ب",
        "meanings":"to burn\/scorch, become of a colour in which whiteness predominates over blackness. shihaab (pl. shuhub) - flaming fire, bright blaze\/meteor, star, penetrating flame, shining star, brisk\/sprightly, flame, brand, radiating or gleaming fire, shooting or falling star. shihaab al-herb - dauntless warrior, one who is penetrating sharp and energetic in war.",
        "sentence":"The word شِهَابٌ comes from the root ش ه ب and is associated with the meanings: to burn\/scorch, become of a colour in which whiteness predominates over blackness. shihaab (pl. shuhub) - flaming fire, bright blaze\/meteor, star, penetrating flame, shining star, brisk\/sprightly, flame, brand, radiating or gleaming fire, shooting or falling star. shihaab al-herb - dauntless warrior, one who is penetrating sharp and energetic in war."
    },

    {
        "indexid":3798,
        "wordid":15962,
        "word":"خَطِفَ",
        "rootid":563,
        "rootword":"خ ط ف",
        "meanings":"To seize\/take\/carry off a thing by force, take or seize a thing quickly (snatch it away), suddenly take away, move along quickly (quickness in pace or going), cut a thing short (such as a discourse or narrative), barely miss a thing (and also to nearly hit a thing), be lean or lank in the belly (lightness of the flesh of the sides), to be mad or diabolically possessed.",
        "sentence":"The word خَطِفَ comes from the root خ ط ف and is associated with the meanings: To seize\/take\/carry off a thing by force, take or seize a thing quickly (snatch it away), suddenly take away, move along quickly (quickness in pace or going), cut a thing short (such as a discourse or narrative), barely miss a thing (and also to nearly hit a thing), be lean or lank in the belly (lightness of the flesh of the sides), to be mad or diabolically possessed."
    },

    {
        "indexid":3798,
        "wordid":15963,
        "word":"الْخَطْفَةَ",
        "rootid":563,
        "rootword":"خ ط ف",
        "meanings":"To seize\/take\/carry off a thing by force, take or seize a thing quickly (snatch it away), suddenly take away, move along quickly (quickness in pace or going), cut a thing short (such as a discourse or narrative), barely miss a thing (and also to nearly hit a thing), be lean or lank in the belly (lightness of the flesh of the sides), to be mad or diabolically possessed.",
        "sentence":"The word الْخَطْفَةَ comes from the root خ ط ف and is associated with the meanings: To seize\/take\/carry off a thing by force, take or seize a thing quickly (snatch it away), suddenly take away, move along quickly (quickness in pace or going), cut a thing short (such as a discourse or narrative), barely miss a thing (and also to nearly hit a thing), be lean or lank in the belly (lightness of the flesh of the sides), to be mad or diabolically possessed."
    },

    {
        "indexid":3798,
        "wordid":15964,
        "word":"ثَاقِبٌ",
        "rootid":1330,
        "rootword":"ث ق ب",
        "meanings":"a hole, to pass through (a hole), bore\/perforate\/pierce\/puncture, intense (surge), burn\/blaze\/flame brightly (e.g. as if to pierce through the night), ascend\/reach, penetrate, struck\/kindle fire, fuel for fire, a man very red, brilliant (can be applied to knowledge), a drill (instrument which perforates).",
        "sentence":"The word ثَاقِبٌ comes from the root ث ق ب and is associated with the meanings: a hole, to pass through (a hole), bore\/perforate\/pierce\/puncture, intense (surge), burn\/blaze\/flame brightly (e.g. as if to pierce through the night), ascend\/reach, penetrate, struck\/kindle fire, fuel for fire, a man very red, brilliant (can be applied to knowledge), a drill (instrument which perforates)."
    }]}