{"data":[
    {
        "indexid":3807,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":3807,
        "wordid":3795,
        "word":"يَنْظُرُونَ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word يَنْظُرُونَ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":3807,
        "wordid":15972,
        "word":"زَجْرَةٌ",
        "rootid":750,
        "rootword":"ز ج ر",
        "meanings":"To prohibit, drive away, interdict, chide away, cry out, scare away, rebuke, deter, discourage, repel, restrain, chide by a cry, by voice, or by reproof, check him, restrained him, or forbade him, with rough speech: or prevented, hindered, restrained, or withheld, him: or forbade, or prohibited, him [by any kind of cry or speech].",
        "sentence":"The word زَجْرَةٌ comes from the root ز ج ر and is associated with the meanings: To prohibit, drive away, interdict, chide away, cry out, scare away, rebuke, deter, discourage, repel, restrain, chide by a cry, by voice, or by reproof, check him, restrained him, or forbade him, with rough speech: or prevented, hindered, restrained, or withheld, him: or forbade, or prohibited, him [by any kind of cry or speech]."
    },

    {
        "indexid":3807,
        "wordid":15973,
        "word":"وَاحِدَةٌ",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةٌ comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    }]}