{"data":[
    {
        "indexid":3817,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":3817,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3817,
        "wordid":2425,
        "word":"تَكُونُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3817,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":3817,
        "wordid":2879,
        "word":"مُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word مُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    }]}