{"data":[
    {
        "indexid":3824,
        "wordid":4952,
        "word":"وَيَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَيَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3824,
        "wordid":10189,
        "word":"ءَالِهَتِنَا",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word ءَالِهَتِنَا comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3824,
        "wordid":15992,
        "word":"لَتَارِكُوا",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word لَتَارِكُوا comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":3824,
        "wordid":15993,
        "word":"لِشَاعِرٍ",
        "rootid":1335,
        "rootword":"ش ع ر",
        "meanings":"to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to.",
        "sentence":"The word لِشَاعِرٍ comes from the root ش ع ر and is associated with the meanings: to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to."
    },

    {
        "indexid":3824,
        "wordid":15994,
        "word":"مَجْنُونٍ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word مَجْنُونٍ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    }]}