{"data":[
    {
        "indexid":3833,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3833,
        "wordid":16000,
        "word":"يُطَافُ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word يُطَافُ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":3833,
        "wordid":16001,
        "word":"بِكَأْسٍ",
        "rootid":644,
        "rootword":"ك ا س",
        "meanings":"drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha).",
        "sentence":"The word بِكَأْسٍ comes from the root ك ا س and is associated with the meanings: drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha)."
    },

    {
        "indexid":3833,
        "wordid":16002,
        "word":"مَعِينٍ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word مَعِينٍ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    }]}