{"data":[
    {
        "indexid":3834,
        "wordid":11596,
        "word":"لِلشَّارِبِينَ",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word لِلشَّارِبِينَ comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":3834,
        "wordid":12920,
        "word":"بَيْضَاءَ",
        "rootid":445,
        "rootword":"ب ي ض",
        "meanings":"White, becoming whiteSurpassing in whiteness, superiority in whiteness (e.g. whiteness of day\/daylight)An egg of any bird or like an egg (also used metaphorically)Whitening something, bleaching or whitewashingTerritory, place, quarter, tract, region, district, portions that belong to some peopleBulb of the saffron plantContainer or receptaclePrinciple place of abode, seat of power, heart of the kingdomWhite smooth land",
        "sentence":"The word بَيْضَاءَ comes from the root ب ي ض and is associated with the meanings: White, becoming whiteSurpassing in whiteness, superiority in whiteness (e.g. whiteness of day\/daylight)An egg of any bird or like an egg (also used metaphorically)Whitening something, bleaching or whitewashingTerritory, place, quarter, tract, region, district, portions that belong to some peopleBulb of the saffron plantContainer or receptaclePrinciple place of abode, seat of power, heart of the kingdomWhite smooth land"
    },

    {
        "indexid":3834,
        "wordid":16003,
        "word":"لَذَّةٍ",
        "rootid":180,
        "rootword":"ل ذ ذ",
        "meanings":"To be sweet (or savoury), delicious, delightful, pleasant, gratifying the senses, find agreeable, take pleasure\/delight\/enjoyment in.",
        "sentence":"The word لَذَّةٍ comes from the root ل ذ ذ and is associated with the meanings: To be sweet (or savoury), delicious, delightful, pleasant, gratifying the senses, find agreeable, take pleasure\/delight\/enjoyment in."
    }]}