{"data":[
    {
        "indexid":3839,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3839,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3839,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3839,
        "wordid":10456,
        "word":"قَائِلٌ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَائِلٌ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3839,
        "wordid":16014,
        "word":"قَرِينٌ",
        "rootid":1492,
        "rootword":"ق ر ن",
        "meanings":"to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs.",
        "sentence":"The word قَرِينٌ comes from the root ق ر ن and is associated with the meanings: to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs."
    }]}