{"data":[
    {
        "indexid":3844,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3844,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3844,
        "wordid":10785,
        "word":"تَاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word تَاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3844,
        "wordid":12028,
        "word":"كِدْتَ",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word كِدْتَ comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":3844,
        "wordid":16019,
        "word":"لَتُرْدِينِ",
        "rootid":1248,
        "rootword":"ر د ي",
        "meanings":"to perish, fall down, break, knock, blandish, destroy. arda (vb. 4) - to bring to destruction\/ruin. tradda - to fall. mutarddiyatun - that which falls, which is slain by a fall.",
        "sentence":"The word لَتُرْدِينِ comes from the root ر د ي and is associated with the meanings: to perish, fall down, break, knock, blandish, destroy. arda (vb. 4) - to bring to destruction\/ruin. tradda - to fall. mutarddiyatun - that which falls, which is slain by a fall."
    }]}