{"data":[
    {
        "indexid":3852,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3852,
        "wordid":3100,
        "word":"الْجَحِيمِ",
        "rootid":169,
        "rootword":"ج ح م",
        "meanings":"To kindle a fire, make to burn, burn up, burn brightly or fiercly, open the eye, to abstain\/refrain\/desist\/forbear, advance or go forward, recede or draw back [This verb bears contradictory significations], near to destroying or killing, burn with vehemence of desire\/covetousness and niggardliness, straitened in disposition, tenacious or stingy, blazing or flaming, vehemently hot.",
        "sentence":"The word الْجَحِيمِ comes from the root ج ح م and is associated with the meanings: To kindle a fire, make to burn, burn up, burn brightly or fiercly, open the eye, to abstain\/refrain\/desist\/forbear, advance or go forward, recede or draw back [This verb bears contradictory significations], near to destroying or killing, burn with vehemence of desire\/covetousness and niggardliness, straitened in disposition, tenacious or stingy, blazing or flaming, vehemently hot."
    },

    {
        "indexid":3852,
        "wordid":12161,
        "word":"تَخْرُجُ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word تَخْرُجُ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":3852,
        "wordid":16030,
        "word":"شَجَرَةٌ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word شَجَرَةٌ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":3852,
        "wordid":16031,
        "word":"أَصْلِ",
        "rootid":1644,
        "rootword":"ا ص ل",
        "meanings":"to be rooted. asiilan - evening, time before sunset.",
        "sentence":"The word أَصْلِ comes from the root ا ص ل and is associated with the meanings: to be rooted. asiilan - evening, time before sunset."
    }]}