{"data":[
    {
        "indexid":3879,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3879,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3879,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3879,
        "wordid":4829,
        "word":"تَأْكُلُونَ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word تَأْكُلُونَ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":3879,
        "wordid":16050,
        "word":"فَرَاغَ",
        "rootid":1574,
        "rootword":"ر و غ",
        "meanings":"to turn (attention), come, slant, incline.",
        "sentence":"The word فَرَاغَ comes from the root ر و غ and is associated with the meanings: to turn (attention), come, slant, incline."
    },

    {
        "indexid":3879,
        "wordid":16051,
        "word":"ءَالِهَتِهِمْ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word ءَالِهَتِهِمْ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    }]}