{"data":[
    {
        "indexid":389,
        "wordid":2426,
        "word":"أَوَّلَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word أَوَّلَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":389,
        "wordid":2787,
        "word":"لِلنَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word لِلنَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":389,
        "wordid":2918,
        "word":"وَهُدًى",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word وَهُدًى comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":389,
        "wordid":5032,
        "word":"بَيْتٍ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word بَيْتٍ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":389,
        "wordid":5033,
        "word":"وُضِعَ",
        "rootid":1308,
        "rootword":"و ض ع",
        "meanings":"he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing.",
        "sentence":"The word وُضِعَ comes from the root و ض ع and is associated with the meanings: he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing."
    },

    {
        "indexid":389,
        "wordid":5035,
        "word":"بِبَكَّةَ",
        "rootid":1608,
        "rootword":"ب ك ك",
        "meanings":"pounding or crushing (al-&unuqa: (on) the neck) (daqqul-&unuqa), distinguishing\/ranking above others (farraqahu, kharaqahu), jostling, pressing or crowding(crowds:zahm), any crowding(or crowds), competition. (izdihaam) heaping\/piling together\/amassing (taraakib), super-imposition of things on top of other things (taraakim), a man\/male having or the trying to have sex with a female, denial or rejection a thing or person's dignity, to humiliate, cancellation\/dissolution\/breaking, being in need or being stout, muscular or rough from activity, name of a place.",
        "sentence":"The word بِبَكَّةَ comes from the root ب ك ك and is associated with the meanings: pounding or crushing (al-&unuqa: (on) the neck) (daqqul-&unuqa), distinguishing\/ranking above others (farraqahu, kharaqahu), jostling, pressing or crowding(crowds:zahm), any crowding(or crowds), competition. (izdihaam) heaping\/piling together\/amassing (taraakib), super-imposition of things on top of other things (taraakim), a man\/male having or the trying to have sex with a female, denial or rejection a thing or person's dignity, to humiliate, cancellation\/dissolution\/breaking, being in need or being stout, muscular or rough from activity, name of a place."
    },

    {
        "indexid":389,
        "wordid":5036,
        "word":"مُبَارَكًا",
        "rootid":1480,
        "rootword":"ب ر ك",
        "meanings":"Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty.",
        "sentence":"The word مُبَارَكًا comes from the root ب ر ك and is associated with the meanings: Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty."
    },

    {
        "indexid":389,
        "wordid":5037,
        "word":"لِلْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word لِلْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}