{"data":[
    {
        "indexid":3934,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3934,
        "wordid":11321,
        "word":"وَأَنْبَتْنَا",
        "rootid":664,
        "rootword":"ن ب ت",
        "meanings":"to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle.",
        "sentence":"The word وَأَنْبَتْنَا comes from the root ن ب ت and is associated with the meanings: to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle."
    },

    {
        "indexid":3934,
        "wordid":16104,
        "word":"شَجَرَةً",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word شَجَرَةً comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    }]}