{"data":[
    {
        "indexid":3989,
        "wordid":3076,
        "word":"كُلٌّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلٌّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3989,
        "wordid":13393,
        "word":"وَالطَّيْرَ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word وَالطَّيْرَ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":3989,
        "wordid":16173,
        "word":"أَوَّابٌ",
        "rootid":1097,
        "rootword":"ا و ب",
        "meanings":"to come back from, repent, set (stars), repeat, return (from disobedience to obedience), echo, alight at night.",
        "sentence":"The word أَوَّابٌ comes from the root ا و ب and is associated with the meanings: to come back from, repent, set (stars), repeat, return (from disobedience to obedience), echo, alight at night."
    },

    {
        "indexid":3989,
        "wordid":16176,
        "word":"مَحْشُورَةً",
        "rootid":761,
        "rootword":"ح ش ر",
        "meanings":"To gather together, raise from the dead, banish.",
        "sentence":"The word مَحْشُورَةً comes from the root ح ش ر and is associated with the meanings: To gather together, raise from the dead, banish."
    }]}