{"data":[
    {
        "indexid":3990,
        "wordid":4150,
        "word":"مُلْكَهُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مُلْكَهُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":3990,
        "wordid":4379,
        "word":"الْحِكْمَةَ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word الْحِكْمَةَ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":3990,
        "wordid":6842,
        "word":"وَءَاتَيْنَاهُ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word وَءَاتَيْنَاهُ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":3990,
        "wordid":16177,
        "word":"وَشَدَدْنَا",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word وَشَدَدْنَا comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":3990,
        "wordid":16178,
        "word":"وَفَصْلَ",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word وَفَصْلَ comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    },

    {
        "indexid":3990,
        "wordid":16179,
        "word":"الْخِطَابِ",
        "rootid":598,
        "rootword":"خ ط ب",
        "meanings":"To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration.",
        "sentence":"The word الْخِطَابِ comes from the root خ ط ب and is associated with the meanings: To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration."
    }]}