{"data":[
    {
        "indexid":3993,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3993,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3993,
        "wordid":6754,
        "word":"أَخِي",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word أَخِي comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":3993,
        "wordid":15973,
        "word":"وَاحِدَةٌ",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةٌ comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":3993,
        "wordid":16179,
        "word":"الْخِطَابِ",
        "rootid":598,
        "rootword":"خ ط ب",
        "meanings":"To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration.",
        "sentence":"The word الْخِطَابِ comes from the root خ ط ب and is associated with the meanings: To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration."
    },

    {
        "indexid":3993,
        "wordid":16185,
        "word":"تِسْعٌ",
        "rootid":508,
        "rootword":"ت س ع",
        "meanings":"To be the ninth, nine.",
        "sentence":"The word تِسْعٌ comes from the root ت س ع and is associated with the meanings: To be the ninth, nine."
    },

    {
        "indexid":3993,
        "wordid":16186,
        "word":"وَتِسْعُونَ",
        "rootid":508,
        "rootword":"ت س ع",
        "meanings":"To be the ninth, nine.",
        "sentence":"The word وَتِسْعُونَ comes from the root ت س ع and is associated with the meanings: To be the ninth, nine."
    },

    {
        "indexid":3993,
        "wordid":16187,
        "word":"نَعْجَةً",
        "rootid":815,
        "rootword":"ن ع ج",
        "meanings":"to go quickly, be very white, eat the flesh of sheep\/ewe, ewe\/sheep.",
        "sentence":"The word نَعْجَةً comes from the root ن ع ج and is associated with the meanings: to go quickly, be very white, eat the flesh of sheep\/ewe, ewe\/sheep."
    },

    {
        "indexid":3993,
        "wordid":16188,
        "word":"نَعْجَةٌ",
        "rootid":815,
        "rootword":"ن ع ج",
        "meanings":"to go quickly, be very white, eat the flesh of sheep\/ewe, ewe\/sheep.",
        "sentence":"The word نَعْجَةٌ comes from the root ن ع ج and is associated with the meanings: to go quickly, be very white, eat the flesh of sheep\/ewe, ewe\/sheep."
    },

    {
        "indexid":3993,
        "wordid":16189,
        "word":"أَكْفِلْنِيهَا",
        "rootid":139,
        "rootword":"ك ف ل",
        "meanings":"To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety.",
        "sentence":"The word أَكْفِلْنِيهَا comes from the root ك ف ل and is associated with the meanings: To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety."
    },

    {
        "indexid":3993,
        "wordid":16190,
        "word":"وَعَزَّنِي",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word وَعَزَّنِي comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    }]}