{"data":[
    {
        "indexid":4000,
        "wordid":2945,
        "word":"سُلَيْمَانَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word سُلَيْمَانَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":4000,
        "wordid":7558,
        "word":"وَوَهَبْنَا",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word وَوَهَبْنَا comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    },

    {
        "indexid":4000,
        "wordid":8967,
        "word":"نِعْمَ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":4000,
        "wordid":16173,
        "word":"أَوَّابٌ",
        "rootid":1097,
        "rootword":"ا و ب",
        "meanings":"to come back from, repent, set (stars), repeat, return (from disobedience to obedience), echo, alight at night.",
        "sentence":"The word أَوَّابٌ comes from the root ا و ب and is associated with the meanings: to come back from, repent, set (stars), repeat, return (from disobedience to obedience), echo, alight at night."
    },

    {
        "indexid":4000,
        "wordid":16212,
        "word":"الْعَبْدُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word الْعَبْدُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    }]}