{"data":[
    {
        "indexid":4004,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4004,
        "wordid":2945,
        "word":"سُلَيْمَانَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word سُلَيْمَانَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":4004,
        "wordid":6939,
        "word":"وَأَلْقَيْنَا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word وَأَلْقَيْنَا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":4004,
        "wordid":7410,
        "word":"فَتَنَّا",
        "rootid":159,
        "rootword":"ف ت ن",
        "meanings":"to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire.",
        "sentence":"The word فَتَنَّا comes from the root ف ت ن and is associated with the meanings: to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire."
    },

    {
        "indexid":4004,
        "wordid":8566,
        "word":"جَسَدًا",
        "rootid":85,
        "rootword":"ج س د",
        "meanings":"To stick or coagulate to the body, It (blood) stuck, or adhered, It (blood) became dry, [4] It (a garment) was made to stick, or adhere, to the body.",
        "sentence":"The word جَسَدًا comes from the root ج س د and is associated with the meanings: To stick or coagulate to the body, It (blood) stuck, or adhered, It (blood) became dry, [4] It (a garment) was made to stick, or adhere, to the body."
    },

    {
        "indexid":4004,
        "wordid":11044,
        "word":"أَنَابَ",
        "rootid":793,
        "rootword":"ن و ب",
        "meanings":"to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds.",
        "sentence":"The word أَنَابَ comes from the root ن و ب and is associated with the meanings: to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds."
    },

    {
        "indexid":4004,
        "wordid":16224,
        "word":"كُرْسِيِّهِ",
        "rootid":1219,
        "rootword":"ك ر س",
        "meanings":"To found (a building); to gather.",
        "sentence":"The word كُرْسِيِّهِ comes from the root ك ر س and is associated with the meanings: To found (a building); to gather."
    }]}