{"data":[
    {
        "indexid":4029,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4029,
        "wordid":2122,
        "word":"مَعَكُمْ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَكُمْ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":4029,
        "wordid":2408,
        "word":"النَّارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":4029,
        "wordid":16266,
        "word":"فَوْجٌ",
        "rootid":97,
        "rootword":"ف و ج",
        "meanings":"to become fat\/bulky\/corpulent\/large. naqatun fai'jun - a fat and bulky she camel. faujun - collection of persons, party\/troop\/company\/group\/crowd\/band\/army, people to who fallow a leader, host.",
        "sentence":"The word فَوْجٌ comes from the root ف و ج and is associated with the meanings: to become fat\/bulky\/corpulent\/large. naqatun fai'jun - a fat and bulky she camel. faujun - collection of persons, party\/troop\/company\/group\/crowd\/band\/army, people to who fallow a leader, host."
    },

    {
        "indexid":4029,
        "wordid":16267,
        "word":"مُقْتَحِمٌ",
        "rootid":743,
        "rootword":"ق ح م",
        "meanings":"to rush, enter, undertake, attempt (the uphill path), make haste, try, plunge, invade, jump, impel, embark boldly.",
        "sentence":"The word مُقْتَحِمٌ comes from the root ق ح م and is associated with the meanings: to rush, enter, undertake, attempt (the uphill path), make haste, try, plunge, invade, jump, impel, embark boldly."
    },

    {
        "indexid":4029,
        "wordid":16268,
        "word":"مَرْحَبًا",
        "rootid":846,
        "rootword":"ر ح ب",
        "meanings":"to welcome, be ample, be spacious, be wide, be great. marhaban - a form of salutation equivalent to welcome.",
        "sentence":"The word مَرْحَبًا comes from the root ر ح ب and is associated with the meanings: to welcome, be ample, be spacious, be wide, be great. marhaban - a form of salutation equivalent to welcome."
    },

    {
        "indexid":4029,
        "wordid":16269,
        "word":"صَالُوا",
        "rootid":380,
        "rootword":"ص ل ي",
        "meanings":"to warm at the fire, endure heat, to roast\/fry\/broil\/burn.",
        "sentence":"The word صَالُوا comes from the root ص ل ي and is associated with the meanings: to warm at the fire, endure heat, to roast\/fry\/broil\/burn."
    }]}