{"data":[
    {
        "indexid":405,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":405,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":405,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":405,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":405,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":405,
        "wordid":2603,
        "word":"وَضُرِبَتْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word وَضُرِبَتْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":405,
        "wordid":2605,
        "word":"الذِّلَّةُ",
        "rootid":461,
        "rootword":"ذ ل ل",
        "meanings":"to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken.",
        "sentence":"The word الذِّلَّةُ comes from the root ذ ل ل and is associated with the meanings: to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken."
    },

    {
        "indexid":405,
        "wordid":2607,
        "word":"وَبَاءُو",
        "rootid":1076,
        "rootword":"ب و ا",
        "meanings":"returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling.",
        "sentence":"The word وَبَاءُو comes from the root ب و ا and is associated with the meanings: returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling."
    },

    {
        "indexid":405,
        "wordid":2608,
        "word":"بِغَضَبٍ",
        "rootid":523,
        "rootword":"غ ض ب",
        "meanings":"anger\/wrath\/stern, intense\/deep redness",
        "sentence":"The word بِغَضَبٍ comes from the root غ ض ب and is associated with the meanings: anger\/wrath\/stern, intense\/deep redness"
    },

    {
        "indexid":405,
        "wordid":2610,
        "word":"يَكْفُرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word يَكْفُرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":405,
        "wordid":2612,
        "word":"وَيَقْتُلُونَ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word وَيَقْتُلُونَ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":405,
        "wordid":2614,
        "word":"بِغَيْرِ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word بِغَيْرِ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":405,
        "wordid":2616,
        "word":"عَصَوْا",
        "rootid":468,
        "rootword":"ع ص ي",
        "meanings":"to rebel, disobey, oppose, resist, transgress.",
        "sentence":"The word عَصَوْا comes from the root ع ص ي and is associated with the meanings: to rebel, disobey, oppose, resist, transgress."
    },

    {
        "indexid":405,
        "wordid":2617,
        "word":"وَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":405,
        "wordid":2618,
        "word":"يَعْتَدُونَ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word يَعْتَدُونَ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":405,
        "wordid":3318,
        "word":"أَيْنَ",
        "rootid":1460,
        "rootword":"ا ي ن",
        "meanings":"",
        "sentence":"The word أَيْنَ comes from the root ا ي ن and is associated with the meanings: "
    },

    {
        "indexid":405,
        "wordid":4655,
        "word":"حَقٍّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word حَقٍّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":405,
        "wordid":5098,
        "word":"ضُرِبَتْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word ضُرِبَتْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":405,
        "wordid":5099,
        "word":"ثُقِفُوا",
        "rootid":1609,
        "rootword":"ث ق ف",
        "meanings":"to get the better, come upon, find, catch, take, gain the mastery over, be intelligent, skilled, meet, overtake\/overcome.",
        "sentence":"The word ثُقِفُوا comes from the root ث ق ف and is associated with the meanings: to get the better, come upon, find, catch, take, gain the mastery over, be intelligent, skilled, meet, overtake\/overcome."
    },

    {
        "indexid":405,
        "wordid":5100,
        "word":"بِحَبْلٍ",
        "rootid":983,
        "rootword":"ح ب ل",
        "meanings":"tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians).",
        "sentence":"The word بِحَبْلٍ comes from the root ح ب ل and is associated with the meanings: tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians)."
    },

    {
        "indexid":405,
        "wordid":5101,
        "word":"وَحَبْلٍ",
        "rootid":983,
        "rootword":"ح ب ل",
        "meanings":"tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians).",
        "sentence":"The word وَحَبْلٍ comes from the root ح ب ل and is associated with the meanings: tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians)."
    },

    {
        "indexid":405,
        "wordid":5102,
        "word":"الْمَسْكَنَةُ",
        "rootid":14,
        "rootword":"س ك ن",
        "meanings":"to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering.",
        "sentence":"The word الْمَسْكَنَةُ comes from the root س ك ن and is associated with the meanings: to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering."
    },

    {
        "indexid":405,
        "wordid":5103,
        "word":"الْأَنْبِيَاءَ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word الْأَنْبِيَاءَ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    }]}