{"data":[
    {
        "indexid":4066,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4066,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4066,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4066,
        "wordid":2210,
        "word":"أَنْدَادًا",
        "rootid":1111,
        "rootword":"ن د د",
        "meanings":"to flee, run away, defame, divulge (secret). nid - match, a like, opponent, equal, image, idol, compeer, rival, object of adoration to which some or all of Gods qualities are ascribed whether it be conceived as deity in its own right or a saint.",
        "sentence":"The word أَنْدَادًا comes from the root ن د د and is associated with the meanings: to flee, run away, defame, divulge (secret). nid - match, a like, opponent, equal, image, idol, compeer, rival, object of adoration to which some or all of Gods qualities are ascribed whether it be conceived as deity in its own right or a saint."
    },

    {
        "indexid":4066,
        "wordid":2250,
        "word":"قَبْلُ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلُ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":4066,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4066,
        "wordid":2408,
        "word":"النَّارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":4066,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":4066,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4066,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4066,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4066,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4066,
        "wordid":3099,
        "word":"أَصْحَابِ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word أَصْحَابِ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":4066,
        "wordid":3909,
        "word":"يَدْعُوا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word يَدْعُوا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":4066,
        "wordid":4470,
        "word":"رَبَّهُ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4066,
        "wordid":4757,
        "word":"دَعَا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دَعَا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":4066,
        "wordid":5230,
        "word":"مَسَّ",
        "rootid":797,
        "rootword":"م س س",
        "meanings":"To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment.",
        "sentence":"The word مَسَّ comes from the root م س س and is associated with the meanings: To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment."
    },

    {
        "indexid":4066,
        "wordid":6780,
        "word":"سَبِيلِهِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِهِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":4066,
        "wordid":6913,
        "word":"وَجَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":4066,
        "wordid":7883,
        "word":"لِيُضِلَّ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word لِيُضِلَّ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":4066,
        "wordid":9024,
        "word":"نِعْمَةً",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَةً comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":4066,
        "wordid":9713,
        "word":"الْإِنْسَانَ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانَ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":4066,
        "wordid":15168,
        "word":"ضُرٌّ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word ضُرٌّ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":4066,
        "wordid":16305,
        "word":"مُنِيبًا",
        "rootid":793,
        "rootword":"ن و ب",
        "meanings":"to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds.",
        "sentence":"The word مُنِيبًا comes from the root ن و ب and is associated with the meanings: to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds."
    },

    {
        "indexid":4066,
        "wordid":16306,
        "word":"خَوَّلَهُ",
        "rootid":944,
        "rootword":"خ و ل",
        "meanings":"To manage\/govern\/sustain\/tend to one's dependants, to be in possession (owner) of a property or other thing (such as slaves or servants or dependants), having many maternal uncles, perceive or discover, pay frequent attention to or return to time after time, lend a thing to someone, be a keeper or guardian of a thing, a sign or mark or token of good, bestow a gift or confer upon someone, to be or do or produce what is good.",
        "sentence":"The word خَوَّلَهُ comes from the root خ و ل and is associated with the meanings: To manage\/govern\/sustain\/tend to one's dependants, to be in possession (owner) of a property or other thing (such as slaves or servants or dependants), having many maternal uncles, perceive or discover, pay frequent attention to or return to time after time, lend a thing to someone, be a keeper or guardian of a thing, a sign or mark or token of good, bestow a gift or confer upon someone, to be or do or produce what is good."
    },

    {
        "indexid":4066,
        "wordid":16307,
        "word":"نَسِيَ",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word نَسِيَ comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    },

    {
        "indexid":4066,
        "wordid":16308,
        "word":"تَمَتَّعْ",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word تَمَتَّعْ comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":4066,
        "wordid":16309,
        "word":"بِكُفْرِكَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word بِكُفْرِكَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}