{"data":[
    {
        "indexid":411,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":411,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":411,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":411,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":411,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":2451,
        "word":"تَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word تَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":411,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":3092,
        "word":"بَيَّنَّا",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيَّنَّا comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":411,
        "wordid":3861,
        "word":"أَكْبَرُ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word أَكْبَرُ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":411,
        "wordid":4005,
        "word":"تَتَّخِذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word تَتَّخِذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":5120,
        "word":"بِطَانَةً",
        "rootid":378,
        "rootword":"ب ط ن",
        "meanings":"Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward.",
        "sentence":"The word بِطَانَةً comes from the root ب ط ن and is associated with the meanings: Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward."
    },

    {
        "indexid":411,
        "wordid":5121,
        "word":"دُونِكُمْ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِكُمْ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":411,
        "wordid":5123,
        "word":"خَبَالًا",
        "rootid":469,
        "rootword":"خ ب ل",
        "meanings":"To be or become corrupted, unsound, vitiated or disordered in intellect or reason, become possessed or insane, be lost, cut off, deprived of heart or reason. Prevent or hinder from doing a thing. Affliction\/trouble\/difficulty\/distress\/fatigue.Seek to corrupt, render unsound, occasioning to agitation like that of possession or insanity, by disease affecting the reason and thought.Difficulty in people in which they see not happiness.Egregious stupidity or foolishness, heedlessness or weakness of intellect, state of perdition or destruction. Disordered in the legs so as not to know how to walk.Going\/passing\/wasting away, being consumed or destroyed.To lend. Jinn, devil, mankind.",
        "sentence":"The word خَبَالًا comes from the root خ ب ل and is associated with the meanings: To be or become corrupted, unsound, vitiated or disordered in intellect or reason, become possessed or insane, be lost, cut off, deprived of heart or reason. Prevent or hinder from doing a thing. Affliction\/trouble\/difficulty\/distress\/fatigue.Seek to corrupt, render unsound, occasioning to agitation like that of possession or insanity, by disease affecting the reason and thought.Difficulty in people in which they see not happiness.Egregious stupidity or foolishness, heedlessness or weakness of intellect, state of perdition or destruction. Disordered in the legs so as not to know how to walk.Going\/passing\/wasting away, being consumed or destroyed.To lend. Jinn, devil, mankind."
    },

    {
        "indexid":411,
        "wordid":5124,
        "word":"وَدُّوا",
        "rootid":1151,
        "rootword":"و د د",
        "meanings":"to love, wish for, desire, be fond of, will, long.",
        "sentence":"The word وَدُّوا comes from the root و د د and is associated with the meanings: to love, wish for, desire, be fond of, will, long."
    },

    {
        "indexid":411,
        "wordid":5125,
        "word":"عَنِتُّمْ",
        "rootid":1551,
        "rootword":"ع ن ت",
        "meanings":"to meet with difficulty, fall into distress, be overburdened, commit a crime, be spoiled, constrain anyone to do a thing, cause anyone to perish, beat harshly. a'nata - to bring anyone into difficulty, beat roughly, cause annoyance, confuse. anatun - sin\/crime\/mistake\/difficulty.. . 'anitum (prf. 2nd. m. pl.): that which corrupts or distress you, you are overburdened, you fall into distress (3:118, 9:128, 49:7).. a'nata (prf. 3rd. m. sing. vb. IV): he caused distress, subjected to burden (2:220).. a'nata (v. n.): falling in crime (4:25).",
        "sentence":"The word عَنِتُّمْ comes from the root ع ن ت and is associated with the meanings: to meet with difficulty, fall into distress, be overburdened, commit a crime, be spoiled, constrain anyone to do a thing, cause anyone to perish, beat harshly. a'nata - to bring anyone into difficulty, beat roughly, cause annoyance, confuse. anatun - sin\/crime\/mistake\/difficulty.. . 'anitum (prf. 2nd. m. pl.): that which corrupts or distress you, you are overburdened, you fall into distress (3:118, 9:128, 49:7).. a'nata (prf. 3rd. m. sing. vb. IV): he caused distress, subjected to burden (2:220).. a'nata (v. n.): falling in crime (4:25)."
    },

    {
        "indexid":411,
        "wordid":5126,
        "word":"بَدَتِ",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word بَدَتِ comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    },

    {
        "indexid":411,
        "wordid":5127,
        "word":"الْبَغْضَاءُ",
        "rootid":333,
        "rootword":"ب غ ض",
        "meanings":"Becoming hateful, odious or an object of hatredFortune or good fortune, also befalling someoneShowing hatred, hating or hated",
        "sentence":"The word الْبَغْضَاءُ comes from the root ب غ ض and is associated with the meanings: Becoming hateful, odious or an object of hatredFortune or good fortune, also befalling someoneShowing hatred, hating or hated"
    },

    {
        "indexid":411,
        "wordid":5128,
        "word":"أَفْوَاهِهِمْ",
        "rootid":1764,
        "rootword":"ف و ه",
        "meanings":"to pronounce a latter or word, a discourse. famun\/fumun (pl. afwah) - mouth.",
        "sentence":"The word أَفْوَاهِهِمْ comes from the root ف و ه and is associated with the meanings: to pronounce a latter or word, a discourse. famun\/fumun (pl. afwah) - mouth."
    },

    {
        "indexid":411,
        "wordid":5129,
        "word":"تُخْفِي",
        "rootid":1414,
        "rootword":"خ ف ي",
        "meanings":"Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed).",
        "sentence":"The word تُخْفِي comes from the root خ ف ي and is associated with the meanings: Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed)."
    },

    {
        "indexid":411,
        "wordid":5130,
        "word":"صُدُورُهُمْ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word صُدُورُهُمْ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    }]}