{"data":[
    {
        "indexid":4131,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4131,
        "wordid":2777,
        "word":"الْجَنَّةِ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجَنَّةِ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":4131,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4131,
        "wordid":3392,
        "word":"خَالِدِينَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word خَالِدِينَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":4131,
        "wordid":3815,
        "word":"اتَّقَوْا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word اتَّقَوْا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":4131,
        "wordid":5552,
        "word":"رَبَّهُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4131,
        "wordid":7415,
        "word":"سَلَامٌ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word سَلَامٌ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":4131,
        "wordid":16413,
        "word":"وَسِيقَ",
        "rootid":542,
        "rootword":"س و ق",
        "meanings":"to drive\/impel\/urge. yusaquna - they are driven or led. saiqun - driver. suq (pl. aswaq) - market, stem, leg, kashafat an saqaiha (27:44) is a well known Arabic idiom meaning to become prepared to meet the difficulty or to become perturbed\/perplexed or taken aback, the literal meaning is \"she uncovered and bared her shanks\". yukshafu an saqin (68:42) means ther eis severe affliction and the truth laid here, it is indicative of a grievous and terrible calamity and difficulty. masaq - the act of driving.",
        "sentence":"The word وَسِيقَ comes from the root س و ق and is associated with the meanings: to drive\/impel\/urge. yusaquna - they are driven or led. saiqun - driver. suq (pl. aswaq) - market, stem, leg, kashafat an saqaiha (27:44) is a well known Arabic idiom meaning to become prepared to meet the difficulty or to become perturbed\/perplexed or taken aback, the literal meaning is \"she uncovered and bared her shanks\". yukshafu an saqin (68:42) means ther eis severe affliction and the truth laid here, it is indicative of a grievous and terrible calamity and difficulty. masaq - the act of driving."
    },

    {
        "indexid":4131,
        "wordid":16414,
        "word":"زُمَرًا",
        "rootid":373,
        "rootword":"ز م ر",
        "meanings":"a company or congregated body of men, a party in a state of dispersion.",
        "sentence":"The word زُمَرًا comes from the root ز م ر and is associated with the meanings: a company or congregated body of men, a party in a state of dispersion."
    },

    {
        "indexid":4131,
        "wordid":16415,
        "word":"جَاءُوهَا",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءُوهَا comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4131,
        "wordid":16416,
        "word":"أَبْوَابُهَا",
        "rootid":154,
        "rootword":"ب و ب",
        "meanings":"door\/gate, place of entrance, mode\/manner.",
        "sentence":"The word أَبْوَابُهَا comes from the root ب و ب and is associated with the meanings: door\/gate, place of entrance, mode\/manner."
    },

    {
        "indexid":4131,
        "wordid":16417,
        "word":"خَزَنَتُهَا",
        "rootid":264,
        "rootword":"خ ز ن",
        "meanings":"Reposit\/store\/preserve\/guard something in a thing or property, conceal or withhold a thing from someone, become rich\/suffcient after poverty, take the nearest of a thing.",
        "sentence":"The word خَزَنَتُهَا comes from the root خ ز ن and is associated with the meanings: Reposit\/store\/preserve\/guard something in a thing or property, conceal or withhold a thing from someone, become rich\/suffcient after poverty, take the nearest of a thing."
    },

    {
        "indexid":4131,
        "wordid":16418,
        "word":"وَفُتِحَتْ",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word وَفُتِحَتْ comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":4131,
        "wordid":16419,
        "word":"طِبْتُمْ",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word طِبْتُمْ comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":4131,
        "wordid":16420,
        "word":"فَادْخُلُوهَا",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word فَادْخُلُوهَا comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    }]}