{"data":[
    {
        "indexid":4202,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4202,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4202,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4202,
        "wordid":2345,
        "word":"أَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":4202,
        "wordid":4105,
        "word":"تَرَ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word تَرَ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":4202,
        "wordid":10984,
        "word":"يُجَادِلُونَ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word يُجَادِلُونَ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":4202,
        "wordid":16569,
        "word":"يُصْرَفُونَ",
        "rootid":903,
        "rootword":"ص ر ف",
        "meanings":"to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside.",
        "sentence":"The word يُصْرَفُونَ comes from the root ص ر ف and is associated with the meanings: to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside."
    }]}