{"data":[
    {
        "indexid":4215,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4215,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4215,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4215,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":4215,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4215,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4215,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":4215,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4215,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4215,
        "wordid":2758,
        "word":"يَكْسِبُونَ",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word يَكْسِبُونَ comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":4215,
        "wordid":3089,
        "word":"قَبْلِهِمْ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِهِمْ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":4215,
        "wordid":4112,
        "word":"أَكْثَرَ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word أَكْثَرَ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":4215,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4215,
        "wordid":5220,
        "word":"عَاقِبَةُ",
        "rootid":1507,
        "rootword":"ع ق ب",
        "meanings":"to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged.",
        "sentence":"The word عَاقِبَةُ comes from the root ع ق ب and is associated with the meanings: to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged."
    },

    {
        "indexid":4215,
        "wordid":6027,
        "word":"وَأَشَدَّ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word وَأَشَدَّ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":4215,
        "wordid":8170,
        "word":"أَغْنَى",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word أَغْنَى comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":4215,
        "wordid":9410,
        "word":"قُوَّةً",
        "rootid":377,
        "rootword":"ق و ي",
        "meanings":"to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted).",
        "sentence":"The word قُوَّةً comes from the root ق و ي and is associated with the meanings: to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted)."
    },

    {
        "indexid":4215,
        "wordid":10906,
        "word":"أَفَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَفَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":4215,
        "wordid":10907,
        "word":"يَسِيرُوا",
        "rootid":1176,
        "rootword":"س ي ر",
        "meanings":"to go, travel, be current, move, journey. sairun - the act of giving, journey. siratun - state\/condition, make\/form. sayyaratun - company of travellers, caravan",
        "sentence":"The word يَسِيرُوا comes from the root س ي ر and is associated with the meanings: to go, travel, be current, move, journey. sairun - the act of giving, journey. siratun - state\/condition, make\/form. sayyaratun - company of travellers, caravan"
    },

    {
        "indexid":4215,
        "wordid":10908,
        "word":"فَيَنْظُرُوا",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَيَنْظُرُوا comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":4215,
        "wordid":16486,
        "word":"وَءَاثَارًا",
        "rootid":156,
        "rootword":"ا ث ر",
        "meanings":"to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity.",
        "sentence":"The word وَءَاثَارًا comes from the root ا ث ر and is associated with the meanings: to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity."
    }]}