{"data":[
    {
        "indexid":4232,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4232,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4232,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4232,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":4232,
        "wordid":2756,
        "word":"أَيْدِيهِمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word أَيْدِيهِمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":4232,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":4232,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4232,
        "wordid":3243,
        "word":"رَبُّنَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّنَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4232,
        "wordid":3827,
        "word":"جَاءَتْهُمُ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَتْهُمُ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4232,
        "wordid":4207,
        "word":"الرُّسُلُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الرُّسُلُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":4232,
        "wordid":5408,
        "word":"خَلْفِهِمْ",
        "rootid":1232,
        "rootword":"خ ل ف",
        "meanings":"To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar",
        "sentence":"The word خَلْفِهِمْ comes from the root خ ل ف and is associated with the meanings: To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar"
    },

    {
        "indexid":4232,
        "wordid":8034,
        "word":"بَيْنِ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنِ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4232,
        "wordid":8158,
        "word":"كَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":4232,
        "wordid":10014,
        "word":"تَعْبُدُوا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word تَعْبُدُوا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":4232,
        "wordid":11121,
        "word":"أُرْسِلْتُمْ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word أُرْسِلْتُمْ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":4232,
        "wordid":13760,
        "word":"لَأَنْزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word لَأَنْزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":4232,
        "wordid":13761,
        "word":"مَلَائِكَةً",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَائِكَةً comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    }]}