{"data":[
    {
        "indexid":4272,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4272,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4272,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4272,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4272,
        "wordid":2169,
        "word":"مُحِيطٌ",
        "rootid":289,
        "rootword":"ح و ط",
        "meanings":"To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method.",
        "sentence":"The word مُحِيطٌ comes from the root ح و ط and is associated with the meanings: To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method."
    },

    {
        "indexid":4272,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":4272,
        "wordid":2304,
        "word":"بِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word بِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":4272,
        "wordid":10066,
        "word":"مِرْيَةٍ",
        "rootid":897,
        "rootword":"م ر ي",
        "meanings":"To draw forth a thing, to dispute or contend, to doubt.",
        "sentence":"The word مِرْيَةٍ comes from the root م ر ي and is associated with the meanings: To draw forth a thing, to dispute or contend, to doubt."
    },

    {
        "indexid":4272,
        "wordid":16696,
        "word":"لِقَاءِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لِقَاءِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}