{"data":[
    {
        "indexid":4282,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4282,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4282,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4282,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4282,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4282,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4282,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":4282,
        "wordid":4123,
        "word":"وَإِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4282,
        "wordid":4839,
        "word":"رَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4282,
        "wordid":9680,
        "word":"تَوَكَّلْتُ",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word تَوَكَّلْتُ comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":4282,
        "wordid":10326,
        "word":"أُنِيبُ",
        "rootid":793,
        "rootword":"ن و ب",
        "meanings":"to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds.",
        "sentence":"The word أُنِيبُ comes from the root ن و ب and is associated with the meanings: to supply the place of another. anaaba - to repent and turn again and again and consecutively (to God) with sincere deeds."
    },

    {
        "indexid":4282,
        "wordid":16704,
        "word":"اخْتَلَفْتُمْ",
        "rootid":1232,
        "rootword":"خ ل ف",
        "meanings":"To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar",
        "sentence":"The word اخْتَلَفْتُمْ comes from the root خ ل ف and is associated with the meanings: To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar"
    },

    {
        "indexid":4282,
        "wordid":16705,
        "word":"فَحُكْمُهُ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word فَحُكْمُهُ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    }]}