{"data":[
    {
        "indexid":4302,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4302,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4302,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4302,
        "wordid":3217,
        "word":"كَسَبَتْ",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word كَسَبَتْ comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":4302,
        "wordid":5311,
        "word":"أَصَابَكُمْ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word أَصَابَكُمْ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":4302,
        "wordid":5465,
        "word":"أَيْدِيكُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word أَيْدِيكُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":4302,
        "wordid":6310,
        "word":"كَثِيرٍ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرٍ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":4302,
        "wordid":6662,
        "word":"وَيَعْفُوا",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word وَيَعْفُوا comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    },

    {
        "indexid":4302,
        "wordid":16743,
        "word":"مُصِيبَةٍ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word مُصِيبَةٍ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    }]}