{"data":[
    {
        "indexid":4361,
        "wordid":2002,
        "word":"الرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":4361,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4361,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4361,
        "wordid":3565,
        "word":"فَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word فَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":4361,
        "wordid":7040,
        "word":"ذِكْرِ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرِ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":4361,
        "wordid":16014,
        "word":"قَرِينٌ",
        "rootid":1492,
        "rootword":"ق ر ن",
        "meanings":"to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs.",
        "sentence":"The word قَرِينٌ comes from the root ق ر ن and is associated with the meanings: to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs."
    },

    {
        "indexid":4361,
        "wordid":16848,
        "word":"نُقَيِّضْ",
        "rootid":554,
        "rootword":"ق ي ض",
        "meanings":"to break the shell (chicken), be broken, split, hallow, assimilate, assign. qayyada (vb. 2) - to be destined, be assigned, prepare for any one.",
        "sentence":"The word نُقَيِّضْ comes from the root ق ي ض and is associated with the meanings: to break the shell (chicken), be broken, split, hallow, assimilate, assign. qayyada (vb. 2) - to be destined, be assigned, prepare for any one."
    }]}