{"data":[
    {
        "indexid":4363,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4363,
        "wordid":5499,
        "word":"فَبِئْسَ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word فَبِئْسَ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":4363,
        "wordid":6677,
        "word":"جَاءَنَا",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَنَا comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4363,
        "wordid":7265,
        "word":"بَيْنِي",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنِي comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4363,
        "wordid":13005,
        "word":"وَبَيْنَكَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word وَبَيْنَكَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4363,
        "wordid":14982,
        "word":"يَالَيْتَ",
        "rootid":696,
        "rootword":"ل ي ت",
        "meanings":"To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo.",
        "sentence":"The word يَالَيْتَ comes from the root ل ي ت and is associated with the meanings: To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo."
    },

    {
        "indexid":4363,
        "wordid":16850,
        "word":"بُعْدَ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بُعْدَ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":4363,
        "wordid":16851,
        "word":"الْمَشْرِقَيْنِ",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word الْمَشْرِقَيْنِ comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    },

    {
        "indexid":4363,
        "wordid":16852,
        "word":"الْقَرِينُ",
        "rootid":1492,
        "rootword":"ق ر ن",
        "meanings":"to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs.",
        "sentence":"The word الْقَرِينُ comes from the root ق ر ن and is associated with the meanings: to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs."
    }]}