{"data":[
    {
        "indexid":4378,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4378,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":4378,
        "wordid":3839,
        "word":"مَعَهُ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":4378,
        "wordid":4161,
        "word":"الْمَلَائِكَةُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمَلَائِكَةُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":4378,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4378,
        "wordid":12287,
        "word":"ذَهَبٍ",
        "rootid":1657,
        "rootword":"ذ ه ب",
        "meanings":"to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold.",
        "sentence":"The word ذَهَبٍ comes from the root ذ ه ب and is associated with the meanings: to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold."
    },

    {
        "indexid":4378,
        "wordid":14634,
        "word":"أُلْقِيَ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word أُلْقِيَ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":4378,
        "wordid":16871,
        "word":"أَسْوِرَةٌ",
        "rootid":1014,
        "rootword":"س و ر",
        "meanings":"leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure.",
        "sentence":"The word أَسْوِرَةٌ comes from the root س و ر and is associated with the meanings: leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure."
    },

    {
        "indexid":4378,
        "wordid":16872,
        "word":"مُقْتَرِنِينَ",
        "rootid":1492,
        "rootword":"ق ر ن",
        "meanings":"to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs.",
        "sentence":"The word مُقْتَرِنِينَ comes from the root ق ر ن and is associated with the meanings: to join one thing with another, couple. qarnin\/qarnan - generation, century. qarn (dual qarnani, oblique qaraini, plu. qurun) - horn, trumpet. Often used to symbolise strength\/power\/glory. qarunun (pl. qurana) - mate, comrade, intimate companion. muqarranin - bound together. muqrinina - capable of subduing. muqtarinin - those formed in serried ranks, accompanying ones.Dzu al Qarnain (Zulqarnain\/dhul-qarnayn) - the two horned one, one belonging to two century, or two generation, master of two states\/kingdoms. The surname of Cyrus (Darius 1) the ruler of Media and Persia which were combined into a single kingdom under him.Qarun (Korah) - he was fabulously rich and stood high in favour of Pharaohs."
    }]}