{"data":[
    {
        "indexid":4467,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4467,
        "wordid":11369,
        "word":"مُتَقَابِلِينَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word مُتَقَابِلِينَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":4467,
        "wordid":12291,
        "word":"سُنْدُسٍ",
        "rootid":506,
        "rootword":"س ن د س",
        "meanings":"fine silk-brocade (also see siin-nun-dal).",
        "sentence":"The word سُنْدُسٍ comes from the root س ن د س and is associated with the meanings: fine silk-brocade (also see siin-nun-dal)."
    },

    {
        "indexid":4467,
        "wordid":12292,
        "word":"وَإِسْتَبْرَقٍ",
        "rootid":918,
        "rootword":"ب ر ق",
        "meanings":"Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness",
        "sentence":"The word وَإِسْتَبْرَقٍ comes from the root ب ر ق and is associated with the meanings: Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness"
    },

    {
        "indexid":4467,
        "wordid":16959,
        "word":"يَلْبَسُونَ",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word يَلْبَسُونَ comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    }]}