{"data":[
    {
        "indexid":4477,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4477,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4477,
        "wordid":2050,
        "word":"يُوقِنُونَ",
        "rootid":487,
        "rootword":"ي ق ن",
        "meanings":"certainty, surely, of a certainty, to be sure\/certain, to ascertain, one who is certain.",
        "sentence":"The word يُوقِنُونَ comes from the root ي ق ن and is associated with the meanings: certainty, surely, of a certainty, to be sure\/certain, to ascertain, one who is certain."
    },

    {
        "indexid":4477,
        "wordid":2487,
        "word":"وَفِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word وَفِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4477,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4477,
        "wordid":3410,
        "word":"دَابَّةٍ",
        "rootid":1326,
        "rootword":"د ب ب",
        "meanings":"(or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main.",
        "sentence":"The word دَابَّةٍ comes from the root د ب ب and is associated with the meanings: (or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main."
    },

    {
        "indexid":4477,
        "wordid":16968,
        "word":"خَلْقِكُمْ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلْقِكُمْ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":4477,
        "wordid":16969,
        "word":"يَبُثُّ",
        "rootid":1685,
        "rootword":"ب ث ث",
        "meanings":"spread\/dispersed\/scattered, published\/revealed.",
        "sentence":"The word يَبُثُّ comes from the root ب ث ث and is associated with the meanings: spread\/dispersed\/scattered, published\/revealed."
    }]}