{"data":[
    {
        "indexid":448,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":448,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":448,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":448,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":448,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":448,
        "wordid":2810,
        "word":"بِبَعْضِ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بِبَعْضِ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":448,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":448,
        "wordid":3235,
        "word":"تَوَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word تَوَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":448,
        "wordid":3475,
        "word":"غَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":448,
        "wordid":3755,
        "word":"كَسَبُوا",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word كَسَبُوا comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":448,
        "wordid":3940,
        "word":"حَلِيمٌ",
        "rootid":1558,
        "rootword":"ح ل م",
        "meanings":"To dream, have a vision, attain to puberty.",
        "sentence":"The word حَلِيمٌ comes from the root ح ل م and is associated with the meanings: To dream, have a vision, attain to puberty."
    },

    {
        "indexid":448,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":448,
        "wordid":5300,
        "word":"عَفَا",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word عَفَا comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    },

    {
        "indexid":448,
        "wordid":5332,
        "word":"الْتَقَى",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word الْتَقَى comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":448,
        "wordid":5333,
        "word":"الْجَمْعَانِ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word الْجَمْعَانِ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":448,
        "wordid":5334,
        "word":"اسْتَزَلَّهُمُ",
        "rootid":787,
        "rootword":"ز ل ل",
        "meanings":"it moved away or aside, slipped, make a mistake, deficient, pass along \/ transfer.",
        "sentence":"The word اسْتَزَلَّهُمُ comes from the root ز ل ل and is associated with the meanings: it moved away or aside, slipped, make a mistake, deficient, pass along \/ transfer."
    }]}