{"data":[
    {
        "indexid":4551,
        "wordid":2365,
        "word":"الْجَنَّةَ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجَنَّةَ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":4551,
        "wordid":17096,
        "word":"وَيُدْخِلُهُمُ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word وَيُدْخِلُهُمُ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":4551,
        "wordid":17097,
        "word":"عَرَّفَهَا",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word عَرَّفَهَا comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    }]}