{"data":[
    {
        "indexid":4605,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4605,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4605,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":4605,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":4605,
        "wordid":5097,
        "word":"الْأَدْبَارَ",
        "rootid":595,
        "rootword":"د ب ر",
        "meanings":"to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting.",
        "sentence":"The word الْأَدْبَارَ comes from the root د ب ر and is associated with the meanings: to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting."
    },

    {
        "indexid":4605,
        "wordid":5920,
        "word":"وَلِيًّا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word وَلِيًّا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":4605,
        "wordid":5921,
        "word":"نَصِيرًا",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word نَصِيرًا comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":4605,
        "wordid":6339,
        "word":"يَجِدُونَ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word يَجِدُونَ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":4605,
        "wordid":17234,
        "word":"قَاتَلَكُمُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قَاتَلَكُمُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":4605,
        "wordid":17235,
        "word":"لَوَلَّوُا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word لَوَلَّوُا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    }]}