{"data":[
    {
        "indexid":4614,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4614,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4614,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4614,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":4614,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":4614,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4614,
        "wordid":2382,
        "word":"لِبَعْضٍ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word لِبَعْضٍ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":4614,
        "wordid":3247,
        "word":"أَعْمَالُكُمْ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالُكُمْ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":4614,
        "wordid":3348,
        "word":"تَشْعُرُونَ",
        "rootid":1335,
        "rootword":"ش ع ر",
        "meanings":"to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to.",
        "sentence":"The word تَشْعُرُونَ comes from the root ش ع ر and is associated with the meanings: to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to."
    },

    {
        "indexid":4614,
        "wordid":4865,
        "word":"فَوْقَ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":4614,
        "wordid":8646,
        "word":"النَّبِيِّ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word النَّبِيِّ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":4614,
        "wordid":11196,
        "word":"بِالْقَوْلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word بِالْقَوْلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4614,
        "wordid":14168,
        "word":"بَعْضِكُمْ",
        "rootid":682,
        "rootword":"ب ع ض",
        "meanings":"Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone.",
        "sentence":"The word بَعْضِكُمْ comes from the root ب ع ض and is associated with the meanings: Gnats, mosquitoes, bitten, annoyed or molested by gnats or mosquitoesDividing into parts or portions, which are distinct or separate from each otherPart or portionSomething or someoneAn impossible or difficult thing imposed on someone."
    },

    {
        "indexid":4614,
        "wordid":17275,
        "word":"تَرْفَعُوا",
        "rootid":249,
        "rootword":"ر ف ع",
        "meanings":"to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc.",
        "sentence":"The word تَرْفَعُوا comes from the root ر ف ع and is associated with the meanings: to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc."
    },

    {
        "indexid":4614,
        "wordid":17276,
        "word":"أَصْوَاتَكُمْ",
        "rootid":79,
        "rootword":"ص و ت",
        "meanings":"to emit a sound, utter a cry. saut (pl. aswat) - voice, sound.",
        "sentence":"The word أَصْوَاتَكُمْ comes from the root ص و ت and is associated with the meanings: to emit a sound, utter a cry. saut (pl. aswat) - voice, sound."
    },

    {
        "indexid":4614,
        "wordid":17277,
        "word":"صَوْتِ",
        "rootid":79,
        "rootword":"ص و ت",
        "meanings":"to emit a sound, utter a cry. saut (pl. aswat) - voice, sound.",
        "sentence":"The word صَوْتِ comes from the root ص و ت and is associated with the meanings: to emit a sound, utter a cry. saut (pl. aswat) - voice, sound."
    },

    {
        "indexid":4614,
        "wordid":17278,
        "word":"تَجْهَرُوا",
        "rootid":1244,
        "rootword":"ج ه ر",
        "meanings":"become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass",
        "sentence":"The word تَجْهَرُوا comes from the root ج ه ر and is associated with the meanings: become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass"
    },

    {
        "indexid":4614,
        "wordid":17279,
        "word":"كَجَهْرِ",
        "rootid":1244,
        "rootword":"ج ه ر",
        "meanings":"become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass",
        "sentence":"The word كَجَهْرِ comes from the root ج ه ر and is associated with the meanings: become plain\/open\/apparent\/public\/loud\/discovered, become great\/bulky, pleasingness\/goodliness, clear out nearly\/entirely, strove to overcome\/surpass"
    },

    {
        "indexid":4614,
        "wordid":17280,
        "word":"تَحْبَطَ",
        "rootid":1345,
        "rootword":"ح ب ط",
        "meanings":"To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective.",
        "sentence":"The word تَحْبَطَ comes from the root ح ب ط and is associated with the meanings: To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective."
    }]}