{"data":[
    {
        "indexid":4647,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4647,
        "wordid":7041,
        "word":"وَعَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word وَعَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4647,
        "wordid":11551,
        "word":"الْيَمِينِ",
        "rootid":114,
        "rootword":"ي م ن",
        "meanings":"right side, right, right hand, oath.",
        "sentence":"The word الْيَمِينِ comes from the root ي م ن and is associated with the meanings: right side, right, right hand, oath."
    },

    {
        "indexid":4647,
        "wordid":12200,
        "word":"الشِّمَالِ",
        "rootid":887,
        "rootword":"ش م ل",
        "meanings":"to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths.",
        "sentence":"The word الشِّمَالِ comes from the root ش م ل and is associated with the meanings: to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths."
    },

    {
        "indexid":4647,
        "wordid":17366,
        "word":"يَتَلَقَّى",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word يَتَلَقَّى comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":4647,
        "wordid":17367,
        "word":"الْمُتَلَقِّيَانِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word الْمُتَلَقِّيَانِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":4647,
        "wordid":17368,
        "word":"قَعِيدٌ",
        "rootid":1162,
        "rootword":"ق ع د",
        "meanings":"to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment.",
        "sentence":"The word قَعِيدٌ comes from the root ق ع د and is associated with the meanings: to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment."
    }]}