{"data":[
    {
        "indexid":4649,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4649,
        "wordid":2167,
        "word":"الْمَوْتِ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتِ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":4649,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4649,
        "wordid":2692,
        "word":"بِالْحَقِّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word بِالْحَقِّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":4649,
        "wordid":3270,
        "word":"كُنْتَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4649,
        "wordid":10500,
        "word":"وَجَاءَتْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word وَجَاءَتْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4649,
        "wordid":17372,
        "word":"سَكْرَةُ",
        "rootid":667,
        "rootword":"س ك ر",
        "meanings":"intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar.",
        "sentence":"The word سَكْرَةُ comes from the root س ك ر and is associated with the meanings: intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar."
    },

    {
        "indexid":4649,
        "wordid":17373,
        "word":"تَحِيدُ",
        "rootid":926,
        "rootword":"ح ي د",
        "meanings":"(Ha-Alif-Dal) To deviate, remove, avoid, turn aside, shun, stray from, avert.",
        "sentence":"The word تَحِيدُ comes from the root ح ي د and is associated with the meanings: (Ha-Alif-Dal) To deviate, remove, avoid, turn aside, shun, stray from, avert."
    }]}