{"data":[
    {
        "indexid":4652,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4652,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4652,
        "wordid":3102,
        "word":"عَنْكَ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْكَ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4652,
        "wordid":3270,
        "word":"كُنْتَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4652,
        "wordid":4176,
        "word":"الْيَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word الْيَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":4652,
        "wordid":5377,
        "word":"لَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word لَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4652,
        "wordid":12734,
        "word":"غَفْلَةٍ",
        "rootid":921,
        "rootword":"غ ف ل",
        "meanings":"unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away",
        "sentence":"The word غَفْلَةٍ comes from the root غ ف ل and is associated with the meanings: unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away"
    },

    {
        "indexid":4652,
        "wordid":13404,
        "word":"فَكَشَفْنَا",
        "rootid":268,
        "rootword":"ك ش ف",
        "meanings":"To pull away, remove, take off, open up, lay open lay base, uncover.",
        "sentence":"The word فَكَشَفْنَا comes from the root ك ش ف and is associated with the meanings: To pull away, remove, take off, open up, lay open lay base, uncover."
    },

    {
        "indexid":4652,
        "wordid":17378,
        "word":"فَبَصَرُكَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word فَبَصَرُكَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":4652,
        "wordid":17379,
        "word":"حَدِيدٌ",
        "rootid":862,
        "rootword":"ح د د",
        "meanings":"To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen.",
        "sentence":"The word حَدِيدٌ comes from the root ح د د and is associated with the meanings: To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen."
    }]}