{"data":[
    {
        "indexid":4670,
        "wordid":2074,
        "word":"وَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4670,
        "wordid":3144,
        "word":"السُّجُودِ",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word السُّجُودِ comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":4670,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":4670,
        "wordid":17404,
        "word":"فَسَبِّحْهُ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word فَسَبِّحْهُ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":4670,
        "wordid":17405,
        "word":"وَأَدْبَارَ",
        "rootid":595,
        "rootword":"د ب ر",
        "meanings":"to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting.",
        "sentence":"The word وَأَدْبَارَ comes from the root د ب ر and is associated with the meanings: to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting."
    }]}