{"data":[
    {
        "indexid":4692,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4692,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4692,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4692,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":4692,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":4692,
        "wordid":17432,
        "word":"يَهْجَعُونَ",
        "rootid":1099,
        "rootword":"ه ج ع",
        "meanings":"to sleep and slumber at night calmly and quietly.",
        "sentence":"The word يَهْجَعُونَ comes from the root ه ج ع and is associated with the meanings: to sleep and slumber at night calmly and quietly."
    }]}