{"data":[
    {
        "indexid":4706,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4706,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4706,
        "wordid":6389,
        "word":"أَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word أَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":4706,
        "wordid":11385,
        "word":"خَطْبُكُمْ",
        "rootid":598,
        "rootword":"خ ط ب",
        "meanings":"To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration.",
        "sentence":"The word خَطْبُكُمْ comes from the root خ ط ب and is associated with the meanings: To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration."
    },

    {
        "indexid":4706,
        "wordid":11386,
        "word":"الْمُرْسَلُونَ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الْمُرْسَلُونَ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    }]}