{"data":[
    {
        "indexid":4709,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":4709,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4709,
        "wordid":9722,
        "word":"لِلْمُسْرِفِينَ",
        "rootid":1696,
        "rootword":"س ر ف",
        "meanings":"to eat away, excess, suckle (a child), be ignorant, be unmindful\/heedless, exceed the undue bounds or just limits, commit many faults\/offences\/crimes\/sins. asrafa - to squander one's wealth, act immoderately, be prodigal, extravagant, transgress. musrif - one who is wasteful.",
        "sentence":"The word لِلْمُسْرِفِينَ comes from the root س ر ف and is associated with the meanings: to eat away, excess, suckle (a child), be ignorant, be unmindful\/heedless, exceed the undue bounds or just limits, commit many faults\/offences\/crimes\/sins. asrafa - to squander one's wealth, act immoderately, be prodigal, extravagant, transgress. musrif - one who is wasteful."
    },

    {
        "indexid":4709,
        "wordid":10306,
        "word":"مُسَوَّمَةً",
        "rootid":782,
        "rootword":"س و م",
        "meanings":"to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture.",
        "sentence":"The word مُسَوَّمَةً comes from the root س و م and is associated with the meanings: to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture."
    }]}