{"data":[
    {
        "indexid":4711,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4711,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4711,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4711,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":4711,
        "wordid":5032,
        "word":"بَيْتٍ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word بَيْتٍ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":4711,
        "wordid":7100,
        "word":"وَجَدْنَا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word وَجَدْنَا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":4711,
        "wordid":7981,
        "word":"الْمُسْلِمِينَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word الْمُسْلِمِينَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    }]}