{"data":[
    {
        "indexid":4759,
        "wordid":16012,
        "word":"مَكْنُونٌ",
        "rootid":15,
        "rootword":"ك ن ن",
        "meanings":"To cover, conceal, keep secret, keep from site, hidden, refuge, veil\/covering",
        "sentence":"The word مَكْنُونٌ comes from the root ك ن ن and is associated with the meanings: To cover, conceal, keep secret, keep from site, hidden, refuge, veil\/covering"
    },

    {
        "indexid":4759,
        "wordid":17511,
        "word":"وَيَطُوفُ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word وَيَطُوفُ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":4759,
        "wordid":17512,
        "word":"غِلْمَانٌ",
        "rootid":438,
        "rootword":"غ ل م",
        "meanings":"excited with lust, stirred up, tumultuous, period from birth to the seventeenth year, youth, young man",
        "sentence":"The word غِلْمَانٌ comes from the root غ ل م and is associated with the meanings: excited with lust, stirred up, tumultuous, period from birth to the seventeenth year, youth, young man"
    },

    {
        "indexid":4759,
        "wordid":17513,
        "word":"لُؤْلُؤٌ",
        "rootid":946,
        "rootword":"ل ا ل ا",
        "meanings":"To shine, glitter, blaze, be bright, pearl, a perfect\/complete rejoicing.",
        "sentence":"The word لُؤْلُؤٌ comes from the root ل ا ل ا and is associated with the meanings: To shine, glitter, blaze, be bright, pearl, a perfect\/complete rejoicing."
    }]}