{"data":[
    {
        "indexid":4798,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":4798,
        "wordid":17557,
        "word":"سِدْرَةِ",
        "rootid":251,
        "rootword":"س د ر",
        "meanings":"to rend (a garment), hang or let down a garment, lose (one's hair), be dazzled\/confounded\/perplexed, be dazzled by a thing at which one looked.. sidratun - Lote-tree. when the shade of lote-tree becomes dense and crowded it is very pleasant and in the hot and dry climate of Arabia the tired and fatigued travelers take shelter and find rest under it and thus it is made to serve as a parable for the shade of paradise and its blessings on account of the ampleness of its shadow. The qualification of sidrah by the word al-muntaha shows that it is a place beyond which human knowledge does not go.",
        "sentence":"The word سِدْرَةِ comes from the root س د ر and is associated with the meanings: to rend (a garment), hang or let down a garment, lose (one's hair), be dazzled\/confounded\/perplexed, be dazzled by a thing at which one looked.. sidratun - Lote-tree. when the shade of lote-tree becomes dense and crowded it is very pleasant and in the hot and dry climate of Arabia the tired and fatigued travelers take shelter and find rest under it and thus it is made to serve as a parable for the shade of paradise and its blessings on account of the ampleness of its shadow. The qualification of sidrah by the word al-muntaha shows that it is a place beyond which human knowledge does not go."
    },

    {
        "indexid":4798,
        "wordid":17558,
        "word":"الْمُنْتَهَى",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word الْمُنْتَهَى comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    }]}