{"data":[
    {
        "indexid":4853,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4853,
        "wordid":8166,
        "word":"أَبْصَارُهُمْ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word أَبْصَارُهُمْ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":4853,
        "wordid":15903,
        "word":"الْأَجْدَاثِ",
        "rootid":340,
        "rootword":"ج د ث",
        "meanings":"Make for oneself a grave or sepulchre; a grave or sepulchre.",
        "sentence":"The word الْأَجْدَاثِ comes from the root ج د ث and is associated with the meanings: Make for oneself a grave or sepulchre; a grave or sepulchre."
    },

    {
        "indexid":4853,
        "wordid":17635,
        "word":"خُشَّعًا",
        "rootid":1458,
        "rootword":"خ ش ع",
        "meanings":"Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful.",
        "sentence":"The word خُشَّعًا comes from the root خ ش ع and is associated with the meanings: Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful."
    },

    {
        "indexid":4853,
        "wordid":17636,
        "word":"يَخْرُجُونَ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word يَخْرُجُونَ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":4853,
        "wordid":17637,
        "word":"جَرَادٌ",
        "rootid":1072,
        "rootword":"ج ر د",
        "meanings":"Strip\/divest\/denude a thing or person, pull off or remove a thing, to peel a thing off, prune or bare a thing, unsheath or draw forth (a sword), detach a thing, perform a rite or ceremony, take from someone against his will, devote or apply oneself diligently and exclusively.",
        "sentence":"The word جَرَادٌ comes from the root ج ر د and is associated with the meanings: Strip\/divest\/denude a thing or person, pull off or remove a thing, to peel a thing off, prune or bare a thing, unsheath or draw forth (a sword), detach a thing, perform a rite or ceremony, take from someone against his will, devote or apply oneself diligently and exclusively."
    },

    {
        "indexid":4853,
        "wordid":17638,
        "word":"مُنْتَشِرٌ",
        "rootid":993,
        "rootword":"ن ش ر",
        "meanings":"to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad.",
        "sentence":"The word مُنْتَشِرٌ comes from the root ن ش ر and is associated with the meanings: to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad."
    }]}