{"data":[
    {
        "indexid":4866,
        "wordid":2444,
        "word":"النَّاسَ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسَ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":4866,
        "wordid":17659,
        "word":"تَنْزِعُ",
        "rootid":817,
        "rootword":"ن ز ع",
        "meanings":"to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive.",
        "sentence":"The word تَنْزِعُ comes from the root ن ز ع and is associated with the meanings: to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive."
    },

    {
        "indexid":4866,
        "wordid":17660,
        "word":"أَعْجَازُ",
        "rootid":453,
        "rootword":"ع ج ز",
        "meanings":"to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. ",
        "sentence":"The word أَعْجَازُ comes from the root ع ج ز and is associated with the meanings: to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. "
    },

    {
        "indexid":4866,
        "wordid":17661,
        "word":"نَخْلٍ",
        "rootid":1547,
        "rootword":"ن خ ل",
        "meanings":"to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice.",
        "sentence":"The word نَخْلٍ comes from the root ن خ ل and is associated with the meanings: to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice."
    },

    {
        "indexid":4866,
        "wordid":17662,
        "word":"مُنْقَعِرٍ",
        "rootid":1757,
        "rootword":"ق ع ر",
        "meanings":"to dig deep, descend, sink, reach the bottom, cut empty, cut from the root, crush. taqa'ara - to be hollow, deep, felled. inqa'ara - to be uprooted. munqa'ir - that which is torn up by the roots, uprooted one, uprooted and hallowed.",
        "sentence":"The word مُنْقَعِرٍ comes from the root ق ع ر and is associated with the meanings: to dig deep, descend, sink, reach the bottom, cut empty, cut from the root, crush. taqa'ara - to be hollow, deep, felled. inqa'ara - to be uprooted. munqa'ir - that which is torn up by the roots, uprooted one, uprooted and hallowed."
    }]}