{"data":[
    {
        "indexid":4882,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4882,
        "wordid":17663,
        "word":"بِالنُّذُرِ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word بِالنُّذُرِ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":4882,
        "wordid":17684,
        "word":"أَنْذَرَهُمْ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word أَنْذَرَهُمْ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":4882,
        "wordid":17685,
        "word":"بَطْشَتَنَا",
        "rootid":518,
        "rootword":"ب ط ش",
        "meanings":"An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault",
        "sentence":"The word بَطْشَتَنَا comes from the root ب ط ش and is associated with the meanings: An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault"
    },

    {
        "indexid":4882,
        "wordid":17686,
        "word":"فَتَمَارَوْا",
        "rootid":897,
        "rootword":"م ر ي",
        "meanings":"To draw forth a thing, to dispute or contend, to doubt.",
        "sentence":"The word فَتَمَارَوْا comes from the root م ر ي and is associated with the meanings: To draw forth a thing, to dispute or contend, to doubt."
    }]}