{"data":[
    {
        "indexid":4883,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4883,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4883,
        "wordid":5082,
        "word":"فَذُوقُوا",
        "rootid":1121,
        "rootword":"ذ و ق",
        "meanings":"to taste\/experience\/try\/perceive. One who tastes, cause to taste.",
        "sentence":"The word فَذُوقُوا comes from the root ذ و ق and is associated with the meanings: to taste\/experience\/try\/perceive. One who tastes, cause to taste."
    },

    {
        "indexid":4883,
        "wordid":7005,
        "word":"أَعْيُنَهُمْ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word أَعْيُنَهُمْ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":4883,
        "wordid":8622,
        "word":"عَذَابِي",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابِي comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":4883,
        "wordid":17654,
        "word":"وَنُذُرِ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word وَنُذُرِ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":4883,
        "wordid":17687,
        "word":"رَاوَدُوهُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word رَاوَدُوهُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":4883,
        "wordid":17688,
        "word":"ضَيْفِهِ",
        "rootid":394,
        "rootword":"ض ي ف",
        "meanings":"Inclined, approached, drew near to setting (said of the sun). Menstruation (said of a woman). Become a guest, refuge of someone. Become correlative to something. Correlation, or reciprocal correlation, so that one cannot be conceived in the mind without the other. Beign collected, joined, added together.Ran, hastened, fled, sped, turned away.Beset by distress of mind. Hardship, difficulty, or distress.Asking, or calling, for an aid.",
        "sentence":"The word ضَيْفِهِ comes from the root ض ي ف and is associated with the meanings: Inclined, approached, drew near to setting (said of the sun). Menstruation (said of a woman). Become a guest, refuge of someone. Become correlative to something. Correlation, or reciprocal correlation, so that one cannot be conceived in the mind without the other. Beign collected, joined, added together.Ran, hastened, fled, sped, turned away.Beset by distress of mind. Hardship, difficulty, or distress.Asking, or calling, for an aid."
    },

    {
        "indexid":4883,
        "wordid":17689,
        "word":"فَطَمَسْنَا",
        "rootid":213,
        "rootword":"ط م س",
        "meanings":"to be effaced, disappear, go far away, destroy, be corrupted, wipe out, obliterate, alter, put out, lose brightness, be remote, blot out the trace of.",
        "sentence":"The word فَطَمَسْنَا comes from the root ط م س and is associated with the meanings: to be effaced, disappear, go far away, destroy, be corrupted, wipe out, obliterate, alter, put out, lose brightness, be remote, blot out the trace of."
    }]}