{"data":[
    {
        "indexid":4884,
        "wordid":2072,
        "word":"عَذَابٌ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابٌ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":4884,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4884,
        "wordid":12641,
        "word":"بُكْرَةً",
        "rootid":99,
        "rootword":"ب ك ر",
        "meanings":"Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception",
        "sentence":"The word بُكْرَةً comes from the root ب ك ر and is associated with the meanings: Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception"
    },

    {
        "indexid":4884,
        "wordid":17629,
        "word":"مُسْتَقِرٌّ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word مُسْتَقِرٌّ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":4884,
        "wordid":17690,
        "word":"صَبَّحَهُمْ",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word صَبَّحَهُمْ comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    }]}