{"data":[
    {
        "indexid":4889,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4889,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":4889,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4889,
        "wordid":2520,
        "word":"خَيْرٌ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرٌ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":4889,
        "wordid":9098,
        "word":"بَرَاءَةٌ",
        "rootid":306,
        "rootword":"ب ر ا",
        "meanings":"became\/was clear\/free of a thing, to quit it, become irresponsible for it, guiltless of it, remove oneself from a thing, kept far or aloof (e.g. from unclean things), state of freedom\/immunity\/security\/safety.Convalescent\/sound\/healthy, cure\/heal, recover\/restore.Create\/produce, former\/fashioner.He compounded or made a compromise with him for their mutual separation.Mankind\/creation\/beings\/things that are created.",
        "sentence":"The word بَرَاءَةٌ comes from the root ب ر ا and is associated with the meanings: became\/was clear\/free of a thing, to quit it, become irresponsible for it, guiltless of it, remove oneself from a thing, kept far or aloof (e.g. from unclean things), state of freedom\/immunity\/security\/safety.Convalescent\/sound\/healthy, cure\/heal, recover\/restore.Create\/produce, former\/fashioner.He compounded or made a compromise with him for their mutual separation.Mankind\/creation\/beings\/things that are created."
    },

    {
        "indexid":4889,
        "wordid":17695,
        "word":"أَكُفَّارُكُمْ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word أَكُفَّارُكُمْ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":4889,
        "wordid":17696,
        "word":"أُولَئِكُمْ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكُمْ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":4889,
        "wordid":17697,
        "word":"الزُّبُرِ",
        "rootid":351,
        "rootword":"ز ب ر",
        "meanings":"case the well, wall internally, construction of one part above another, check\/restrain\/forbade, prevented\/hindered\/witheld, write well\/skillfully\/firmly, read\/recite, become large\/courageous\/brave (man), came forth, stones, understanding\/restraint\/intellect, a thing written, psalms, Book of David, books of Moses\/David\/Muhammad together, piece of iron, anvil, upper part of the back, strong\/bulky, black mud.",
        "sentence":"The word الزُّبُرِ comes from the root ز ب ر and is associated with the meanings: case the well, wall internally, construction of one part above another, check\/restrain\/forbade, prevented\/hindered\/witheld, write well\/skillfully\/firmly, read\/recite, become large\/courageous\/brave (man), came forth, stones, understanding\/restraint\/intellect, a thing written, psalms, Book of David, books of Moses\/David\/Muhammad together, piece of iron, anvil, upper part of the back, strong\/bulky, black mud."
    }]}