{"data":[
    {
        "indexid":4913,
        "wordid":2989,
        "word":"ذُو",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذُو comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":4913,
        "wordid":17732,
        "word":"وَالْحَبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word وَالْحَبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":4913,
        "wordid":17733,
        "word":"الْعَصْفِ",
        "rootid":568,
        "rootword":"ع ص ف",
        "meanings":"to blow violently (wind), blow in a gale, be quick, rag swiftly. asfun - leaves and stalks, straw, green, crop, bladder, stubbles, husk. asafa - to cut corn when green, AAasafa - to perish. asifatun - storm, whirlwind, hurricane. asifun - violent wind, stormy, vehement.",
        "sentence":"The word الْعَصْفِ comes from the root ع ص ف and is associated with the meanings: to blow violently (wind), blow in a gale, be quick, rag swiftly. asfun - leaves and stalks, straw, green, crop, bladder, stubbles, husk. asafa - to cut corn when green, AAasafa - to perish. asifatun - storm, whirlwind, hurricane. asifun - violent wind, stormy, vehement."
    },

    {
        "indexid":4913,
        "wordid":17734,
        "word":"وَالرَّيْحَانُ",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word وَالرَّيْحَانُ comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    }]}