{"data":[
    {
        "indexid":495,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":495,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":495,
        "wordid":2438,
        "word":"وَءَاتُوا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word وَءَاتُوا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":495,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":495,
        "wordid":3628,
        "word":"تَأْكُلُوا",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word تَأْكُلُوا comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":495,
        "wordid":3889,
        "word":"الْيَتَامَى",
        "rootid":1001,
        "rootword":"ي ت م",
        "meanings":"orphan",
        "sentence":"The word الْيَتَامَى comes from the root ي ت م and is associated with the meanings: orphan"
    },

    {
        "indexid":495,
        "wordid":4310,
        "word":"أَمْوَالَهُمْ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word أَمْوَالَهُمْ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":495,
        "wordid":4366,
        "word":"الْخَبِيثَ",
        "rootid":1060,
        "rootword":"خ ب ث",
        "meanings":"bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil.",
        "sentence":"The word الْخَبِيثَ comes from the root خ ب ث and is associated with the meanings: bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil."
    },

    {
        "indexid":495,
        "wordid":4448,
        "word":"أَمْوَالِكُمْ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word أَمْوَالِكُمْ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":495,
        "wordid":4496,
        "word":"كَبِيرًا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرًا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":495,
        "wordid":5568,
        "word":"تَتَبَدَّلُوا",
        "rootid":1238,
        "rootword":"ب د ل",
        "meanings":"changing\/altering -> with or without substitution, replacing\/exchanging.",
        "sentence":"The word تَتَبَدَّلُوا comes from the root ب د ل and is associated with the meanings: changing\/altering -> with or without substitution, replacing\/exchanging."
    },

    {
        "indexid":495,
        "wordid":5569,
        "word":"بِالطَّيِّبِ",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word بِالطَّيِّبِ comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":495,
        "wordid":5570,
        "word":"حُوبًا",
        "rootid":336,
        "rootword":"ح و ب",
        "meanings":"(Ha-Alif-Ba) To transgress, commit a sin, do what is unlawful.",
        "sentence":"The word حُوبًا comes from the root ح و ب and is associated with the meanings: (Ha-Alif-Ba) To transgress, commit a sin, do what is unlawful."
    }]}