{"data":[
    {
        "indexid":4953,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4953,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":4953,
        "wordid":3880,
        "word":"فِيهِمَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِمَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4953,
        "wordid":16963,
        "word":"فَاكِهَةٍ",
        "rootid":1009,
        "rootword":"ف ك ه",
        "meanings":"became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration.",
        "sentence":"The word فَاكِهَةٍ comes from the root ف ك ه and is associated with the meanings: became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration."
    },

    {
        "indexid":4953,
        "wordid":17778,
        "word":"زَوْجَانِ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word زَوْجَانِ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    }]}