{"data":[
    {
        "indexid":4962,
        "wordid":8759,
        "word":"فَبِأَيِّ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word فَبِأَيِّ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":4962,
        "wordid":17735,
        "word":"رَبِّكُمَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكُمَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4962,
        "wordid":17736,
        "word":"تُكَذِّبَانِ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word تُكَذِّبَانِ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    }]}