{"data":[
    {
        "indexid":4977,
        "wordid":10648,
        "word":"خُضْرٍ",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word خُضْرٍ comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":4977,
        "wordid":12293,
        "word":"مُتَّكِئِينَ",
        "rootid":1201,
        "rootword":"و ك ا",
        "meanings":"to recline.",
        "sentence":"The word مُتَّكِئِينَ comes from the root و ك ا and is associated with the meanings: to recline."
    },

    {
        "indexid":4977,
        "wordid":17797,
        "word":"رَفْرَفٍ",
        "rootid":186,
        "rootword":"ر ف ر ف",
        "meanings":"coverlets for beds; beds; carpets; green pieces of cloth or pieces of a cloth of dark or an ashy dust colour that are spread; the redundant parts of beds; pillows or cushions, meadows or gardens; a window or an aperture for the admission of light.",
        "sentence":"The word رَفْرَفٍ comes from the root ر ف ر ف and is associated with the meanings: coverlets for beds; beds; carpets; green pieces of cloth or pieces of a cloth of dark or an ashy dust colour that are spread; the redundant parts of beds; pillows or cushions, meadows or gardens; a window or an aperture for the admission of light."
    },

    {
        "indexid":4977,
        "wordid":17798,
        "word":"وَعَبْقَرِيٍّ",
        "rootid":203,
        "rootword":"ع ب ق ر",
        "meanings":"great, excellent, beautiful, fine, of finest quality, chief, glittering, surpassing, surpassingly efficient, extraordinary, superior, pre-eminent, superseding, quick-witted, expert, vigorous, effective, magnificent, grand, sublime, high, exalted, dignified, learned, perfect, accomplished, mighty\/powerful\/strong, rich carpet, garment splendidly manufactured, variegated cloth, garment of silk, brocade, thing that surpasses every other thing. (there is no other word in Arabic to indicate the fine of finest quality)",
        "sentence":"The word وَعَبْقَرِيٍّ comes from the root ع ب ق ر and is associated with the meanings: great, excellent, beautiful, fine, of finest quality, chief, glittering, surpassing, surpassingly efficient, extraordinary, superior, pre-eminent, superseding, quick-witted, expert, vigorous, effective, magnificent, grand, sublime, high, exalted, dignified, learned, perfect, accomplished, mighty\/powerful\/strong, rich carpet, garment splendidly manufactured, variegated cloth, garment of silk, brocade, thing that surpasses every other thing. (there is no other word in Arabic to indicate the fine of finest quality)"
    },

    {
        "indexid":4977,
        "wordid":17799,
        "word":"حِسَانٍ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حِسَانٍ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    }]}