{"data":[
    {
        "indexid":4998,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4998,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4998,
        "wordid":2377,
        "word":"عَنْهَا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهَا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4998,
        "wordid":17824,
        "word":"يُصَدَّعُونَ",
        "rootid":1763,
        "rootword":"ص د ع",
        "meanings":"to split, expound, cleave, profess openly, divide, cross, proclaim, promulgate aloud, declare openly, be affected with headache, manifest, make clear. sad'un - fissure. suddi'a - to oppress with or suffer from headache. issada'a (vb. 5) - to be split up or divided. mutasaddiun - that which is cloven or splits in two.. . Yusadda'uun (pip. 3rd. p.m. plu. II.): They will be affected with headache.. Yasadda'uun (imp 3rd. p.m. plu. V): They will be separated.. Isda (prt. m. sing): declare openly.. sad'un (v.n.): splitting, bursting forth.",
        "sentence":"The word يُصَدَّعُونَ comes from the root ص د ع and is associated with the meanings: to split, expound, cleave, profess openly, divide, cross, proclaim, promulgate aloud, declare openly, be affected with headache, manifest, make clear. sad'un - fissure. suddi'a - to oppress with or suffer from headache. issada'a (vb. 5) - to be split up or divided. mutasaddiun - that which is cloven or splits in two.. . Yusadda'uun (pip. 3rd. p.m. plu. II.): They will be affected with headache.. Yasadda'uun (imp 3rd. p.m. plu. V): They will be separated.. Isda (prt. m. sing): declare openly.. sad'un (v.n.): splitting, bursting forth."
    },

    {
        "indexid":4998,
        "wordid":17825,
        "word":"يُنْزِفُونَ",
        "rootid":1428,
        "rootword":"ن ز ف",
        "meanings":"to exhaust, deprive of intellectual facilities.",
        "sentence":"The word يُنْزِفُونَ comes from the root ن ز ف and is associated with the meanings: to exhaust, deprive of intellectual facilities."
    }]}