{"data":[
    {
        "indexid":5007,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5007,
        "wordid":15661,
        "word":"سِدْرٍ",
        "rootid":251,
        "rootword":"س د ر",
        "meanings":"to rend (a garment), hang or let down a garment, lose (one's hair), be dazzled\/confounded\/perplexed, be dazzled by a thing at which one looked.. sidratun - Lote-tree. when the shade of lote-tree becomes dense and crowded it is very pleasant and in the hot and dry climate of Arabia the tired and fatigued travelers take shelter and find rest under it and thus it is made to serve as a parable for the shade of paradise and its blessings on account of the ampleness of its shadow. The qualification of sidrah by the word al-muntaha shows that it is a place beyond which human knowledge does not go.",
        "sentence":"The word سِدْرٍ comes from the root س د ر and is associated with the meanings: to rend (a garment), hang or let down a garment, lose (one's hair), be dazzled\/confounded\/perplexed, be dazzled by a thing at which one looked.. sidratun - Lote-tree. when the shade of lote-tree becomes dense and crowded it is very pleasant and in the hot and dry climate of Arabia the tired and fatigued travelers take shelter and find rest under it and thus it is made to serve as a parable for the shade of paradise and its blessings on account of the ampleness of its shadow. The qualification of sidrah by the word al-muntaha shows that it is a place beyond which human knowledge does not go."
    },

    {
        "indexid":5007,
        "wordid":17835,
        "word":"مَخْضُودٍ",
        "rootid":1239,
        "rootword":"خ ض د",
        "meanings":"To break without separating the parts, to cut\/pull off or remove, thornless, to shrink and shrivel (fruit), to incline the body or bend from side to side, to be feeble and weak, fatigue or weariness, lacking power to rise, to eat vehemently.",
        "sentence":"The word مَخْضُودٍ comes from the root خ ض د and is associated with the meanings: To break without separating the parts, to cut\/pull off or remove, thornless, to shrink and shrivel (fruit), to incline the body or bend from side to side, to be feeble and weak, fatigue or weariness, lacking power to rise, to eat vehemently."
    }]}