{"data":[
    {
        "indexid":5016,
        "wordid":17849,
        "word":"عُرُبًا",
        "rootid":1594,
        "rootword":"ع ر ب",
        "meanings":"Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven.",
        "sentence":"The word عُرُبًا comes from the root ع ر ب and is associated with the meanings: Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven."
    },

    {
        "indexid":5016,
        "wordid":17850,
        "word":"أَتْرَابًا",
        "rootid":943,
        "rootword":"ت ر ب",
        "meanings":"To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs.",
        "sentence":"The word أَتْرَابًا comes from the root ت ر ب and is associated with the meanings: To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs."
    }]}