{"data":[
    {
        "indexid":5025,
        "wordid":2617,
        "word":"وَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5025,
        "wordid":2991,
        "word":"الْعَظِيمِ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word الْعَظِيمِ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":5025,
        "wordid":17858,
        "word":"يُصِرُّونَ",
        "rootid":1535,
        "rootword":"ص ر ر",
        "meanings":"to resolve, persist, persevere in. asarra (vb. 4) - to be obstinate, persist obstinately. asarruu - they persisted. sirrun - intense cold. sarratin - moaning, vociferating.",
        "sentence":"The word يُصِرُّونَ comes from the root ص ر ر and is associated with the meanings: to resolve, persist, persevere in. asarra (vb. 4) - to be obstinate, persist obstinately. asarruu - they persisted. sirrun - intense cold. sarratin - moaning, vociferating."
    },

    {
        "indexid":5025,
        "wordid":17859,
        "word":"الْحِنْثِ",
        "rootid":278,
        "rootword":"ح ن ث",
        "meanings":"To violate or break or fail to perform an oath, untrue to one's oath, commit a sin or crime in one's oath, retract or revoke an oath, sin, commit an offence, say what is not true, incline from what was false to what was true or from what was true to what was false, pronounce someone a violater or non-performer of an oath, put away or cast away a sin or crime from oneself, do a work whereby to escape from sin or crime, apply oneself to acts or exercises of devotion, seek to bring oneself near unto God or to advance in God's favour by works, relinquish the worship of idols.",
        "sentence":"The word الْحِنْثِ comes from the root ح ن ث and is associated with the meanings: To violate or break or fail to perform an oath, untrue to one's oath, commit a sin or crime in one's oath, retract or revoke an oath, sin, commit an offence, say what is not true, incline from what was false to what was true or from what was true to what was false, pronounce someone a violater or non-performer of an oath, put away or cast away a sin or crime from oneself, do a work whereby to escape from sin or crime, apply oneself to acts or exercises of devotion, seek to bring oneself near unto God or to advance in God's favour by works, relinquish the worship of idols."
    }]}