{"data":[
    {
        "indexid":5031,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5031,
        "wordid":16032,
        "word":"لَءَاكِلُونَ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word لَءَاكِلُونَ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":5031,
        "wordid":17864,
        "word":"شَجَرٍ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word شَجَرٍ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":5031,
        "wordid":17865,
        "word":"زَقُّومٍ",
        "rootid":347,
        "rootword":"ز ق م",
        "meanings":"gobbling, eating it quickly, to swallow, plague\/pestilence, any deadly food, food of people of the fire (of Hell), a certain tree in Hell, a certain tree having small leaves stinking and bitter, dust-coloured tree having a pungent odour.",
        "sentence":"The word زَقُّومٍ comes from the root ز ق م and is associated with the meanings: gobbling, eating it quickly, to swallow, plague\/pestilence, any deadly food, food of people of the fire (of Hell), a certain tree in Hell, a certain tree having small leaves stinking and bitter, dust-coloured tree having a pungent odour."
    }]}