{"data":[
    {
        "indexid":5032,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5032,
        "wordid":16033,
        "word":"فَمَالِئُونَ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word فَمَالِئُونَ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":5032,
        "wordid":16034,
        "word":"الْبُطُونَ",
        "rootid":378,
        "rootword":"ب ط ن",
        "meanings":"Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward.",
        "sentence":"The word الْبُطُونَ comes from the root ب ط ن and is associated with the meanings: Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward."
    }]}