{"data":[
    {
        "indexid":5040,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5040,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5040,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5040,
        "wordid":2212,
        "word":"تَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":5040,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5040,
        "wordid":17179,
        "word":"أَمْثَالَكُمْ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word أَمْثَالَكُمْ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":5040,
        "wordid":17874,
        "word":"نُبَدِّلَ",
        "rootid":1238,
        "rootword":"ب د ل",
        "meanings":"changing\/altering -> with or without substitution, replacing\/exchanging.",
        "sentence":"The word نُبَدِّلَ comes from the root ب د ل and is associated with the meanings: changing\/altering -> with or without substitution, replacing\/exchanging."
    },

    {
        "indexid":5040,
        "wordid":17875,
        "word":"وَنُنْشِئَكُمْ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word وَنُنْشِئَكُمْ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    }]}