{"data":[
    {
        "indexid":5061,
        "wordid":13871,
        "word":"تُكَذِّبُونَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word تُكَذِّبُونَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":5061,
        "wordid":16590,
        "word":"وَتَجْعَلُونَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَتَجْعَلُونَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5061,
        "wordid":17902,
        "word":"رِزْقَكُمْ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word رِزْقَكُمْ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    }]}