{"data":[
    {
        "indexid":5064,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5064,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":5064,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5064,
        "wordid":2317,
        "word":"وَنَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word وَنَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":5064,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5064,
        "wordid":4085,
        "word":"أَقْرَبُ",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word أَقْرَبُ comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":5064,
        "wordid":13239,
        "word":"تُبْصِرُونَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word تُبْصِرُونَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    }]}