{"data":[
    {
        "indexid":5095,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5095,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5095,
        "wordid":2072,
        "word":"عَذَابٌ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابٌ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":5095,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5095,
        "wordid":2137,
        "word":"كَمَثَلِ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word كَمَثَلِ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":5095,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5095,
        "wordid":2487,
        "word":"وَفِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word وَفِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5095,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":5095,
        "wordid":2974,
        "word":"الْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":5095,
        "wordid":3354,
        "word":"الْأَمْوَالِ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word الْأَمْوَالِ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":5095,
        "wordid":3630,
        "word":"بَيْنَكُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَكُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":5095,
        "wordid":3813,
        "word":"الْحَيَوةُ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةُ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":5095,
        "wordid":4138,
        "word":"يَكُونُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5095,
        "wordid":4322,
        "word":"وَمَغْفِرَةٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word وَمَغْفِرَةٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":5095,
        "wordid":4557,
        "word":"شَدِيدٌ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word شَدِيدٌ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":5095,
        "wordid":4624,
        "word":"مَتَاعُ",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word مَتَاعُ comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":5095,
        "wordid":4630,
        "word":"وَرِضْوَانٌ",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word وَرِضْوَانٌ comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":5095,
        "wordid":5489,
        "word":"الْغُرُورِ",
        "rootid":1092,
        "rootword":"غ ر ر",
        "meanings":"deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities",
        "sentence":"The word الْغُرُورِ comes from the root غ ر ر and is associated with the meanings: deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities"
    },

    {
        "indexid":5095,
        "wordid":7082,
        "word":"اعْلَمُوا",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word اعْلَمُوا comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":5095,
        "wordid":7321,
        "word":"لَعِبٌ",
        "rootid":1150,
        "rootword":"ل ع ب",
        "meanings":"played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool.",
        "sentence":"The word لَعِبٌ comes from the root ل ع ب and is associated with the meanings: played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool."
    },

    {
        "indexid":5095,
        "wordid":7322,
        "word":"وَلَهْوٌ",
        "rootid":473,
        "rootword":"ل ه و",
        "meanings":"become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless.",
        "sentence":"The word وَلَهْوٌ comes from the root ل ه و and is associated with the meanings: become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless."
    },

    {
        "indexid":5095,
        "wordid":8221,
        "word":"نَبَاتُهُ",
        "rootid":664,
        "rootword":"ن ب ت",
        "meanings":"to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle.",
        "sentence":"The word نَبَاتُهُ comes from the root ن ب ت and is associated with the meanings: to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle."
    },

    {
        "indexid":5095,
        "wordid":9435,
        "word":"الْكُفَّارَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكُفَّارَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":5095,
        "wordid":12001,
        "word":"وَالْأَوْلَادِ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word وَالْأَوْلَادِ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":5095,
        "wordid":15199,
        "word":"مُصْفَرًّا",
        "rootid":155,
        "rootword":"ص ف ر",
        "meanings":"to dye or paint yellow. safraa'un (f. of asfaru, pl. sufrun) - yellow, tawny. musfarun (vb. 9) - that which is or becomes yellow and pale.",
        "sentence":"The word مُصْفَرًّا comes from the root ص ف ر and is associated with the meanings: to dye or paint yellow. safraa'un (f. of asfaru, pl. sufrun) - yellow, tawny. musfarun (vb. 9) - that which is or becomes yellow and pale."
    },

    {
        "indexid":5095,
        "wordid":16335,
        "word":"يَهِيجُ",
        "rootid":543,
        "rootword":"ه ي ج",
        "meanings":"to rush forth, be moved, agitated, raised, excited, wither, fade, rush forth.",
        "sentence":"The word يَهِيجُ comes from the root ه ي ج and is associated with the meanings: to rush forth, be moved, agitated, raised, excited, wither, fade, rush forth."
    },

    {
        "indexid":5095,
        "wordid":16336,
        "word":"فَتَرَاهُ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word فَتَرَاهُ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":5095,
        "wordid":16337,
        "word":"حُطَامًا",
        "rootid":553,
        "rootword":"ح ط م",
        "meanings":"To break into small pieces, crush, crumble, smash.",
        "sentence":"The word حُطَامًا comes from the root ح ط م and is associated with the meanings: To break into small pieces, crush, crumble, smash."
    },

    {
        "indexid":5095,
        "wordid":17958,
        "word":"وَزِينَةٌ",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word وَزِينَةٌ comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":5095,
        "wordid":17959,
        "word":"وَتَفَاخُرٌ",
        "rootid":1138,
        "rootword":"ف خ ر",
        "meanings":"self-glorification\/magnification, boast, to disdain\/scorn, proud\/haughty, long\/tall\/great, excellent quality, baked pottery\/clay, earthen vessel.",
        "sentence":"The word وَتَفَاخُرٌ comes from the root ف خ ر and is associated with the meanings: self-glorification\/magnification, boast, to disdain\/scorn, proud\/haughty, long\/tall\/great, excellent quality, baked pottery\/clay, earthen vessel."
    },

    {
        "indexid":5095,
        "wordid":17960,
        "word":"وَتَكَاثُرٌ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word وَتَكَاثُرٌ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":5095,
        "wordid":17961,
        "word":"غَيْثٍ",
        "rootid":803,
        "rootword":"غ و ث",
        "meanings":"name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity.",
        "sentence":"The word غَيْثٍ comes from the root غ و ث and is associated with the meanings: name of an idol of the Pagan Arabs. The tribe of Murad was its worshipper. It was in the shape of a lion.M. Asad: As is evident from early sources, these five gods were among the many worshipped by the pre-Islamic Arabs as well (see the book Kitab al-Asnam by Hisham ibn Muhammad al-Kalbi, ed. Ahmad Zaki, Cairo, 1914) Their cult had probably been introduced into Arabia from Syria and Babylonia, where it seems to have existed in early antiquity."
    },

    {
        "indexid":5095,
        "wordid":17962,
        "word":"أَعْجَبَ",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word أَعْجَبَ comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    }]}