{"data":[
    {
        "indexid":5105,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5105,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5105,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5105,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5105,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5105,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5105,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":5105,
        "wordid":2909,
        "word":"بَصِيرٌ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word بَصِيرٌ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":5105,
        "wordid":3459,
        "word":"يَسْمَعُ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word يَسْمَعُ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":5105,
        "wordid":3548,
        "word":"سَمِيعٌ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِيعٌ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":5105,
        "wordid":5456,
        "word":"سَمِعَ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِعَ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":5105,
        "wordid":5457,
        "word":"قَوْلَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَوْلَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":5105,
        "wordid":17985,
        "word":"تُجَادِلُكَ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word تُجَادِلُكَ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":5105,
        "wordid":17986,
        "word":"زَوْجِهَا",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word زَوْجِهَا comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":5105,
        "wordid":17987,
        "word":"وَتَشْتَكِي",
        "rootid":386,
        "rootword":"ش ك و",
        "meanings":"to complain\/accuse, bewail. ashka - to listen to the complaint, remove the cause of complaint, satisfy the complaint of anyone by. shakwatun - small water-skin, pillar on which a lamp is put. ishtakaa - to make a complaint. mishkaat - niche for a lamp in the wall, pillar on which a lamp is put.",
        "sentence":"The word وَتَشْتَكِي comes from the root ش ك و and is associated with the meanings: to complain\/accuse, bewail. ashka - to listen to the complaint, remove the cause of complaint, satisfy the complaint of anyone by. shakwatun - small water-skin, pillar on which a lamp is put. ishtakaa - to make a complaint. mishkaat - niche for a lamp in the wall, pillar on which a lamp is put."
    },

    {
        "indexid":5105,
        "wordid":17988,
        "word":"تَحَاوُرَكُمَا",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word تَحَاوُرَكُمَا comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    }]}