{"data":[
    {
        "indexid":5134,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5134,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5134,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":5134,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5134,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5134,
        "wordid":2800,
        "word":"دِيَارِهِمْ",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word دِيَارِهِمْ comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":5134,
        "wordid":3733,
        "word":"فَضْلًا",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word فَضْلًا comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":5134,
        "wordid":4403,
        "word":"لِلْفُقَرَاءِ",
        "rootid":1045,
        "rootword":"ف ق ر",
        "meanings":"to be poor\/destitute\/needy, in want of, poverty. faqira \/ faqara - to overwhelm with back breaking calamity, feel a pain in the vertebrae.",
        "sentence":"The word لِلْفُقَرَاءِ comes from the root ف ق ر and is associated with the meanings: to be poor\/destitute\/needy, in want of, poverty. faqira \/ faqara - to overwhelm with back breaking calamity, feel a pain in the vertebrae."
    },

    {
        "indexid":5134,
        "wordid":5680,
        "word":"وَرَسُولَهُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَرَسُولَهُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":5134,
        "wordid":6561,
        "word":"يَبْتَغُونَ",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word يَبْتَغُونَ comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":5134,
        "wordid":6562,
        "word":"وَرِضْوَانًا",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word وَرِضْوَانًا comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":5134,
        "wordid":9539,
        "word":"الْمُهَاجِرِينَ",
        "rootid":807,
        "rootword":"ه ج ر",
        "meanings":"to leave\/abandon\/desert\/forsake\/depart\/renounce\/quit, separate oneself from, break with, abstain from, shun, leave with body or tongue or heart, leave lust and bad manners. hijr - bad manner, shameful action, nonsense talk.",
        "sentence":"The word الْمُهَاجِرِينَ comes from the root ه ج ر and is associated with the meanings: to leave\/abandon\/desert\/forsake\/depart\/renounce\/quit, separate oneself from, break with, abstain from, shun, leave with body or tongue or heart, leave lust and bad manners. hijr - bad manner, shameful action, nonsense talk."
    },

    {
        "indexid":5134,
        "wordid":13619,
        "word":"أُخْرِجُوا",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word أُخْرِجُوا comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":5134,
        "wordid":17334,
        "word":"الصَّادِقُونَ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word الصَّادِقُونَ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":5134,
        "wordid":18070,
        "word":"وَأَمْوَالِهِمْ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word وَأَمْوَالِهِمْ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":5134,
        "wordid":18071,
        "word":"وَيَنْصُرُونَ",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word وَيَنْصُرُونَ comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    }]}