{"data":[
    {
        "indexid":5190,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5190,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5190,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5190,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":5190,
        "wordid":2910,
        "word":"يَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word يَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":5190,
        "wordid":3345,
        "word":"سَبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":5190,
        "wordid":6451,
        "word":"اتَّخَذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word اتَّخَذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":5190,
        "wordid":6956,
        "word":"سَاءَ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَاءَ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":5190,
        "wordid":9134,
        "word":"فَصَدُّوا",
        "rootid":1069,
        "rootword":"ص د د",
        "meanings":"to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water.",
        "sentence":"The word فَصَدُّوا comes from the root ص د د and is associated with the meanings: to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water."
    },

    {
        "indexid":5190,
        "wordid":9140,
        "word":"أَيْمَانَهُمْ",
        "rootid":114,
        "rootword":"ي م ن",
        "meanings":"right side, right, right hand, oath.",
        "sentence":"The word أَيْمَانَهُمْ comes from the root ي م ن and is associated with the meanings: right side, right, right hand, oath."
    },

    {
        "indexid":5190,
        "wordid":18030,
        "word":"جُنَّةً",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word جُنَّةً comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    }]}