{"data":[
    {
        "indexid":5220,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5220,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5220,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5220,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5220,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5220,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":5220,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5220,
        "wordid":2368,
        "word":"حَيْثُ",
        "rootid":839,
        "rootword":"ح ي ث",
        "meanings":"",
        "sentence":"The word حَيْثُ comes from the root ح ي ث and is associated with the meanings: "
    },

    {
        "indexid":5220,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":5220,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5220,
        "wordid":3565,
        "word":"فَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word فَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":5220,
        "wordid":5643,
        "word":"لِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word لِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":5220,
        "wordid":7068,
        "word":"أَمْرِهِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرِهِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":5220,
        "wordid":9015,
        "word":"يَتَوَكَّلْ",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word يَتَوَكَّلْ comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":5220,
        "wordid":18268,
        "word":"وَيَرْزُقْهُ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word وَيَرْزُقْهُ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":5220,
        "wordid":18269,
        "word":"يَحْتَسِبُ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word يَحْتَسِبُ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":5220,
        "wordid":18270,
        "word":"حَسْبُهُ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word حَسْبُهُ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":5220,
        "wordid":18271,
        "word":"بَالِغُ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word بَالِغُ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    },

    {
        "indexid":5220,
        "wordid":18272,
        "word":"قَدْرًا",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word قَدْرًا comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    }]}