{"data":[
    {
        "indexid":5234,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5234,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5234,
        "wordid":3121,
        "word":"رَبُّهُ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّهُ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5234,
        "wordid":3373,
        "word":"خَيْرًا",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرًا comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":5234,
        "wordid":4047,
        "word":"أَزْوَاجًا",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word أَزْوَاجًا comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":5234,
        "wordid":15427,
        "word":"مِنْكُنَّ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُنَّ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5234,
        "wordid":18148,
        "word":"مُؤْمِنَاتٍ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word مُؤْمِنَاتٍ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5234,
        "wordid":18330,
        "word":"طَلَّقَكُنَّ",
        "rootid":935,
        "rootword":"ط ل ق",
        "meanings":"to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose.",
        "sentence":"The word طَلَّقَكُنَّ comes from the root ط ل ق and is associated with the meanings: to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose."
    },

    {
        "indexid":5234,
        "wordid":18331,
        "word":"يُبْدِلَهُ",
        "rootid":1238,
        "rootword":"ب د ل",
        "meanings":"changing\/altering -> with or without substitution, replacing\/exchanging.",
        "sentence":"The word يُبْدِلَهُ comes from the root ب د ل and is associated with the meanings: changing\/altering -> with or without substitution, replacing\/exchanging."
    },

    {
        "indexid":5234,
        "wordid":18332,
        "word":"مُسْلِمَاتٍ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word مُسْلِمَاتٍ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":5234,
        "wordid":18333,
        "word":"قَانِتَاتٍ",
        "rootid":583,
        "rootword":"ق ن ت",
        "meanings":"to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient.",
        "sentence":"The word قَانِتَاتٍ comes from the root ق ن ت and is associated with the meanings: to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient."
    },

    {
        "indexid":5234,
        "wordid":18334,
        "word":"تَائِبَاتٍ",
        "rootid":1156,
        "rootword":"ت و ب",
        "meanings":"To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt.",
        "sentence":"The word تَائِبَاتٍ comes from the root ت و ب and is associated with the meanings: To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt."
    },

    {
        "indexid":5234,
        "wordid":18335,
        "word":"عَابِدَاتٍ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَابِدَاتٍ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":5234,
        "wordid":18336,
        "word":"سَائِحَاتٍ",
        "rootid":1681,
        "rootword":"س ي ح",
        "meanings":"to flow over the ground (water), run backwards and forwards, turn, move. siyahat - travel\/journey\/tour. saihun - devotee, wandering, one who fasts, one who holds himself back from doing or saying or thinking evil.",
        "sentence":"The word سَائِحَاتٍ comes from the root س ي ح and is associated with the meanings: to flow over the ground (water), run backwards and forwards, turn, move. siyahat - travel\/journey\/tour. saihun - devotee, wandering, one who fasts, one who holds himself back from doing or saying or thinking evil."
    },

    {
        "indexid":5234,
        "wordid":18337,
        "word":"ثَيِّبَاتٍ",
        "rootid":294,
        "rootword":"ث ي ب",
        "meanings":"divorced, widows, previously married, deflowered but unmarried woman, those who return, or those who are responsive, reward, refuge, cloths",
        "sentence":"The word ثَيِّبَاتٍ comes from the root ث ي ب and is associated with the meanings: divorced, widows, previously married, deflowered but unmarried woman, those who return, or those who are responsive, reward, refuge, cloths"
    },

    {
        "indexid":5234,
        "wordid":18338,
        "word":"وَأَبْكَارًا",
        "rootid":99,
        "rootword":"ب ك ر",
        "meanings":"Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception",
        "sentence":"The word وَأَبْكَارًا comes from the root ب ك ر and is associated with the meanings: Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception"
    }]}