{"data":[
    {
        "indexid":5260,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5260,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5260,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":5260,
        "wordid":2304,
        "word":"بِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word بِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":5260,
        "wordid":2909,
        "word":"بَصِيرٌ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word بَصِيرٌ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":5260,
        "wordid":3398,
        "word":"الرَّحْمَنُ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنُ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":5260,
        "wordid":3816,
        "word":"فَوْقَهُمْ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَهُمْ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":5260,
        "wordid":4295,
        "word":"أَوَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَوَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":5260,
        "wordid":4301,
        "word":"الطَّيْرِ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word الطَّيْرِ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":5260,
        "wordid":7218,
        "word":"يَرَوْا",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word يَرَوْا comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":5260,
        "wordid":11642,
        "word":"يُمْسِكُهُنَّ",
        "rootid":953,
        "rootword":"م س ك",
        "meanings":"To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement.",
        "sentence":"The word يُمْسِكُهُنَّ comes from the root م س ك and is associated with the meanings: To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement."
    },

    {
        "indexid":5260,
        "wordid":14080,
        "word":"صَافَّاتٍ",
        "rootid":37,
        "rootword":"ص ف ف",
        "meanings":"evenly, side by side, laid out, a rank\/row\/line, in order, with reference to a bird: extend its wings in a line, expand\/spread its wings (i.e. not flapping).",
        "sentence":"The word صَافَّاتٍ comes from the root ص ف ف and is associated with the meanings: evenly, side by side, laid out, a rank\/row\/line, in order, with reference to a bird: extend its wings in a line, expand\/spread its wings (i.e. not flapping)."
    },

    {
        "indexid":5260,
        "wordid":18395,
        "word":"وَيَقْبِضْنَ",
        "rootid":1053,
        "rootword":"ق ب ض",
        "meanings":"take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace.",
        "sentence":"The word وَيَقْبِضْنَ comes from the root ق ب ض and is associated with the meanings: take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace."
    }]}