{"data":[
    {
        "indexid":5262,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5262,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5262,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":5262,
        "wordid":9802,
        "word":"يَرْزُقُكُمْ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word يَرْزُقُكُمْ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":5262,
        "wordid":9803,
        "word":"أَمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word أَمَّنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5262,
        "wordid":18397,
        "word":"أَمْسَكَ",
        "rootid":953,
        "rootword":"م س ك",
        "meanings":"To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement.",
        "sentence":"The word أَمْسَكَ comes from the root م س ك and is associated with the meanings: To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement."
    },

    {
        "indexid":5262,
        "wordid":18398,
        "word":"رِزْقَهُ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word رِزْقَهُ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":5262,
        "wordid":18399,
        "word":"لَجُّوا",
        "rootid":158,
        "rootword":"ل ج ج",
        "meanings":"To exceed the limit, persist obstinately, persevere, insist upon a thing, be querulous, continue in opposition\/contention\/litigation\/wrangling.Main sea or body of water, fathomless deep sea, great expanse of sea of which the limits cannot be seen, great & confused.Fluctuating, come and go repeatedly, stammer\/stutter in speech, confused noise\/voices.The side of a valley\/shore\/sea, mirror\/silver, sword, rugged part of a mountain.",
        "sentence":"The word لَجُّوا comes from the root ل ج ج and is associated with the meanings: To exceed the limit, persist obstinately, persevere, insist upon a thing, be querulous, continue in opposition\/contention\/litigation\/wrangling.Main sea or body of water, fathomless deep sea, great expanse of sea of which the limits cannot be seen, great & confused.Fluctuating, come and go repeatedly, stammer\/stutter in speech, confused noise\/voices.The side of a valley\/shore\/sea, mirror\/silver, sword, rugged part of a mountain."
    },

    {
        "indexid":5262,
        "wordid":18400,
        "word":"عُتُوٍّ",
        "rootid":528,
        "rootword":"ع ت و",
        "meanings":"to drag, push violently, draw along, pull, carry anyone away forcibly. atiya - to be quick to do evil. utuyyun - prone\/quick to do evil, wicked, rough, glutton, rude, hard-hearted ruffian, cruel, greedy, violent, ignoble, ill-mannered. atiyatin - blowing with extraordinary force.",
        "sentence":"The word عُتُوٍّ comes from the root ع ت و and is associated with the meanings: to drag, push violently, draw along, pull, carry anyone away forcibly. atiya - to be quick to do evil. utuyyun - prone\/quick to do evil, wicked, rough, glutton, rude, hard-hearted ruffian, cruel, greedy, violent, ignoble, ill-mannered. atiyatin - blowing with extraordinary force."
    },

    {
        "indexid":5262,
        "wordid":18401,
        "word":"وَنُفُورٍ",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word وَنُفُورٍ comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    }]}