{"data":[
    {
        "indexid":5263,
        "wordid":3260,
        "word":"صِرَاطٍ",
        "rootid":451,
        "rootword":"ص ر ط",
        "meanings":"a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword.",
        "sentence":"The word صِرَاطٍ comes from the root ص ر ط and is associated with the meanings: a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword."
    },

    {
        "indexid":5263,
        "wordid":3261,
        "word":"مُسْتَقِيمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مُسْتَقِيمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":5263,
        "wordid":5952,
        "word":"أَهْدَى",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word أَهْدَى comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":5263,
        "wordid":7760,
        "word":"يَمْشِي",
        "rootid":466,
        "rootword":"م ش ي",
        "meanings":"To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about.",
        "sentence":"The word يَمْشِي comes from the root م ش ي and is associated with the meanings: To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about."
    },

    {
        "indexid":5263,
        "wordid":9586,
        "word":"أَفَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word أَفَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5263,
        "wordid":9803,
        "word":"أَمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word أَمَّنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5263,
        "wordid":10871,
        "word":"وَجْهِهِ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وَجْهِهِ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":5263,
        "wordid":12638,
        "word":"سَوِيًّا",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word سَوِيًّا comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":5263,
        "wordid":18402,
        "word":"مُكِبًّا",
        "rootid":1040,
        "rootword":"ك ب ب",
        "meanings":"To invert, overthrow, throw one with the face to the ground, throw face downwards, prostrate anyone on (the face), he prostrated him, he bent his head towards the ground, to fall down, turn a thing upside down.Charge\/onslaught\/assault, in war.",
        "sentence":"The word مُكِبًّا comes from the root ك ب ب and is associated with the meanings: To invert, overthrow, throw one with the face to the ground, throw face downwards, prostrate anyone on (the face), he prostrated him, he bent his head towards the ground, to fall down, turn a thing upside down.Charge\/onslaught\/assault, in war."
    }]}