{"data":[
    {
        "indexid":5281,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5281,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":5281,
        "wordid":7734,
        "word":"تُطِعْ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word تُطِعْ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":5281,
        "wordid":15297,
        "word":"مَهِينٍ",
        "rootid":1293,
        "rootword":"م ه ن",
        "meanings":"To use a thing for service or work, hold a thing in mean estimation, to be contemptible or abject, to be weak, have little judgement and discrimination.",
        "sentence":"The word مَهِينٍ comes from the root م ه ن and is associated with the meanings: To use a thing for service or work, hold a thing in mean estimation, to be contemptible or abject, to be weak, have little judgement and discrimination."
    },

    {
        "indexid":5281,
        "wordid":18422,
        "word":"حَلَّافٍ",
        "rootid":1439,
        "rootword":"ح ل ف",
        "meanings":"To swear, make an oath.",
        "sentence":"The word حَلَّافٍ comes from the root ح ل ف and is associated with the meanings: To swear, make an oath."
    }]}