{"data":[
    {
        "indexid":5336,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5336,
        "wordid":7508,
        "word":"الصُّورِ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word الصُّورِ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":5336,
        "wordid":13866,
        "word":"نُفِخَ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word نُفِخَ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":5336,
        "wordid":15973,
        "word":"وَاحِدَةٌ",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةٌ comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":5336,
        "wordid":18495,
        "word":"نَفْخَةٌ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word نَفْخَةٌ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    }]}