{"data":[
    {
        "indexid":5355,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5355,
        "wordid":18533,
        "word":"سِلْسِلَةٍ",
        "rootid":1463,
        "rootword":"س ل س ل",
        "meanings":"to join\/chain one thing to another, connect, fetter with manacle, chain.",
        "sentence":"The word سِلْسِلَةٍ comes from the root س ل س ل and is associated with the meanings: to join\/chain one thing to another, connect, fetter with manacle, chain."
    },

    {
        "indexid":5355,
        "wordid":18534,
        "word":"ذَرْعُهَا",
        "rootid":1154,
        "rootword":"ذ ر ع",
        "meanings":"to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride.",
        "sentence":"The word ذَرْعُهَا comes from the root ذ ر ع and is associated with the meanings: to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride."
    },

    {
        "indexid":5355,
        "wordid":18535,
        "word":"سَبْعُونَ",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعُونَ comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":5355,
        "wordid":18536,
        "word":"ذِرَاعًا",
        "rootid":1154,
        "rootword":"ذ ر ع",
        "meanings":"to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride.",
        "sentence":"The word ذِرَاعًا comes from the root ذ ر ع and is associated with the meanings: to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride."
    },

    {
        "indexid":5355,
        "wordid":18537,
        "word":"فَاسْلُكُوهُ",
        "rootid":1768,
        "rootword":"س ل ك",
        "meanings":"to make a way, travel, thread a pathway, cause to go along (a way), embark, insert, penetrate, walk, enter.",
        "sentence":"The word فَاسْلُكُوهُ comes from the root س ل ك and is associated with the meanings: to make a way, travel, thread a pathway, cause to go along (a way), embark, insert, penetrate, walk, enter."
    }]}