{"data":[
    {
        "indexid":536,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":536,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":536,
        "wordid":2037,
        "word":"الصَّلَوةَ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةَ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":536,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":536,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":536,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":536,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":536,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":536,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":536,
        "wordid":2202,
        "word":"مَاءً",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءً comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":536,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":536,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":536,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":536,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":536,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":536,
        "wordid":2770,
        "word":"تَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word تَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":536,
        "wordid":3442,
        "word":"طَيِّبًا",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word طَيِّبًا comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":536,
        "wordid":3557,
        "word":"سَفَرٍ",
        "rootid":1465,
        "rootword":"س ف ر",
        "meanings":"to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write.",
        "sentence":"The word سَفَرٍ comes from the root س ف ر and is associated with the meanings: to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write."
    },

    {
        "indexid":536,
        "wordid":3915,
        "word":"النِّسَاءَ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word النِّسَاءَ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":536,
        "wordid":4513,
        "word":"تَجِدُوا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word تَجِدُوا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":536,
        "wordid":4940,
        "word":"أَحَدٌ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدٌ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":536,
        "wordid":5769,
        "word":"غَفُورًا",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورًا comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":536,
        "wordid":5898,
        "word":"تَقْرَبُوا",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word تَقْرَبُوا comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":536,
        "wordid":5899,
        "word":"سُكَارَى",
        "rootid":667,
        "rootword":"س ك ر",
        "meanings":"intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar.",
        "sentence":"The word سُكَارَى comes from the root س ك ر and is associated with the meanings: intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar."
    },

    {
        "indexid":536,
        "wordid":5900,
        "word":"تَعْلَمُوا",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُوا comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":536,
        "wordid":5901,
        "word":"جُنُبًا",
        "rootid":1358,
        "rootword":"ج ن ب",
        "meanings":"To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of.",
        "sentence":"The word جُنُبًا comes from the root ج ن ب and is associated with the meanings: To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of."
    },

    {
        "indexid":536,
        "wordid":5902,
        "word":"عَابِرِي",
        "rootid":704,
        "rootword":"ع ب ر",
        "meanings":"to cross, interpret, state clearly, pass over. i'tabara - to consider, ponder over, take into account, get experience from, take warming. abratun (pl. i'bar) -  regard\/consideration, admonition, warning, example, instructive warning. aabir (pl. aabiriina) - one who passes over. i'tabara - to take warning, learn a lesson.",
        "sentence":"The word عَابِرِي comes from the root ع ب ر and is associated with the meanings: to cross, interpret, state clearly, pass over. i'tabara - to consider, ponder over, take into account, get experience from, take warming. abratun (pl. i'bar) -  regard\/consideration, admonition, warning, example, instructive warning. aabir (pl. aabiriina) - one who passes over. i'tabara - to take warning, learn a lesson."
    },

    {
        "indexid":536,
        "wordid":5903,
        "word":"سَبِيلٍ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلٍ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":536,
        "wordid":5904,
        "word":"تَغْتَسِلُوا",
        "rootid":3,
        "rootword":"غ س ل",
        "meanings":"wash, removing of dirt or filth, cleanse; covered much or often; water with which one washes himself; a certain plant, growing in places that exude water and produce salt; a place in which the dead are washed",
        "sentence":"The word تَغْتَسِلُوا comes from the root غ س ل and is associated with the meanings: wash, removing of dirt or filth, cleanse; covered much or often; water with which one washes himself; a certain plant, growing in places that exude water and produce salt; a place in which the dead are washed"
    },

    {
        "indexid":536,
        "wordid":5905,
        "word":"مَرْضَى",
        "rootid":1602,
        "rootword":"م ر ض",
        "meanings":"To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion).",
        "sentence":"The word مَرْضَى comes from the root م ر ض and is associated with the meanings: To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion)."
    },

    {
        "indexid":536,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":536,
        "wordid":5907,
        "word":"الْغَائِطِ",
        "rootid":1567,
        "rootword":"غ و ط",
        "meanings":"enter\/sank into a thing, become hidden\/ descended\/sloped in the ground, dug\/excavated\/hollowed out, make deep, cavity\/pit, Lane gives the example of 4:43 & 5:6 to mean \"place in which one satisfies a want of nature\" (i.e. toilet), human excrement",
        "sentence":"The word الْغَائِطِ comes from the root غ و ط and is associated with the meanings: enter\/sank into a thing, become hidden\/ descended\/sloped in the ground, dug\/excavated\/hollowed out, make deep, cavity\/pit, Lane gives the example of 4:43 & 5:6 to mean \"place in which one satisfies a want of nature\" (i.e. toilet), human excrement"
    },

    {
        "indexid":536,
        "wordid":5908,
        "word":"لَامَسْتُمُ",
        "rootid":1324,
        "rootword":"ل م س",
        "meanings":"To touch, feel with the hand, to stretch towards, seek, inquire after, have intercourse.",
        "sentence":"The word لَامَسْتُمُ comes from the root ل م س and is associated with the meanings: To touch, feel with the hand, to stretch towards, seek, inquire after, have intercourse."
    },

    {
        "indexid":536,
        "wordid":5909,
        "word":"فَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word فَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":536,
        "wordid":5910,
        "word":"فَتَيَمَّمُوا",
        "rootid":405,
        "rootword":"ي م م",
        "meanings":"sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for.",
        "sentence":"The word فَتَيَمَّمُوا comes from the root ي م م and is associated with the meanings: sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for."
    },

    {
        "indexid":536,
        "wordid":5911,
        "word":"صَعِيدًا",
        "rootid":653,
        "rootword":"ص ع د",
        "meanings":"to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up.",
        "sentence":"The word صَعِيدًا comes from the root ص ع د and is associated with the meanings: to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up."
    },

    {
        "indexid":536,
        "wordid":5912,
        "word":"فَامْسَحُوا",
        "rootid":1564,
        "rootword":"م س ح",
        "meanings":"to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah",
        "sentence":"The word فَامْسَحُوا comes from the root م س ح and is associated with the meanings: to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah"
    },

    {
        "indexid":536,
        "wordid":5913,
        "word":"بِوُجُوهِكُمْ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word بِوُجُوهِكُمْ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":536,
        "wordid":5914,
        "word":"وَأَيْدِيكُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word وَأَيْدِيكُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":536,
        "wordid":5915,
        "word":"عَفُوًّا",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word عَفُوًّا comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    }]}