{"data":[
    {
        "indexid":5369,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5369,
        "wordid":18551,
        "word":"لَقَطَعْنَا",
        "rootid":395,
        "rootword":"ق ط ع",
        "meanings":"to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion.",
        "sentence":"The word لَقَطَعْنَا comes from the root ق ط ع and is associated with the meanings: to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion."
    },

    {
        "indexid":5369,
        "wordid":18552,
        "word":"الْوَتِينَ",
        "rootid":1068,
        "rootword":"و ت ن",
        "meanings":"to injure in the aorta, which rises from the upper part of the heart through which blood is carried from the left side of the heart, flow continuously.",
        "sentence":"The word الْوَتِينَ comes from the root و ت ن and is associated with the meanings: to injure in the aorta, which rises from the upper part of the heart through which blood is carried from the left side of the heart, flow continuously."
    }]}