{"data":[
    {
        "indexid":539,
        "wordid":2010,
        "word":"الدِّينِ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word الدِّينِ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":539,
        "wordid":2034,
        "word":"يُؤْمِنُونَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُونَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":539,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":539,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":539,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":539,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":539,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":539,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":539,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":539,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":539,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":539,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":539,
        "wordid":2619,
        "word":"هَادُوا",
        "rootid":360,
        "rootword":"ه و د",
        "meanings":"(Ya-ha-Dal) Jews",
        "sentence":"The word هَادُوا comes from the root ه و د and is associated with the meanings: (Ya-ha-Dal) Jews"
    },

    {
        "indexid":539,
        "wordid":2850,
        "word":"لَعَنَهُمُ",
        "rootid":84,
        "rootword":"ل ع ن",
        "meanings":"To drive away, execrate, deprive one of mercy and blessings, condemn, curse.The base or lower part of a palm-tree.",
        "sentence":"The word لَعَنَهُمُ comes from the root ل ع ن and is associated with the meanings: To drive away, execrate, deprive one of mercy and blessings, condemn, curse.The base or lower part of a palm-tree."
    },

    {
        "indexid":539,
        "wordid":2851,
        "word":"بِكُفْرِهِمْ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word بِكُفْرِهِمْ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":539,
        "wordid":2882,
        "word":"سَمِعْنَا",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِعْنَا comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":539,
        "wordid":2883,
        "word":"وَعَصَيْنَا",
        "rootid":468,
        "rootword":"ع ص ي",
        "meanings":"to rebel, disobey, oppose, resist, transgress.",
        "sentence":"The word وَعَصَيْنَا comes from the root ع ص ي and is associated with the meanings: to rebel, disobey, oppose, resist, transgress."
    },

    {
        "indexid":539,
        "wordid":3373,
        "word":"خَيْرًا",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرًا comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":539,
        "wordid":4534,
        "word":"وَأَطَعْنَا",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word وَأَطَعْنَا comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":539,
        "wordid":4952,
        "word":"وَيَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَيَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":539,
        "wordid":5093,
        "word":"لَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word لَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":539,
        "wordid":5922,
        "word":"يُحَرِّفُونَ",
        "rootid":650,
        "rootword":"ح ر ف",
        "meanings":"To pervert, dislocate, change, turn away, discard anything from, alter, tamper with.",
        "sentence":"The word يُحَرِّفُونَ comes from the root ح ر ف and is associated with the meanings: To pervert, dislocate, change, turn away, discard anything from, alter, tamper with."
    },

    {
        "indexid":539,
        "wordid":5923,
        "word":"الْكَلِمَ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word الْكَلِمَ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":539,
        "wordid":5924,
        "word":"مَوَاضِعِهِ",
        "rootid":1308,
        "rootword":"و ض ع",
        "meanings":"he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing.",
        "sentence":"The word مَوَاضِعِهِ comes from the root و ض ع and is associated with the meanings: he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing."
    },

    {
        "indexid":539,
        "wordid":5925,
        "word":"وَاسْمَعْ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word وَاسْمَعْ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":539,
        "wordid":5926,
        "word":"مُسْمَعٍ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word مُسْمَعٍ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":539,
        "wordid":5927,
        "word":"وَرَاعِنَا",
        "rootid":811,
        "rootword":"ر ع ي",
        "meanings":"to pasture\/feed\/graze, observe aright, keep (an order), rule, have regard to, tend, mindful, watch, pay attention. One who feeds flocks, shepherd. ri'ayatun - right observance. mar'an - pasture. ra'a (vb. 3) - to observe\/respect, look at, listen, give ear, hearken. ra'ina - listen to us (a phrase used also for showing disrespect for the person addressed).",
        "sentence":"The word وَرَاعِنَا comes from the root ر ع ي and is associated with the meanings: to pasture\/feed\/graze, observe aright, keep (an order), rule, have regard to, tend, mindful, watch, pay attention. One who feeds flocks, shepherd. ri'ayatun - right observance. mar'an - pasture. ra'a (vb. 3) - to observe\/respect, look at, listen, give ear, hearken. ra'ina - listen to us (a phrase used also for showing disrespect for the person addressed)."
    },

    {
        "indexid":539,
        "wordid":5928,
        "word":"لَيًّا",
        "rootid":326,
        "rootword":"ل و ي",
        "meanings":"To twist, pervert\/distort, turn back, bend\/contort\/curled\/curved\/coiled, wound, avert (the face) from, lean, feel an inclination, very contentious.",
        "sentence":"The word لَيًّا comes from the root ل و ي and is associated with the meanings: To twist, pervert\/distort, turn back, bend\/contort\/curled\/curved\/coiled, wound, avert (the face) from, lean, feel an inclination, very contentious."
    },

    {
        "indexid":539,
        "wordid":5929,
        "word":"بِأَلْسِنَتِهِمْ",
        "rootid":227,
        "rootword":"ل س ن",
        "meanings":"a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech.",
        "sentence":"The word بِأَلْسِنَتِهِمْ comes from the root ل س ن and is associated with the meanings: a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech."
    },

    {
        "indexid":539,
        "wordid":5930,
        "word":"وَطَعْنًا",
        "rootid":145,
        "rootword":"ط ع ن",
        "meanings":"to thrust, defame\/discredit, to speak ill of someone, traducing, assail, revile, scoff, pierce, spear, wound, calumniate.",
        "sentence":"The word وَطَعْنًا comes from the root ط ع ن and is associated with the meanings: to thrust, defame\/discredit, to speak ill of someone, traducing, assail, revile, scoff, pierce, spear, wound, calumniate."
    },

    {
        "indexid":539,
        "wordid":5931,
        "word":"وَانْظُرْنَا",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word وَانْظُرْنَا comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":539,
        "wordid":5932,
        "word":"وَأَقْوَمَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word وَأَقْوَمَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    }]}