{"data":[
    {
        "indexid":5413,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5413,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":5413,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5413,
        "wordid":13927,
        "word":"امْرِئٍ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word امْرِئٍ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":5413,
        "wordid":17911,
        "word":"نَعِيمٍ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نَعِيمٍ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":5413,
        "wordid":18596,
        "word":"أَيَطْمَعُ",
        "rootid":768,
        "rootword":"ط م ع",
        "meanings":"to covet, eagerly desire, long or hope for, yearn for. tama'un - desire, hoping and longing for, causing to be full of hope.",
        "sentence":"The word أَيَطْمَعُ comes from the root ط م ع and is associated with the meanings: to covet, eagerly desire, long or hope for, yearn for. tama'un - desire, hoping and longing for, causing to be full of hope."
    },

    {
        "indexid":5413,
        "wordid":18597,
        "word":"يُدْخَلَ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word يُدْخَلَ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":5413,
        "wordid":18598,
        "word":"جَنَّةَ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word جَنَّةَ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    }]}