{"data":[
    {
        "indexid":5451,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5451,
        "wordid":2077,
        "word":"يَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":5451,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5451,
        "wordid":12186,
        "word":"شَطَطًا",
        "rootid":1104,
        "rootword":"ش ط ط",
        "meanings":"to be far off, wrong anyone, treat with injustice, go beyond due bounds. shattan - extravagant lie, exceeding, redundant, excess. ashatta (vb. 4) - to act unjustly.",
        "sentence":"The word شَطَطًا comes from the root ش ط ط and is associated with the meanings: to be far off, wrong anyone, treat with injustice, go beyond due bounds. shattan - extravagant lie, exceeding, redundant, excess. ashatta (vb. 4) - to act unjustly."
    },

    {
        "indexid":5451,
        "wordid":18659,
        "word":"سَفِيهُنَا",
        "rootid":1018,
        "rootword":"س ف ه",
        "meanings":"to be foolish\/stupid\/silly\/fickle\/ignorant\/imprudent, want of judgement, folly, light or witted, to become unwise, lose the mind, deem anyone foolish, destroy, deny miserably, levity, one who is foolish.",
        "sentence":"The word سَفِيهُنَا comes from the root س ف ه and is associated with the meanings: to be foolish\/stupid\/silly\/fickle\/ignorant\/imprudent, want of judgement, folly, light or witted, to become unwise, lose the mind, deem anyone foolish, destroy, deny miserably, levity, one who is foolish."
    }]}