{"data":[
    {
        "indexid":5463,
        "wordid":2202,
        "word":"مَاءً",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءً comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":5463,
        "wordid":9126,
        "word":"اسْتَقَامُوا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word اسْتَقَامُوا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":5463,
        "wordid":18690,
        "word":"وَأَلَّوِ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَأَلَّوِ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":5463,
        "wordid":18691,
        "word":"الطَّرِيقَةِ",
        "rootid":539,
        "rootword":"ط ر ق",
        "meanings":"to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour.",
        "sentence":"The word الطَّرِيقَةِ comes from the root ط ر ق and is associated with the meanings: to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour."
    },

    {
        "indexid":5463,
        "wordid":18692,
        "word":"لَأَسْقَيْنَاهُمْ",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word لَأَسْقَيْنَاهُمْ comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":5463,
        "wordid":18693,
        "word":"غَدَقًا",
        "rootid":307,
        "rootword":"غ د ق",
        "meanings":"spring or source abounded with water, abundant, generous",
        "sentence":"The word غَدَقًا comes from the root غ د ق and is associated with the meanings: spring or source abounded with water, abundant, generous"
    }]}