{"data":[
    {
        "indexid":5466,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5466,
        "wordid":2694,
        "word":"كَادُوا",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word كَادُوا comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":5466,
        "wordid":12711,
        "word":"عَبْدُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَبْدُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":5466,
        "wordid":18698,
        "word":"قَامَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَامَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":5466,
        "wordid":18699,
        "word":"يَدْعُوهُ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word يَدْعُوهُ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":5466,
        "wordid":18700,
        "word":"يَكُونُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5466,
        "wordid":18701,
        "word":"لِبَدًا",
        "rootid":733,
        "rootword":"ل ب د",
        "meanings":"stuck\/clave\/adhered (to the ground\/thing), remain fixed\/steady and looked or considered, remain\/continue\/dwelt\/stay in a place, become intermingled\/compacted\/coherent, make together, become felted, aquat, swarm, stifling crowd, that which is packed densely, abundant\/much.",
        "sentence":"The word لِبَدًا comes from the root ل ب د and is associated with the meanings: stuck\/clave\/adhered (to the ground\/thing), remain fixed\/steady and looked or considered, remain\/continue\/dwelt\/stay in a place, become intermingled\/compacted\/coherent, make together, become felted, aquat, swarm, stifling crowd, that which is packed densely, abundant\/much."
    }]}