{"data":[
    {
        "indexid":5479,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":5479,
        "wordid":6109,
        "word":"الْقُرْءَانَ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانَ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":5479,
        "wordid":14237,
        "word":"تَرْتِيلًا",
        "rootid":1058,
        "rootword":"ر ت ل",
        "meanings":"to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant.",
        "sentence":"The word تَرْتِيلًا comes from the root ر ت ل and is associated with the meanings: to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant."
    },

    {
        "indexid":5479,
        "wordid":18719,
        "word":"زِدْ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word زِدْ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":5479,
        "wordid":18720,
        "word":"وَرَتِّلِ",
        "rootid":1058,
        "rootword":"ر ت ل",
        "meanings":"to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant.",
        "sentence":"The word وَرَتِّلِ comes from the root ر ت ل and is associated with the meanings: to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant."
    }]}