{"data":[
    {
        "indexid":5481,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":5481,
        "wordid":2711,
        "word":"أَشَدُّ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word أَشَدُّ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":5481,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":5481,
        "wordid":4499,
        "word":"وَأَقْوَمُ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word وَأَقْوَمُ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":5481,
        "wordid":6342,
        "word":"قِيلًا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قِيلًا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":5481,
        "wordid":18722,
        "word":"نَاشِئَةَ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word نَاشِئَةَ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    },

    {
        "indexid":5481,
        "wordid":18723,
        "word":"وَطْئًا",
        "rootid":729,
        "rootword":"و ط ا",
        "meanings":"to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform.",
        "sentence":"The word وَطْئًا comes from the root و ط ا and is associated with the meanings: to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform."
    }]}