{"data":[
    {
        "indexid":5512,
        "wordid":18787,
        "word":"سَأُرْهِقُهُ",
        "rootid":849,
        "rootword":"ر ه ق",
        "meanings":"to follow closely, cover, be foolish, lie, be mischievous, be ungodly, hasten, overtake, reach, draw near, overspread. rahaqa - to oppress, cause to suffer, be given to evil practices. rahqun - folly, oppression, evil disposition. arhaqa - to impose a difficult task, afflict with troubles and difficulties.",
        "sentence":"The word سَأُرْهِقُهُ comes from the root ر ه ق and is associated with the meanings: to follow closely, cover, be foolish, lie, be mischievous, be ungodly, hasten, overtake, reach, draw near, overspread. rahaqa - to oppress, cause to suffer, be given to evil practices. rahqun - folly, oppression, evil disposition. arhaqa - to impose a difficult task, afflict with troubles and difficulties."
    },

    {
        "indexid":5512,
        "wordid":18788,
        "word":"صَعُودًا",
        "rootid":653,
        "rootword":"ص ع د",
        "meanings":"to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up.",
        "sentence":"The word صَعُودًا comes from the root ص ع د and is associated with the meanings: to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up."
    }]}