{"data":[
    {
        "indexid":5540,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":5540,
        "wordid":8712,
        "word":"وَكُنَّا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكُنَّا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5540,
        "wordid":9392,
        "word":"نَخُوضُ",
        "rootid":1321,
        "rootword":"خ و ض",
        "meanings":"To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair.",
        "sentence":"The word نَخُوضُ comes from the root خ و ض and is associated with the meanings: To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair."
    },

    {
        "indexid":5540,
        "wordid":18820,
        "word":"الْخَائِضِينَ",
        "rootid":1321,
        "rootword":"خ و ض",
        "meanings":"To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair.",
        "sentence":"The word الْخَائِضِينَ comes from the root خ و ض and is associated with the meanings: To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair."
    }]}