{"data":[
    {
        "indexid":5548,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5548,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":5548,
        "wordid":5297,
        "word":"الْءَاخِرَةَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":5548,
        "wordid":6695,
        "word":"يَخَافُونَ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word يَخَافُونَ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":5548,
        "wordid":12824,
        "word":"كَلَّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كَلَّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    }]}