{"data":[
    {
        "indexid":5566,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":5566,
        "wordid":6197,
        "word":"أَلْقَى",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word أَلْقَى comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":5566,
        "wordid":18852,
        "word":"مَعَاذِيرَهُ",
        "rootid":1449,
        "rootword":"ع ذ ر",
        "meanings":"to beg pardon, to excuse, to free anyone from guilt or blame, excuse\/plea, those who put forth excuses, apologists.",
        "sentence":"The word مَعَاذِيرَهُ comes from the root ع ذ ر and is associated with the meanings: to beg pardon, to excuse, to free anyone from guilt or blame, excuse\/plea, those who put forth excuses, apologists."
    }]}