{"data":[
    {
        "indexid":5596,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5596,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5596,
        "wordid":18893,
        "word":"الْأَبْرَارَ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word الْأَبْرَارَ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":5596,
        "wordid":18894,
        "word":"يَشْرَبُونَ",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word يَشْرَبُونَ comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":5596,
        "wordid":18895,
        "word":"كَأْسٍ",
        "rootid":644,
        "rootword":"ك ا س",
        "meanings":"drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha).",
        "sentence":"The word كَأْسٍ comes from the root ك ا س and is associated with the meanings: drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha)."
    },

    {
        "indexid":5596,
        "wordid":18896,
        "word":"مِزَاجُهَا",
        "rootid":463,
        "rootword":"م ز ج",
        "meanings":"To mix\/mingle\/incorporate\/blend, exasperate\/irritate\/enrage a person, to give something, contend or dispute with a person, various in disposition or temperament.",
        "sentence":"The word مِزَاجُهَا comes from the root م ز ج and is associated with the meanings: To mix\/mingle\/incorporate\/blend, exasperate\/irritate\/enrage a person, to give something, contend or dispute with a person, various in disposition or temperament."
    },

    {
        "indexid":5596,
        "wordid":18897,
        "word":"كَافُورًا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَافُورًا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}