{"data":[
    {
        "indexid":5600,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5600,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5600,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5600,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5600,
        "wordid":6789,
        "word":"جَزَاءً",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word جَزَاءً comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":5600,
        "wordid":7160,
        "word":"نُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word نُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":5600,
        "wordid":14296,
        "word":"شُكُورًا",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word شُكُورًا comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":5600,
        "wordid":18906,
        "word":"نُطْعِمُكُمْ",
        "rootid":1791,
        "rootword":"ط ع م",
        "meanings":"ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating.",
        "sentence":"The word نُطْعِمُكُمْ comes from the root ط ع م and is associated with the meanings: ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating."
    },

    {
        "indexid":5600,
        "wordid":18907,
        "word":"لِوَجْهِ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word لِوَجْهِ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    }]}