{"data":[
    {
        "indexid":5608,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5608,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5608,
        "wordid":17508,
        "word":"كَأْسًا",
        "rootid":644,
        "rootword":"ك ا س",
        "meanings":"drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha).",
        "sentence":"The word كَأْسًا comes from the root ك ا س and is associated with the meanings: drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha)."
    },

    {
        "indexid":5608,
        "wordid":18896,
        "word":"مِزَاجُهَا",
        "rootid":463,
        "rootword":"م ز ج",
        "meanings":"To mix\/mingle\/incorporate\/blend, exasperate\/irritate\/enrage a person, to give something, contend or dispute with a person, various in disposition or temperament.",
        "sentence":"The word مِزَاجُهَا comes from the root م ز ج and is associated with the meanings: To mix\/mingle\/incorporate\/blend, exasperate\/irritate\/enrage a person, to give something, contend or dispute with a person, various in disposition or temperament."
    },

    {
        "indexid":5608,
        "wordid":18928,
        "word":"وَيُسْقَوْنَ",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word وَيُسْقَوْنَ comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":5608,
        "wordid":18929,
        "word":"زَنْجَبِيلًا",
        "rootid":1322,
        "rootword":"ز ن ج ب ي ل",
        "meanings":"ginger, a certain herb that has a property that is heating\/warming\/exhilarating to those who consume it.",
        "sentence":"The word زَنْجَبِيلًا comes from the root ز ن ج ب ي ل and is associated with the meanings: ginger, a certain herb that has a property that is heating\/warming\/exhilarating to those who consume it."
    }]}