{"data":[
    {
        "indexid":5616,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5616,
        "wordid":6604,
        "word":"اسْمَ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word اسْمَ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":5616,
        "wordid":12641,
        "word":"بُكْرَةً",
        "rootid":99,
        "rootword":"ب ك ر",
        "meanings":"Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception",
        "sentence":"The word بُكْرَةً comes from the root ب ك ر and is associated with the meanings: Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception"
    },

    {
        "indexid":5616,
        "wordid":14184,
        "word":"وَأَصِيلًا",
        "rootid":1644,
        "rootword":"ا ص ل",
        "meanings":"to be rooted. asiilan - evening, time before sunset.",
        "sentence":"The word وَأَصِيلًا comes from the root ا ص ل and is associated with the meanings: to be rooted. asiilan - evening, time before sunset."
    },

    {
        "indexid":5616,
        "wordid":18726,
        "word":"وَاذْكُرِ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word وَاذْكُرِ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    }]}