{"data":[
    {
        "indexid":5627,
        "wordid":3748,
        "word":"ذِكْرًا",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرًا comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":5627,
        "wordid":18958,
        "word":"فَالْمُلْقِيَاتِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَالْمُلْقِيَاتِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}