{"data":[
    {
        "indexid":564,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":564,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":564,
        "wordid":2298,
        "word":"جَمِيعًا",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word جَمِيعًا comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":564,
        "wordid":2632,
        "word":"خُذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word خُذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":564,
        "wordid":3367,
        "word":"أَوِ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوِ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":564,
        "wordid":6042,
        "word":"حِذْرَكُمْ",
        "rootid":737,
        "rootword":"ح ذ ر",
        "meanings":"To beware, take heed of, to be cautious\/wary\/vigilant, to take care, to be on ones guard, to be in a state of preparation, to fear or be in fear of, to be angry and prepare oneself to do mischief, draw oneself together, to be enraged.",
        "sentence":"The word حِذْرَكُمْ comes from the root ح ذ ر and is associated with the meanings: To beware, take heed of, to be cautious\/wary\/vigilant, to take care, to be on ones guard, to be in a state of preparation, to fear or be in fear of, to be angry and prepare oneself to do mischief, draw oneself together, to be enraged."
    },

    {
        "indexid":564,
        "wordid":6043,
        "word":"فَانْفِرُوا",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word فَانْفِرُوا comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    },

    {
        "indexid":564,
        "wordid":6045,
        "word":"انْفِرُوا",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word انْفِرُوا comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    }]}