{"data":[
    {
        "indexid":5652,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5652,
        "wordid":5867,
        "word":"ذِي",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذِي comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":5652,
        "wordid":18979,
        "word":"انْطَلِقُوا",
        "rootid":935,
        "rootword":"ط ل ق",
        "meanings":"to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose.",
        "sentence":"The word انْطَلِقُوا comes from the root ط ل ق and is associated with the meanings: to be free from bond, be divorced, be repudiated. talaaq - divorce. ta'allaqa (vb. 2) - to divorce\/quit\/leave. mutallaqatun - divorced woman. intalaqa - to start doing something, depart, set out in doing something, go ones way, be free or loose."
    },

    {
        "indexid":5652,
        "wordid":18980,
        "word":"ظِلٍّ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word ظِلٍّ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    },

    {
        "indexid":5652,
        "wordid":18981,
        "word":"ثَلَاثِ",
        "rootid":193,
        "rootword":"ث ل ث",
        "meanings":"to make a third part of a thing, one third, by threes.",
        "sentence":"The word ثَلَاثِ comes from the root ث ل ث and is associated with the meanings: to make a third part of a thing, one third, by threes."
    },

    {
        "indexid":5652,
        "wordid":18982,
        "word":"شُعَبٍ",
        "rootid":1624,
        "rootword":"ش ع ب",
        "meanings":"to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites.",
        "sentence":"The word شُعَبٍ comes from the root ش ع ب and is associated with the meanings: to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites."
    }]}