{"data":[
    {
        "indexid":5663,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5663,
        "wordid":3542,
        "word":"الْمُتَّقِينَ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word الْمُتَّقِينَ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":5663,
        "wordid":11366,
        "word":"وَعُيُونٍ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word وَعُيُونٍ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":5663,
        "wordid":15909,
        "word":"ظِلَالٍ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word ظِلَالٍ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    }]}