{"data":[
    {
        "indexid":5683,
        "wordid":4685,
        "word":"النَّهَارَ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word النَّهَارَ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":5683,
        "wordid":6644,
        "word":"وَجَعَلْنَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلْنَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5683,
        "wordid":19006,
        "word":"مَعَاشًا",
        "rootid":517,
        "rootword":"ع ي ش",
        "meanings":"to live in a certain manner, pass ones' life, possessed of life, seek sustenance. ishatun - livelihood, time for seeking livelihood. ma'ishatun - existence, manner of living, rituals, necessities of life, means of life and subsistence, means of obtaining that whereby one lives.",
        "sentence":"The word مَعَاشًا comes from the root ع ي ش and is associated with the meanings: to live in a certain manner, pass ones' life, possessed of life, seek sustenance. ishatun - livelihood, time for seeking livelihood. ma'ishatun - existence, manner of living, rituals, necessities of life, means of life and subsistence, means of obtaining that whereby one lives."
    }]}