{"data":[
    {
        "indexid":5699,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5699,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5699,
        "wordid":3876,
        "word":"يَرْجُونَ",
        "rootid":1344,
        "rootword":"ر ج و",
        "meanings":"to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62).",
        "sentence":"The word يَرْجُونَ comes from the root ر ج و and is associated with the meanings: to hope\/expect, an opinion requiring the happening of an event in which will be a cause of happiness; expectation of deriving advantage from an event of which a cause has already occurred, keep awaited, put off, put aside, defer\/delay, fear, beg\/request. arja' (pl.) - borders, sides. marjowwon is a person in whom great hopes are placed (e.g. 11:62)."
    },

    {
        "indexid":5699,
        "wordid":18302,
        "word":"حِسَابًا",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word حِسَابًا comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    }]}