{"data":[
    {
        "indexid":5705,
        "wordid":17850,
        "word":"أَتْرَابًا",
        "rootid":943,
        "rootword":"ت ر ب",
        "meanings":"To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs.",
        "sentence":"The word أَتْرَابًا comes from the root ت ر ب and is associated with the meanings: To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs."
    },

    {
        "indexid":5705,
        "wordid":19031,
        "word":"وَكَوَاعِبَ",
        "rootid":690,
        "rootword":"ك ع ب",
        "meanings":"swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97.",
        "sentence":"The word وَكَوَاعِبَ comes from the root ك ع ب and is associated with the meanings: swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97."
    }]}