{"data":[
    {
        "indexid":5708,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5708,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5708,
        "wordid":6789,
        "word":"جَزَاءً",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word جَزَاءً comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":5708,
        "wordid":10381,
        "word":"عَطَاءً",
        "rootid":1711,
        "rootword":"ع ط و",
        "meanings":"to take, receive. ataun - gift bestowment, present. a'ta - to give a present, offer. ta'ata (vb. 6) - took.",
        "sentence":"The word عَطَاءً comes from the root ع ط و and is associated with the meanings: to take, receive. ataun - gift bestowment, present. a'ta - to give a present, offer. ta'ata (vb. 6) - took."
    },

    {
        "indexid":5708,
        "wordid":18302,
        "word":"حِسَابًا",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word حِسَابًا comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    }]}