{"data":[
    {
        "indexid":5724,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":5724,
        "wordid":19056,
        "word":"كَرَّةٌ",
        "rootid":504,
        "rootword":"ك ر ر",
        "meanings":"To return to, return successively, run against, repeat, come back, follow by turns, be wound (thread).",
        "sentence":"The word كَرَّةٌ comes from the root ك ر ر and is associated with the meanings: To return to, return successively, run against, repeat, come back, follow by turns, be wound (thread)."
    },

    {
        "indexid":5724,
        "wordid":19057,
        "word":"خَاسِرَةٌ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word خَاسِرَةٌ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    }]}