{"data":[
    {
        "indexid":5740,
        "wordid":10916,
        "word":"رَفَعَ",
        "rootid":249,
        "rootword":"ر ف ع",
        "meanings":"to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc.",
        "sentence":"The word رَفَعَ comes from the root ر ف ع and is associated with the meanings: to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc."
    },

    {
        "indexid":5740,
        "wordid":19068,
        "word":"سَمْكَهَا",
        "rootid":1642,
        "rootword":"س م ك",
        "meanings":"to raise\/ascend, be lofty\/high. samkun - roof, the highest part of an interior of a building, height, canopy oh heaven, thickness.",
        "sentence":"The word سَمْكَهَا comes from the root س م ك and is associated with the meanings: to raise\/ascend, be lofty\/high. samkun - roof, the highest part of an interior of a building, height, canopy oh heaven, thickness."
    },

    {
        "indexid":5740,
        "wordid":19069,
        "word":"فَسَوَّاهَا",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word فَسَوَّاهَا comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    }]}