{"data":[
    {
        "indexid":5744,
        "wordid":19002,
        "word":"وَالْجِبَالَ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word وَالْجِبَالَ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":5744,
        "wordid":19077,
        "word":"أَرْسَاهَا",
        "rootid":1413,
        "rootword":"ر س و",
        "meanings":"to be firm, stable, immoveable, still, lat at anchor, moor (ship), come to pass. rawasiya (pl. of rasiyatun, f. of rasin for rasiyin) - things which are firmly and immovably fixed, mountains. arsa (vb. 4) - to fix firmly. mursan - that which is fixed with regard to time or place.",
        "sentence":"The word أَرْسَاهَا comes from the root ر س و and is associated with the meanings: to be firm, stable, immoveable, still, lat at anchor, moor (ship), come to pass. rawasiya (pl. of rasiyatun, f. of rasin for rasiyin) - things which are firmly and immovably fixed, mountains. arsa (vb. 4) - to fix firmly. mursan - that which is fixed with regard to time or place."
    }]}