{"data":[
    {
        "indexid":5825,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5825,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":5825,
        "wordid":11317,
        "word":"رَجِيمٍ",
        "rootid":1542,
        "rootword":"ر ج م",
        "meanings":"to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned.",
        "sentence":"The word رَجِيمٍ comes from the root ر ج م and is associated with the meanings: to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned."
    },

    {
        "indexid":5825,
        "wordid":18545,
        "word":"بِقَوْلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word بِقَوْلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    }]}