{"data":[
    {
        "indexid":5832,
        "wordid":19144,
        "word":"الْبِحَارُ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word الْبِحَارُ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":5832,
        "wordid":19171,
        "word":"فُجِّرَتْ",
        "rootid":1452,
        "rootword":"ف ج ر",
        "meanings":"cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows.",
        "sentence":"The word فُجِّرَتْ comes from the root ف ج ر and is associated with the meanings: cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows."
    }]}