{"data":[
    {
        "indexid":5835,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5835,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":5835,
        "wordid":5811,
        "word":"الْإِنْسَانُ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانُ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":5835,
        "wordid":11842,
        "word":"بِرَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word بِرَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5835,
        "wordid":13885,
        "word":"الْكَرِيمِ",
        "rootid":27,
        "rootword":"ك ر م",
        "meanings":"To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous",
        "sentence":"The word الْكَرِيمِ comes from the root ك ر م and is associated with the meanings: To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous"
    },

    {
        "indexid":5835,
        "wordid":19175,
        "word":"غَرَّكَ",
        "rootid":1092,
        "rootword":"غ ر ر",
        "meanings":"deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities",
        "sentence":"The word غَرَّكَ comes from the root غ ر ر and is associated with the meanings: deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities"
    }]}