{"data":[
    {
        "indexid":5877,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5877,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5877,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5877,
        "wordid":7772,
        "word":"أَجْرَمُوا",
        "rootid":387,
        "rootword":"ج ر م",
        "meanings":"",
        "sentence":"The word أَجْرَمُوا comes from the root ج ر م and is associated with the meanings: "
    },

    {
        "indexid":5877,
        "wordid":16862,
        "word":"يَضْحَكُونَ",
        "rootid":1725,
        "rootword":"ض ح ك",
        "meanings":"to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear.",
        "sentence":"The word يَضْحَكُونَ comes from the root ض ح ك and is associated with the meanings: to wonder, menstruate, rejoice, inspire with awe, ridicule, laugh at, laugh, become clear."
    }]}