{"data":[
    {
        "indexid":5898,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5898,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":5898,
        "wordid":5320,
        "word":"ظَنَّ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word ظَنَّ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":5898,
        "wordid":19233,
        "word":"يَحُورَ",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word يَحُورَ comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    }]}