{"data":[
    {
        "indexid":5965,
        "wordid":2520,
        "word":"خَيْرٌ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرٌ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":5965,
        "wordid":6084,
        "word":"وَالْءَاخِرَةُ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word وَالْءَاخِرَةُ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":5965,
        "wordid":13048,
        "word":"وَأَبْقَى",
        "rootid":1313,
        "rootword":"ب ق ي",
        "meanings":"Something or someone that remains, continues, lasts and\/or enduresPerpetual or permanentExisting, incessantly, always, endlessly or foreverWatching, observing, guarding or preservingPardoning, leaving, showing mercy or sparingRemaining portion, remainder, remnant, relic, residue, remains, recompense",
        "sentence":"The word وَأَبْقَى comes from the root ب ق ي and is associated with the meanings: Something or someone that remains, continues, lasts and\/or enduresPerpetual or permanentExisting, incessantly, always, endlessly or foreverWatching, observing, guarding or preservingPardoning, leaving, showing mercy or sparingRemaining portion, remainder, remnant, relic, residue, remains, recompense"
    }]}