{"data":[
    {
        "indexid":5972,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5972,
        "wordid":12528,
        "word":"عَيْنٍ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عَيْنٍ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":5972,
        "wordid":19302,
        "word":"تُسْقَى",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word تُسْقَى comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":5972,
        "wordid":19303,
        "word":"ءَانِيَةٍ",
        "rootid":1303,
        "rootword":"ا ن ي",
        "meanings":"Its time came; or it was, or became, or drew, near; It (a thing) was, or became, behind, or after, its time; it, or he, (a man) was, or became, behind, backward, or late; it, or he, delayed, or held back. He postponed it, put it off, deferred it, delayed it, retarded it, withheld it, impeded it; An hour, or a short portion, or a time, or an indefinite time; any period of time; the utmost point, reach or degree; A thing of which the time has come, or drawn near: and which has come, or attained, to its time; to its full, or final, time or state; to maturity, or ripeness; signifies Whence? (being an interrogative respecting the direction, or quarter, from which a thing is) and whence (used to denote a condition); Where? and where (used to denote a condition and as one of the adverbial nouns used to denote a condition), whence-so-ever; wherever (from whatever direction or quarter): when; how; however.",
        "sentence":"The word ءَانِيَةٍ comes from the root ا ن ي and is associated with the meanings: Its time came; or it was, or became, or drew, near; It (a thing) was, or became, behind, or after, its time; it, or he, (a man) was, or became, behind, backward, or late; it, or he, delayed, or held back. He postponed it, put it off, deferred it, delayed it, retarded it, withheld it, impeded it; An hour, or a short portion, or a time, or an indefinite time; any period of time; the utmost point, reach or degree; A thing of which the time has come, or drawn near: and which has come, or attained, to its time; to its full, or final, time or state; to maturity, or ripeness; signifies Whence? (being an interrogative respecting the direction, or quarter, from which a thing is) and whence (used to denote a condition); Where? and where (used to denote a condition and as one of the adverbial nouns used to denote a condition), whence-so-ever; wherever (from whatever direction or quarter): when; how; however."
    }]}