{"data":[
    {
        "indexid":5974,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5974,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5974,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5974,
        "wordid":9821,
        "word":"يُغْنِي",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word يُغْنِي comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":5974,
        "wordid":19305,
        "word":"يُسْمِنُ",
        "rootid":841,
        "rootword":"س م ن",
        "meanings":"to be fat, become fleshy, nourish, fat one.",
        "sentence":"The word يُسْمِنُ comes from the root س م ن and is associated with the meanings: to be fat, become fleshy, nourish, fat one."
    },

    {
        "indexid":5974,
        "wordid":19306,
        "word":"جُوعٍ",
        "rootid":1348,
        "rootword":"ج و ع",
        "meanings":"To be hungry, empty in the belly, hunger or long for a thing, to desire and long (as though hungering) for a thing.",
        "sentence":"The word جُوعٍ comes from the root ج و ع and is associated with the meanings: To be hungry, empty in the belly, hunger or long for a thing, to desire and long (as though hungering) for a thing."
    }]}