{"data":[
    {
        "indexid":5985,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":5985,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":5985,
        "wordid":3802,
        "word":"وَإِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5985,
        "wordid":19322,
        "word":"رُفِعَتْ",
        "rootid":249,
        "rootword":"ر ف ع",
        "meanings":"to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc.",
        "sentence":"The word رُفِعَتْ comes from the root ر ف ع and is associated with the meanings: to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc."
    }]}