{"data":[
    {
        "indexid":5998,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5998,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":5998,
        "wordid":19337,
        "word":"قَسَمٌ",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word قَسَمٌ comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    },

    {
        "indexid":5998,
        "wordid":19338,
        "word":"لِذِي",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word لِذِي comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":5998,
        "wordid":19339,
        "word":"حِجْرٍ",
        "rootid":283,
        "rootword":"ح ج ر",
        "meanings":"To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place).",
        "sentence":"The word حِجْرٍ comes from the root ح ج ر and is associated with the meanings: To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place)."
    }]}