{"data":[
    {
        "indexid":6004,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":6004,
        "wordid":5548,
        "word":"الْبِلَادِ",
        "rootid":745,
        "rootword":"ب ل د",
        "meanings":"A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others",
        "sentence":"The word الْبِلَادِ comes from the root ب ل د and is associated with the meanings: A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others"
    }]}