{"data":[
    {
        "indexid":6014,
        "wordid":2591,
        "word":"الْأَرْضُ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضُ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":6014,
        "wordid":8538,
        "word":"دَكًّا",
        "rootid":11,
        "rootword":"د ك ك",
        "meanings":"To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces.",
        "sentence":"The word دَكًّا comes from the root د ك ك and is associated with the meanings: To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces."
    },

    {
        "indexid":6014,
        "wordid":12824,
        "word":"كَلَّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كَلَّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":6014,
        "wordid":19366,
        "word":"دُكَّتِ",
        "rootid":11,
        "rootword":"د ك ك",
        "meanings":"To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces.",
        "sentence":"The word دُكَّتِ comes from the root د ك ك and is associated with the meanings: To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces."
    }]}