{"data":[
    {
        "indexid":6039,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":6039,
        "wordid":4114,
        "word":"ذَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":6039,
        "wordid":17998,
        "word":"مِسْكِينًا",
        "rootid":14,
        "rootword":"س ك ن",
        "meanings":"to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering.",
        "sentence":"The word مِسْكِينًا comes from the root س ك ن and is associated with the meanings: to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering."
    },

    {
        "indexid":6039,
        "wordid":19399,
        "word":"مَتْرَبَةٍ",
        "rootid":943,
        "rootword":"ت ر ب",
        "meanings":"To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs.",
        "sentence":"The word مَتْرَبَةٍ comes from the root ت ر ب and is associated with the meanings: To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs."
    }]}