{"data":[
    {
        "indexid":605,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":605,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":605,
        "wordid":3233,
        "word":"فَقَدِ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدِ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":605,
        "wordid":3552,
        "word":"إِثْمًا",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word إِثْمًا comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    },

    {
        "indexid":605,
        "wordid":5734,
        "word":"بُهْتَانًا",
        "rootid":273,
        "rootword":"ب ه ت",
        "meanings":"confound\/confuse\/dumbfound, unable to see their right course, become affected with wonder, cut short, overcome, took by surprise, caught unaware suddenly, calumny, slander, false accusation.",
        "sentence":"The word بُهْتَانًا comes from the root ب ه ت and is associated with the meanings: confound\/confuse\/dumbfound, unable to see their right course, become affected with wonder, cut short, overcome, took by surprise, caught unaware suddenly, calumny, slander, false accusation."
    },

    {
        "indexid":605,
        "wordid":5735,
        "word":"وَإِثْمًا",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word وَإِثْمًا comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    },

    {
        "indexid":605,
        "wordid":5736,
        "word":"مُبِينًا",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينًا comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":605,
        "wordid":6299,
        "word":"يَكْسِبْ",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word يَكْسِبْ comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":605,
        "wordid":6301,
        "word":"خَطِيءَةً",
        "rootid":177,
        "rootword":"خ ط ا",
        "meanings":"To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error.",
        "sentence":"The word خَطِيءَةً comes from the root خ ط ا and is associated with the meanings: To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error."
    },

    {
        "indexid":605,
        "wordid":6302,
        "word":"يَرْمِ",
        "rootid":1798,
        "rootword":"ر م ي",
        "meanings":"to throw, cast, hit by throwing, blame, cast on, charge.",
        "sentence":"The word يَرْمِ comes from the root ر م ي and is associated with the meanings: to throw, cast, hit by throwing, blame, cast on, charge."
    },

    {
        "indexid":605,
        "wordid":6303,
        "word":"بَرِيءًا",
        "rootid":306,
        "rootword":"ب ر ا",
        "meanings":"became\/was clear\/free of a thing, to quit it, become irresponsible for it, guiltless of it, remove oneself from a thing, kept far or aloof (e.g. from unclean things), state of freedom\/immunity\/security\/safety.Convalescent\/sound\/healthy, cure\/heal, recover\/restore.Create\/produce, former\/fashioner.He compounded or made a compromise with him for their mutual separation.Mankind\/creation\/beings\/things that are created.",
        "sentence":"The word بَرِيءًا comes from the root ب ر ا and is associated with the meanings: became\/was clear\/free of a thing, to quit it, become irresponsible for it, guiltless of it, remove oneself from a thing, kept far or aloof (e.g. from unclean things), state of freedom\/immunity\/security\/safety.Convalescent\/sound\/healthy, cure\/heal, recover\/restore.Create\/produce, former\/fashioner.He compounded or made a compromise with him for their mutual separation.Mankind\/creation\/beings\/things that are created."
    },

    {
        "indexid":605,
        "wordid":6304,
        "word":"احْتَمَلَ",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word احْتَمَلَ comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    }]}