{"data":[
    {
        "indexid":6056,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":6056,
        "wordid":2329,
        "word":"فَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":6056,
        "wordid":6518,
        "word":"رَسُولُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word رَسُولُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":6056,
        "wordid":19419,
        "word":"نَاقَةَ",
        "rootid":1181,
        "rootword":"ن و ق",
        "meanings":"to clean the flesh from fat, train a camel, set in order, do carefully. niiqatun - zeal, skill, daintiness, refined, best, top of a mountain, a big and long mountain. naaqatun - she camel, as it is the best thing according to Arabs.",
        "sentence":"The word نَاقَةَ comes from the root ن و ق and is associated with the meanings: to clean the flesh from fat, train a camel, set in order, do carefully. niiqatun - zeal, skill, daintiness, refined, best, top of a mountain, a big and long mountain. naaqatun - she camel, as it is the best thing according to Arabs."
    },

    {
        "indexid":6056,
        "wordid":19420,
        "word":"وَسُقْيَاهَا",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word وَسُقْيَاهَا comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    }]}