{"data":[
    {
        "indexid":606,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":606,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":606,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":606,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":606,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":606,
        "wordid":2088,
        "word":"أَنْفُسَهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسَهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":606,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":606,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":606,
        "wordid":2201,
        "word":"وَأَنْزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word وَأَنْزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":606,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":606,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":606,
        "wordid":2449,
        "word":"الْكِتَابَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":606,
        "wordid":2638,
        "word":"فَضْلُ",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word فَضْلُ comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":606,
        "wordid":2639,
        "word":"وَرَحْمَتُهُ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word وَرَحْمَتُهُ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":606,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":606,
        "wordid":3178,
        "word":"وَالْحِكْمَةَ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word وَالْحِكْمَةَ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":606,
        "wordid":4880,
        "word":"تَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":606,
        "wordid":4928,
        "word":"طَائِفَةٌ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word طَائِفَةٌ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":606,
        "wordid":4930,
        "word":"يُضِلُّونَ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word يُضِلُّونَ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":606,
        "wordid":5808,
        "word":"عَظِيمًا",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عَظِيمًا comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":606,
        "wordid":6305,
        "word":"لَهَمَّتْ",
        "rootid":115,
        "rootword":"ه م م",
        "meanings":"to worry\/regard\/care, concern, ponder anything in one's mind, desire, meditate, think about, design, anxious, plot against, intend, purpose.",
        "sentence":"The word لَهَمَّتْ comes from the root ه م م and is associated with the meanings: to worry\/regard\/care, concern, ponder anything in one's mind, desire, meditate, think about, design, anxious, plot against, intend, purpose."
    },

    {
        "indexid":606,
        "wordid":6306,
        "word":"يُضِلُّوكَ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word يُضِلُّوكَ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":606,
        "wordid":6307,
        "word":"يَضُرُّونَكَ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word يَضُرُّونَكَ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":606,
        "wordid":6308,
        "word":"وَعَلَّمَكَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَعَلَّمَكَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":606,
        "wordid":6309,
        "word":"تَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}