{"data":[
    {
        "indexid":6076,
        "wordid":4149,
        "word":"يُؤْتِي",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يُؤْتِي comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":6076,
        "wordid":4330,
        "word":"مَالَهُ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word مَالَهُ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":6076,
        "wordid":15770,
        "word":"يَتَزَكَّى",
        "rootid":467,
        "rootword":"ز ك و",
        "meanings":"it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due",
        "sentence":"The word يَتَزَكَّى comes from the root ز ك و and is associated with the meanings: it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due"
    }]}