{"data":[
    {
        "indexid":6091,
        "wordid":2345,
        "word":"أَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":6091,
        "wordid":19452,
        "word":"نَشْرَحْ",
        "rootid":253,
        "rootword":"ش ر ح",
        "meanings":"to open\/enlarge\/expand\/spread, uncover\/disclose\/explain.",
        "sentence":"The word نَشْرَحْ comes from the root ش ر ح and is associated with the meanings: to open\/enlarge\/expand\/spread, uncover\/disclose\/explain."
    },

    {
        "indexid":6091,
        "wordid":19453,
        "word":"صَدْرَكَ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word صَدْرَكَ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    }]}