{"data":[
    {
        "indexid":6093,
        "wordid":19456,
        "word":"أَنْقَضَ",
        "rootid":297,
        "rootword":"ن ق ض",
        "meanings":"to pull down, demolish, break (contract), undo a thing, violate (treaty), unravel\/untwist.",
        "sentence":"The word أَنْقَضَ comes from the root ن ق ض and is associated with the meanings: to pull down, demolish, break (contract), undo a thing, violate (treaty), unravel\/untwist."
    },

    {
        "indexid":6093,
        "wordid":19457,
        "word":"ظَهْرَكَ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظَهْرَكَ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    }]}