{"data":[
    {
        "indexid":6130,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":6130,
        "wordid":3618,
        "word":"الْفَجْرِ",
        "rootid":1452,
        "rootword":"ف ج ر",
        "meanings":"cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows.",
        "sentence":"The word الْفَجْرِ comes from the root ف ج ر and is associated with the meanings: cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows."
    },

    {
        "indexid":6130,
        "wordid":7415,
        "word":"سَلَامٌ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word سَلَامٌ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":6130,
        "wordid":19498,
        "word":"مَطْلَعِ",
        "rootid":1517,
        "rootword":"ط ل ع",
        "meanings":"to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah).",
        "sentence":"The word مَطْلَعِ comes from the root ط ل ع and is associated with the meanings: to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah)."
    }]}