{"data":[
    {
        "indexid":6140,
        "wordid":2591,
        "word":"الْأَرْضُ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضُ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":6140,
        "wordid":19513,
        "word":"وَأَخْرَجَتِ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word وَأَخْرَجَتِ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":6140,
        "wordid":19514,
        "word":"أَثْقَالَهَا",
        "rootid":731,
        "rootword":"ث ق ل",
        "meanings":"to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards.",
        "sentence":"The word أَثْقَالَهَا comes from the root ث ق ل and is associated with the meanings: to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards."
    }]}