{"data":[
    {
        "indexid":6162,
        "wordid":11057,
        "word":"الْجِبَالُ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word الْجِبَالُ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":6162,
        "wordid":18568,
        "word":"وَتَكُونُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَتَكُونُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":6162,
        "wordid":18569,
        "word":"كَالْعِهْنِ",
        "rootid":1107,
        "rootword":"ع ه ن",
        "meanings":"to whither, dry up, be broken or bent. ihn (pl. uhun) - wool, dyed wool, multicoloured wool.",
        "sentence":"The word كَالْعِهْنِ comes from the root ع ه ن and is associated with the meanings: to whither, dry up, be broken or bent. ihn (pl. uhun) - wool, dyed wool, multicoloured wool."
    },

    {
        "indexid":6162,
        "wordid":19536,
        "word":"الْمَنْفُوشِ",
        "rootid":1635,
        "rootword":"ن ف ش",
        "meanings":"to card the pie or wool, scatter or pull into pieces (cotton or wool), flatter, pasture, stray for food by night, pasture during the night without shepherd (cattle).",
        "sentence":"The word الْمَنْفُوشِ comes from the root ن ف ش and is associated with the meanings: to card the pie or wool, scatter or pull into pieces (cotton or wool), flatter, pasture, stray for food by night, pasture during the night without shepherd (cattle)."
    }]}