{"data":[
    {
        "indexid":6163,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":6163,
        "wordid":8010,
        "word":"ثَقُلَتْ",
        "rootid":731,
        "rootword":"ث ق ل",
        "meanings":"to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards.",
        "sentence":"The word ثَقُلَتْ comes from the root ث ق ل and is associated with the meanings: to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards."
    },

    {
        "indexid":6163,
        "wordid":8011,
        "word":"مَوَازِينُهُ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word مَوَازِينُهُ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    }]}