{"data":[
    {
        "indexid":6164,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":6164,
        "wordid":3565,
        "word":"فَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word فَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":6164,
        "wordid":18515,
        "word":"عِيشَةٍ",
        "rootid":517,
        "rootword":"ع ي ش",
        "meanings":"to live in a certain manner, pass ones' life, possessed of life, seek sustenance. ishatun - livelihood, time for seeking livelihood. ma'ishatun - existence, manner of living, rituals, necessities of life, means of life and subsistence, means of obtaining that whereby one lives.",
        "sentence":"The word عِيشَةٍ comes from the root ع ي ش and is associated with the meanings: to live in a certain manner, pass ones' life, possessed of life, seek sustenance. ishatun - livelihood, time for seeking livelihood. ma'ishatun - existence, manner of living, rituals, necessities of life, means of life and subsistence, means of obtaining that whereby one lives."
    },

    {
        "indexid":6164,
        "wordid":18516,
        "word":"رَاضِيَةٍ",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word رَاضِيَةٍ comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    }]}