{"data":[
    {
        "indexid":6194,
        "wordid":19571,
        "word":"لِإِيلَافِ",
        "rootid":1554,
        "rootword":"ا ل ف",
        "meanings":"he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known.",
        "sentence":"The word لِإِيلَافِ comes from the root ا ل ف and is associated with the meanings: he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known."
    },

    {
        "indexid":6194,
        "wordid":19572,
        "word":"قُرَيْشٍ",
        "rootid":1595,
        "rootword":"ق ر ش",
        "meanings":"to cut off, curtail, he gained\/earned\/acquired and collected (for his family). Big fish, victorious, name of an Arab tribe descended from Abraham of which Muhammad's grandfather was the chief.",
        "sentence":"The word قُرَيْشٍ comes from the root ق ر ش and is associated with the meanings: to cut off, curtail, he gained\/earned\/acquired and collected (for his family). Big fish, victorious, name of an Arab tribe descended from Abraham of which Muhammad's grandfather was the chief."
    }]}