{"data":[
    {
        "indexid":622,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":622,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":622,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":622,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":622,
        "wordid":2229,
        "word":"وَلَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word وَلَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":622,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":622,
        "wordid":2652,
        "word":"بَيْنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":622,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":622,
        "wordid":3934,
        "word":"وَتَتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word وَتَتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":622,
        "wordid":4056,
        "word":"النِّسَاءِ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word النِّسَاءِ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":622,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":622,
        "wordid":5577,
        "word":"تَعْدِلُوا",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word تَعْدِلُوا comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":622,
        "wordid":5703,
        "word":"رَحِيمًا",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمًا comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":622,
        "wordid":5769,
        "word":"غَفُورًا",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورًا comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":622,
        "wordid":5806,
        "word":"تَمِيلُوا",
        "rootid":1114,
        "rootword":"م ي ل",
        "meanings":"To incline or lean, bend\/propend\/tend, decline\/deviate\/deflect, conform with\/assist\/aid a person, to express love towards a person, to wrong someone, be inimical to a person, waver or vacillate between two things.",
        "sentence":"The word تَمِيلُوا comes from the root م ي ل and is associated with the meanings: To incline or lean, bend\/propend\/tend, decline\/deviate\/deflect, conform with\/assist\/aid a person, to express love towards a person, to wrong someone, be inimical to a person, waver or vacillate between two things."
    },

    {
        "indexid":622,
        "wordid":6372,
        "word":"تَسْتَطِيعُوا",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word تَسْتَطِيعُوا comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":622,
        "wordid":6373,
        "word":"حَرَصْتُمْ",
        "rootid":985,
        "rootword":"ح ر ص",
        "meanings":"To desire ardently, eagerly, strongly, covet.",
        "sentence":"The word حَرَصْتُمْ comes from the root ح ر ص and is associated with the meanings: To desire ardently, eagerly, strongly, covet."
    },

    {
        "indexid":622,
        "wordid":6374,
        "word":"الْمَيْلِ",
        "rootid":1114,
        "rootword":"م ي ل",
        "meanings":"To incline or lean, bend\/propend\/tend, decline\/deviate\/deflect, conform with\/assist\/aid a person, to express love towards a person, to wrong someone, be inimical to a person, waver or vacillate between two things.",
        "sentence":"The word الْمَيْلِ comes from the root م ي ل and is associated with the meanings: To incline or lean, bend\/propend\/tend, decline\/deviate\/deflect, conform with\/assist\/aid a person, to express love towards a person, to wrong someone, be inimical to a person, waver or vacillate between two things."
    },

    {
        "indexid":622,
        "wordid":6375,
        "word":"فَتَذَرُوهَا",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word فَتَذَرُوهَا comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":622,
        "wordid":6376,
        "word":"كَالْمُعَلَّقَةِ",
        "rootid":1761,
        "rootword":"ع ل ق",
        "meanings":"to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection.",
        "sentence":"The word كَالْمُعَلَّقَةِ comes from the root ع ل ق and is associated with the meanings: to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection."
    },

    {
        "indexid":622,
        "wordid":6377,
        "word":"تُصْلِحُوا",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word تُصْلِحُوا comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    }]}