{"data":[
    {
        "indexid":6221,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":6221,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":6221,
        "wordid":19604,
        "word":"جِيدِهَا",
        "rootid":579,
        "rootword":"ج ي د",
        "meanings":"To have a long neck, have a slender or beautiful neck.",
        "sentence":"The word جِيدِهَا comes from the root ج ي د and is associated with the meanings: To have a long neck, have a slender or beautiful neck."
    },

    {
        "indexid":6221,
        "wordid":19605,
        "word":"حَبْلٌ",
        "rootid":983,
        "rootword":"ح ب ل",
        "meanings":"tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians).",
        "sentence":"The word حَبْلٌ comes from the root ح ب ل and is associated with the meanings: tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians)."
    },

    {
        "indexid":6221,
        "wordid":19606,
        "word":"مَسَدٍ",
        "rootid":1180,
        "rootword":"م س د",
        "meanings":"To twist a rope, twist a thing well, pursue or journey laboriously or with energy, hold on or continue a journey, render (person or animal) lean\/lank\/light of flesh\/slender, render one lank in the belly, also to render it firm, tall and slender, of goodly stature, compact of make (applied to a woman).",
        "sentence":"The word مَسَدٍ comes from the root م س د and is associated with the meanings: To twist a rope, twist a thing well, pursue or journey laboriously or with energy, hold on or continue a journey, render (person or animal) lean\/lank\/light of flesh\/slender, render one lank in the belly, also to render it firm, tall and slender, of goodly stature, compact of make (applied to a woman)."
    }]}