{"data":[
    {
        "indexid":6234,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":6234,
        "wordid":19612,
        "word":"شَرِّ",
        "rootid":546,
        "rootword":"ش ر ر",
        "meanings":"to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire.",
        "sentence":"The word شَرِّ comes from the root ش ر ر and is associated with the meanings: to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire."
    },

    {
        "indexid":6234,
        "wordid":19620,
        "word":"الْوَسْوَاسِ",
        "rootid":658,
        "rootword":"و س و س",
        "meanings":"to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer.",
        "sentence":"The word الْوَسْوَاسِ comes from the root و س و س and is associated with the meanings: to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer."
    },

    {
        "indexid":6234,
        "wordid":19621,
        "word":"الْخَنَّاسِ",
        "rootid":1563,
        "rootword":"خ ن س",
        "meanings":"To retreat\/recede\/drawback, retire or hold back, lag behind, shrink and hide\/withdraw oneself, remain behind a company of people (as opposed to going with them [ syn. takhallafa] ), sneak something away (so as not to be seen), keep one back, place one behind or after, contract\/draw together or make to contract\/draw together.",
        "sentence":"The word الْخَنَّاسِ comes from the root خ ن س and is associated with the meanings: To retreat\/recede\/drawback, retire or hold back, lag behind, shrink and hide\/withdraw oneself, remain behind a company of people (as opposed to going with them [ syn. takhallafa] ), sneak something away (so as not to be seen), keep one back, place one behind or after, contract\/draw together or make to contract\/draw together."
    }]}