{"data":[
    {
        "indexid":662,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":662,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":662,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":662,
        "wordid":2894,
        "word":"أَبَدًا",
        "rootid":450,
        "rootword":"ا ب د",
        "meanings":"he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction).",
        "sentence":"The word أَبَدًا comes from the root ا ب د and is associated with the meanings: he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction)."
    },

    {
        "indexid":662,
        "wordid":3392,
        "word":"خَالِدِينَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word خَالِدِينَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":662,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":662,
        "wordid":5817,
        "word":"يَسِيرًا",
        "rootid":706,
        "rootword":"ي س ر",
        "meanings":"become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling.",
        "sentence":"The word يَسِيرًا comes from the root ي س ر and is associated with the meanings: become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling."
    },

    {
        "indexid":662,
        "wordid":6515,
        "word":"طَرِيقَ",
        "rootid":539,
        "rootword":"ط ر ق",
        "meanings":"to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour.",
        "sentence":"The word طَرِيقَ comes from the root ط ر ق and is associated with the meanings: to come by night, beat something, knock, strike, tariq - one who comes or appears by night, morning star that comes at the end of the night, night-visitant, star, tariqan - way\/path, line of conduct, behaviour."
    }]}