{"data":[
    {
        "indexid":670,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":670,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":670,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":670,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":670,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":670,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":670,
        "wordid":3050,
        "word":"يَحْكُمُ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word يَحْكُمُ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":670,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":670,
        "wordid":6330,
        "word":"الْأَنْعَامِ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word الْأَنْعَامِ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":670,
        "wordid":6352,
        "word":"يُتْلَى",
        "rootid":920,
        "rootword":"ت ل و",
        "meanings":"To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing.",
        "sentence":"The word يُتْلَى comes from the root ت ل و and is associated with the meanings: To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing."
    },

    {
        "indexid":670,
        "wordid":6482,
        "word":"أُحِلَّتْ",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word أُحِلَّتْ comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":670,
        "wordid":6549,
        "word":"أَوْفُوا",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word أَوْفُوا comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":670,
        "wordid":6550,
        "word":"بِالْعُقُودِ",
        "rootid":104,
        "rootword":"ع ق د",
        "meanings":"to tie in a knot, make a knot, strike a bargain, contract, make a compact, enter into an obligation, bind, judgement, consideration of one's affairs, management, promise of obedience or vow of allegiance.. . 'aqadat (prf. 3rd. f. sing.): she made a covenant, ratified agreements.. 'aqadtum (prf. 2nd. m. pl.): We bound, took in earnest.. 'uquud (n. pl.): obligation. Its sing. is 'aqdun \/ 'uqdatun (n.): knot, tie, firm resolution, judgement, consideration of one's affairs, management regulating and ordering of one's affairs. It also signifies a promise of obedience or vow of allegiance.",
        "sentence":"The word بِالْعُقُودِ comes from the root ع ق د and is associated with the meanings: to tie in a knot, make a knot, strike a bargain, contract, make a compact, enter into an obligation, bind, judgement, consideration of one's affairs, management, promise of obedience or vow of allegiance.. . 'aqadat (prf. 3rd. f. sing.): she made a covenant, ratified agreements.. 'aqadtum (prf. 2nd. m. pl.): We bound, took in earnest.. 'uquud (n. pl.): obligation. Its sing. is 'aqdun \/ 'uqdatun (n.): knot, tie, firm resolution, judgement, consideration of one's affairs, management regulating and ordering of one's affairs. It also signifies a promise of obedience or vow of allegiance."
    },

    {
        "indexid":670,
        "wordid":6551,
        "word":"بَهِيمَةُ",
        "rootid":1140,
        "rootword":"ب ه م",
        "meanings":"animals that pasture\/graze, lamb\/goat\/sheep, animals of the bovine kind, stay\/remain in a place, not to quit, continue to look at a thing without being relieved by doing so, silent\/confounded\/perplexed to a thing, not to fight or engage in conflict, a thing dubious\/vague\/confused, closed\/locked door, courageous man, beasts\/brutes.",
        "sentence":"The word بَهِيمَةُ comes from the root ب ه م and is associated with the meanings: animals that pasture\/graze, lamb\/goat\/sheep, animals of the bovine kind, stay\/remain in a place, not to quit, continue to look at a thing without being relieved by doing so, silent\/confounded\/perplexed to a thing, not to fight or engage in conflict, a thing dubious\/vague\/confused, closed\/locked door, courageous man, beasts\/brutes."
    },

    {
        "indexid":670,
        "wordid":6552,
        "word":"مُحِلِّي",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word مُحِلِّي comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":670,
        "wordid":6553,
        "word":"الصَّيْدِ",
        "rootid":106,
        "rootword":"ص ي د",
        "meanings":"to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray.",
        "sentence":"The word الصَّيْدِ comes from the root ص ي د and is associated with the meanings: to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray."
    },

    {
        "indexid":670,
        "wordid":6554,
        "word":"حُرُمٌ",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حُرُمٌ comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    }]}