{"data":[
    {
        "indexid":675,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":675,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":675,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":675,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":675,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":675,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":675,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":675,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":675,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":675,
        "wordid":2202,
        "word":"مَاءً",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءً comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":675,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":675,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":675,
        "wordid":2508,
        "word":"تَشْكُرُونَ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word تَشْكُرُونَ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    },

    {
        "indexid":675,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":675,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":675,
        "wordid":3295,
        "word":"وُجُوهَكُمْ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وُجُوهَكُمْ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":675,
        "wordid":3442,
        "word":"طَيِّبًا",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word طَيِّبًا comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":675,
        "wordid":3557,
        "word":"سَفَرٍ",
        "rootid":1465,
        "rootword":"س ف ر",
        "meanings":"to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write.",
        "sentence":"The word سَفَرٍ comes from the root س ف ر and is associated with the meanings: to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write."
    },

    {
        "indexid":675,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":675,
        "wordid":3915,
        "word":"النِّسَاءَ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word النِّسَاءَ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":675,
        "wordid":4513,
        "word":"تَجِدُوا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word تَجِدُوا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":675,
        "wordid":4940,
        "word":"أَحَدٌ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدٌ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":675,
        "wordid":5341,
        "word":"لِيَجْعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word لِيَجْعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":675,
        "wordid":5901,
        "word":"جُنُبًا",
        "rootid":1358,
        "rootword":"ج ن ب",
        "meanings":"To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of.",
        "sentence":"The word جُنُبًا comes from the root ج ن ب and is associated with the meanings: To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of."
    },

    {
        "indexid":675,
        "wordid":5905,
        "word":"مَرْضَى",
        "rootid":1602,
        "rootword":"م ر ض",
        "meanings":"To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion).",
        "sentence":"The word مَرْضَى comes from the root م ر ض and is associated with the meanings: To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion)."
    },

    {
        "indexid":675,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":675,
        "wordid":5907,
        "word":"الْغَائِطِ",
        "rootid":1567,
        "rootword":"غ و ط",
        "meanings":"enter\/sank into a thing, become hidden\/ descended\/sloped in the ground, dug\/excavated\/hollowed out, make deep, cavity\/pit, Lane gives the example of 4:43 & 5:6 to mean \"place in which one satisfies a want of nature\" (i.e. toilet), human excrement",
        "sentence":"The word الْغَائِطِ comes from the root غ و ط and is associated with the meanings: enter\/sank into a thing, become hidden\/ descended\/sloped in the ground, dug\/excavated\/hollowed out, make deep, cavity\/pit, Lane gives the example of 4:43 & 5:6 to mean \"place in which one satisfies a want of nature\" (i.e. toilet), human excrement"
    },

    {
        "indexid":675,
        "wordid":5908,
        "word":"لَامَسْتُمُ",
        "rootid":1324,
        "rootword":"ل م س",
        "meanings":"To touch, feel with the hand, to stretch towards, seek, inquire after, have intercourse.",
        "sentence":"The word لَامَسْتُمُ comes from the root ل م س and is associated with the meanings: To touch, feel with the hand, to stretch towards, seek, inquire after, have intercourse."
    },

    {
        "indexid":675,
        "wordid":5909,
        "word":"فَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word فَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":675,
        "wordid":5910,
        "word":"فَتَيَمَّمُوا",
        "rootid":405,
        "rootword":"ي م م",
        "meanings":"sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for.",
        "sentence":"The word فَتَيَمَّمُوا comes from the root ي م م and is associated with the meanings: sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for."
    },

    {
        "indexid":675,
        "wordid":5911,
        "word":"صَعِيدًا",
        "rootid":653,
        "rootword":"ص ع د",
        "meanings":"to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up.",
        "sentence":"The word صَعِيدًا comes from the root ص ع د and is associated with the meanings: to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up."
    },

    {
        "indexid":675,
        "wordid":5912,
        "word":"فَامْسَحُوا",
        "rootid":1564,
        "rootword":"م س ح",
        "meanings":"to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah",
        "sentence":"The word فَامْسَحُوا comes from the root م س ح and is associated with the meanings: to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah"
    },

    {
        "indexid":675,
        "wordid":5913,
        "word":"بِوُجُوهِكُمْ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word بِوُجُوهِكُمْ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":675,
        "wordid":5914,
        "word":"وَأَيْدِيكُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word وَأَيْدِيكُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":675,
        "wordid":6244,
        "word":"الصَّلَوةِ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةِ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":675,
        "wordid":6611,
        "word":"قُمْتُمْ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قُمْتُمْ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":675,
        "wordid":6612,
        "word":"فَاغْسِلُوا",
        "rootid":3,
        "rootword":"غ س ل",
        "meanings":"wash, removing of dirt or filth, cleanse; covered much or often; water with which one washes himself; a certain plant, growing in places that exude water and produce salt; a place in which the dead are washed",
        "sentence":"The word فَاغْسِلُوا comes from the root غ س ل and is associated with the meanings: wash, removing of dirt or filth, cleanse; covered much or often; water with which one washes himself; a certain plant, growing in places that exude water and produce salt; a place in which the dead are washed"
    },

    {
        "indexid":675,
        "wordid":6613,
        "word":"وَأَيْدِيَكُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word وَأَيْدِيَكُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":675,
        "wordid":6614,
        "word":"الْمَرَافِقِ",
        "rootid":1367,
        "rootword":"ر ف ق",
        "meanings":"to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow.",
        "sentence":"The word الْمَرَافِقِ comes from the root ر ف ق and is associated with the meanings: to be useful, do service, tie by the shoulders, be gentle to, be in company, help, be compassionate. rafiq - companion, friend, comrade, colleague, gentle. mirfaq - elbow, pillow, easy arrangement, thing by which one gains benefit. murtafaq - resting place, pillow."
    },

    {
        "indexid":675,
        "wordid":6615,
        "word":"وَامْسَحُوا",
        "rootid":1564,
        "rootword":"م س ح",
        "meanings":"to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah",
        "sentence":"The word وَامْسَحُوا comes from the root م س ح and is associated with the meanings: to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah"
    },

    {
        "indexid":675,
        "wordid":6616,
        "word":"بِرُءُوسِكُمْ",
        "rootid":1298,
        "rootword":"ر ا س",
        "meanings":"head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people.",
        "sentence":"The word بِرُءُوسِكُمْ comes from the root ر ا س and is associated with the meanings: head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people."
    },

    {
        "indexid":675,
        "wordid":6617,
        "word":"وَأَرْجُلَكُمْ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word وَأَرْجُلَكُمْ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":675,
        "wordid":6618,
        "word":"الْكَعْبَيْنِ",
        "rootid":690,
        "rootword":"ك ع ب",
        "meanings":"swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97.",
        "sentence":"The word الْكَعْبَيْنِ comes from the root ك ع ب and is associated with the meanings: swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97."
    },

    {
        "indexid":675,
        "wordid":6619,
        "word":"فَاطَّهَّرُوا",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word فَاطَّهَّرُوا comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    },

    {
        "indexid":675,
        "wordid":6620,
        "word":"حَرَجٍ",
        "rootid":1284,
        "rootword":"ح ر ج",
        "meanings":"To be contracted (heart), oppressed, become narrow, disquieted in reason.",
        "sentence":"The word حَرَجٍ comes from the root ح ر ج and is associated with the meanings: To be contracted (heart), oppressed, become narrow, disquieted in reason."
    },

    {
        "indexid":675,
        "wordid":6621,
        "word":"لِيُطَهِّرَكُمْ",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word لِيُطَهِّرَكُمْ comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    },

    {
        "indexid":675,
        "wordid":6622,
        "word":"وَلِيُتِمَّ",
        "rootid":536,
        "rootword":"ت م م",
        "meanings":"To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard.",
        "sentence":"The word وَلِيُتِمَّ comes from the root ت م م and is associated with the meanings: To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard."
    },

    {
        "indexid":675,
        "wordid":6623,
        "word":"نِعْمَتَهُ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَتَهُ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    }]}