{"data":[
    {
        "indexid":704,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":704,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":704,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":704,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":704,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":704,
        "wordid":3610,
        "word":"وَابْتَغُوا",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word وَابْتَغُوا comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":704,
        "wordid":3650,
        "word":"تُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word تُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":704,
        "wordid":4439,
        "word":"اتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word اتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":704,
        "wordid":6778,
        "word":"الْوَسِيلَةَ",
        "rootid":1695,
        "rootword":"و س ل",
        "meanings":"to seek the favour, seek the means of nearness\/approach\/access, honourable, rank, degree, affinity, tie, nearness, come closer.",
        "sentence":"The word الْوَسِيلَةَ comes from the root و س ل and is associated with the meanings: to seek the favour, seek the means of nearness\/approach\/access, honourable, rank, degree, affinity, tie, nearness, come closer."
    },

    {
        "indexid":704,
        "wordid":6779,
        "word":"وَجَاهِدُوا",
        "rootid":398,
        "rootword":"ج ه د",
        "meanings":"To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties.",
        "sentence":"The word وَجَاهِدُوا comes from the root ج ه د and is associated with the meanings: To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties."
    },

    {
        "indexid":704,
        "wordid":6780,
        "word":"سَبِيلِهِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِهِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    }]}