{"data":[
    {
        "indexid":713,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":713,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":713,
        "wordid":2032,
        "word":"هُدًى",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word هُدًى comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":713,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":713,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":713,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":713,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":713,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":713,
        "wordid":2428,
        "word":"تَشْتَرُوا",
        "rootid":120,
        "rootword":"ش ر ي",
        "meanings":"to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another.",
        "sentence":"The word تَشْتَرُوا comes from the root ش ر ي and is associated with the meanings: to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another."
    },

    {
        "indexid":713,
        "wordid":2430,
        "word":"ثَمَنًا",
        "rootid":80,
        "rootword":"ث م ن",
        "meanings":"to take the eighth part of any ones goods, eight, eighteen, eighty.",
        "sentence":"The word ثَمَنًا comes from the root ث م ن and is associated with the meanings: to take the eighth part of any ones goods, eight, eighteen, eighty."
    },

    {
        "indexid":713,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":713,
        "wordid":2444,
        "word":"النَّاسَ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسَ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":713,
        "wordid":2617,
        "word":"وَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":713,
        "wordid":2619,
        "word":"هَادُوا",
        "rootid":360,
        "rootword":"ه و د",
        "meanings":"(Ya-ha-Dal) Jews",
        "sentence":"The word هَادُوا comes from the root ه و د and is associated with the meanings: (Ya-ha-Dal) Jews"
    },

    {
        "indexid":713,
        "wordid":2776,
        "word":"فَأُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word فَأُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":713,
        "wordid":2864,
        "word":"أَنْزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أَنْزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":713,
        "wordid":2925,
        "word":"أَنْزَلْنَا",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أَنْزَلْنَا comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":713,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":713,
        "wordid":3050,
        "word":"يَحْكُمُ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word يَحْكُمُ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":713,
        "wordid":3202,
        "word":"شُهَدَاءَ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شُهَدَاءَ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":713,
        "wordid":3229,
        "word":"النَّبِيُّونَ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word النَّبِيُّونَ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":713,
        "wordid":4653,
        "word":"أَسْلَمُوا",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word أَسْلَمُوا comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":713,
        "wordid":4663,
        "word":"كِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":713,
        "wordid":6441,
        "word":"الْكَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":713,
        "wordid":6589,
        "word":"وَاخْشَوْنِ",
        "rootid":649,
        "rootword":"خ ش ي",
        "meanings":"To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary.",
        "sentence":"The word وَاخْشَوْنِ comes from the root خ ش ي and is associated with the meanings: To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary."
    },

    {
        "indexid":713,
        "wordid":6819,
        "word":"وَنُورٌ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word وَنُورٌ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":713,
        "wordid":6820,
        "word":"وَالرَّبَّانِيُّونَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word وَالرَّبَّانِيُّونَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":713,
        "wordid":6821,
        "word":"وَالْأَحْبَارُ",
        "rootid":1249,
        "rootword":"ح ب ر",
        "meanings":"To make beautiful, delight, be joyful, cheer anyone. Habbara: To put ink.",
        "sentence":"The word وَالْأَحْبَارُ comes from the root ح ب ر and is associated with the meanings: To make beautiful, delight, be joyful, cheer anyone. Habbara: To put ink."
    },

    {
        "indexid":713,
        "wordid":6822,
        "word":"اسْتُحْفِظُوا",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word اسْتُحْفِظُوا comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":713,
        "wordid":6823,
        "word":"تَخْشَوُا",
        "rootid":649,
        "rootword":"خ ش ي",
        "meanings":"To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary.",
        "sentence":"The word تَخْشَوُا comes from the root خ ش ي and is associated with the meanings: To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary."
    },

    {
        "indexid":713,
        "wordid":6824,
        "word":"يَحْكُمْ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word يَحْكُمْ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    }]}