{"data":[
    {
        "indexid":734,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":734,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":734,
        "wordid":2811,
        "word":"الْكِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":734,
        "wordid":2978,
        "word":"وَاتَّقَوْا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word وَاتَّقَوْا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":734,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":734,
        "wordid":5542,
        "word":"سَيِّئَاتِهِمْ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَيِّئَاتِهِمْ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":734,
        "wordid":6944,
        "word":"أَهْلَ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلَ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":734,
        "wordid":6945,
        "word":"لَكَفَّرْنَا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word لَكَفَّرْنَا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":734,
        "wordid":6946,
        "word":"وَلَأَدْخَلْنَاهُمْ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word وَلَأَدْخَلْنَاهُمْ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":734,
        "wordid":6947,
        "word":"جَنَّاتِ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word جَنَّاتِ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":734,
        "wordid":6948,
        "word":"النَّعِيمِ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word النَّعِيمِ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    }]}