{"data":[
    {
        "indexid":748,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":748,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":748,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":748,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":748,
        "wordid":2695,
        "word":"يَفْعَلُونَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word يَفْعَلُونَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":748,
        "wordid":6025,
        "word":"فَعَلُوهُ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَعَلُوهُ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":748,
        "wordid":6925,
        "word":"لَبِئْسَ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word لَبِئْسَ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":748,
        "wordid":6990,
        "word":"يَتَنَاهَوْنَ",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word يَتَنَاهَوْنَ comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":748,
        "wordid":6991,
        "word":"مُنْكَرٍ",
        "rootid":1601,
        "rootword":"ن ك ر",
        "meanings":"to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge.",
        "sentence":"The word مُنْكَرٍ comes from the root ن ك ر and is associated with the meanings: to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge."
    }]}