{"data":[
    {
        "indexid":759,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":759,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":759,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":759,
        "wordid":3650,
        "word":"تُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word تُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":759,
        "wordid":7030,
        "word":"الْخَمْرُ",
        "rootid":1438,
        "rootword":"خ م ر",
        "meanings":"cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured.",
        "sentence":"The word الْخَمْرُ comes from the root خ م ر and is associated with the meanings: cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured."
    },

    {
        "indexid":759,
        "wordid":7031,
        "word":"وَالْمَيْسِرُ",
        "rootid":706,
        "rootword":"ي س ر",
        "meanings":"become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling.",
        "sentence":"The word وَالْمَيْسِرُ comes from the root ي س ر and is associated with the meanings: become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling."
    },

    {
        "indexid":759,
        "wordid":7032,
        "word":"وَالْأَنْصَابُ",
        "rootid":296,
        "rootword":"ن ص ب",
        "meanings":"to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant.",
        "sentence":"The word وَالْأَنْصَابُ comes from the root ن ص ب and is associated with the meanings: to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant."
    },

    {
        "indexid":759,
        "wordid":7033,
        "word":"وَالْأَزْلَامُ",
        "rootid":917,
        "rootword":"ز ل م",
        "meanings":"to cut off anything projecting or prominent, make little in quantity\/amount, to fill, make an arrow, an arrow without head or feathers, divining arrow.",
        "sentence":"The word وَالْأَزْلَامُ comes from the root ز ل م and is associated with the meanings: to cut off anything projecting or prominent, make little in quantity\/amount, to fill, make an arrow, an arrow without head or feathers, divining arrow."
    },

    {
        "indexid":759,
        "wordid":7034,
        "word":"رِجْسٌ",
        "rootid":61,
        "rootword":"ر ج س",
        "meanings":"to disgrace and defile, thunder, commit foul deeds, bellow loudly, become hated, something in which there is no good, state of commotion, confuse greatly, make a noise\/sound, hinder\/prevent, unclean\/dirty\/filthy, evil, something which is unlawful\/forbidden, unbelief\/infidelity\/doubt.",
        "sentence":"The word رِجْسٌ comes from the root ر ج س and is associated with the meanings: to disgrace and defile, thunder, commit foul deeds, bellow loudly, become hated, something in which there is no good, state of commotion, confuse greatly, make a noise\/sound, hinder\/prevent, unclean\/dirty\/filthy, evil, something which is unlawful\/forbidden, unbelief\/infidelity\/doubt."
    },

    {
        "indexid":759,
        "wordid":7035,
        "word":"عَمَلِ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word عَمَلِ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":759,
        "wordid":7036,
        "word":"فَاجْتَنِبُوهُ",
        "rootid":1358,
        "rootword":"ج ن ب",
        "meanings":"To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of.",
        "sentence":"The word فَاجْتَنِبُوهُ comes from the root ج ن ب and is associated with the meanings: To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of."
    }]}