{"data":[
    {
        "indexid":764,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":764,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":764,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":764,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":764,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":764,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":764,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":764,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":764,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":764,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":764,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":764,
        "wordid":2989,
        "word":"ذُو",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذُو comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":764,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":764,
        "wordid":3050,
        "word":"يَحْكُمُ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word يَحْكُمُ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":764,
        "wordid":3563,
        "word":"طَعَامُ",
        "rootid":1791,
        "rootword":"ط ع م",
        "meanings":"ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating.",
        "sentence":"The word طَعَامُ comes from the root ط ع م and is associated with the meanings: ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating."
    },

    {
        "indexid":764,
        "wordid":3792,
        "word":"عَزِيزٌ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word عَزِيزٌ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":764,
        "wordid":3964,
        "word":"مِثْلُ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مِثْلُ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":764,
        "wordid":4429,
        "word":"سَلَفَ",
        "rootid":1270,
        "rootword":"س ل ف",
        "meanings":"to be past (event), outgo, proceed, predecessor\/ancestor, sent in advance.",
        "sentence":"The word سَلَفَ comes from the root س ل ف and is associated with the meanings: to be past (event), outgo, proceed, predecessor\/ancestor, sent in advance."
    },

    {
        "indexid":764,
        "wordid":4431,
        "word":"عَادَ",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word عَادَ comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":764,
        "wordid":4558,
        "word":"انْتِقَامٍ",
        "rootid":1343,
        "rootword":"ن ق م",
        "meanings":"to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment.",
        "sentence":"The word انْتِقَامٍ comes from the root ن ق م and is associated with the meanings: to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment."
    },

    {
        "indexid":764,
        "wordid":5300,
        "word":"عَفَا",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word عَفَا comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    },

    {
        "indexid":764,
        "wordid":5812,
        "word":"تَقْتُلُوا",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word تَقْتُلُوا comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":764,
        "wordid":6177,
        "word":"قَتَلَ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قَتَلَ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":764,
        "wordid":6190,
        "word":"مُتَعَمِّدًا",
        "rootid":1255,
        "rootword":"ع م د",
        "meanings":"to intend, support, place columns or pillars, place lofty structure, prop up, resolve, aim, direct, propose, commit (a sin intentionally), lofty structure, tent, pole, base, chief.",
        "sentence":"The word مُتَعَمِّدًا comes from the root ع م د and is associated with the meanings: to intend, support, place columns or pillars, place lofty structure, prop up, resolve, aim, direct, propose, commit (a sin intentionally), lofty structure, tent, pole, base, chief."
    },

    {
        "indexid":764,
        "wordid":6554,
        "word":"حُرُمٌ",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حُرُمٌ comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":764,
        "wordid":6838,
        "word":"كَفَّارَةٌ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَّارَةٌ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":764,
        "wordid":7020,
        "word":"مَسَاكِينَ",
        "rootid":14,
        "rootword":"س ك ن",
        "meanings":"to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering.",
        "sentence":"The word مَسَاكِينَ comes from the root س ك ن and is associated with the meanings: to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering."
    },

    {
        "indexid":764,
        "wordid":7055,
        "word":"الصَّيْدَ",
        "rootid":106,
        "rootword":"ص ي د",
        "meanings":"to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray.",
        "sentence":"The word الصَّيْدَ comes from the root ص ي د and is associated with the meanings: to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray."
    },

    {
        "indexid":764,
        "wordid":7056,
        "word":"قَتَلَهُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قَتَلَهُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":764,
        "wordid":7057,
        "word":"فَجَزَاءٌ",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word فَجَزَاءٌ comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":764,
        "wordid":7058,
        "word":"النَّعَمِ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word النَّعَمِ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":764,
        "wordid":7059,
        "word":"ذَوَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَوَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":764,
        "wordid":7060,
        "word":"عَدْلٍ",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word عَدْلٍ comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":764,
        "wordid":7061,
        "word":"هَدْيًا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word هَدْيًا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":764,
        "wordid":7062,
        "word":"بَالِغَ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word بَالِغَ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    },

    {
        "indexid":764,
        "wordid":7063,
        "word":"الْكَعْبَةِ",
        "rootid":690,
        "rootword":"ك ع ب",
        "meanings":"swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97.",
        "sentence":"The word الْكَعْبَةِ comes from the root ك ع ب and is associated with the meanings: swell\/prominent\/protuberant\/projection\/budding (common examples include a woman's breasts), jointed-stem, fold, went away, joint\/juncture\/division of bones (more commonly the ankle bone), tarsus (in animals), swift, eminence\/nobility\/glory, anything elevated, square\/cubic house\/chamber, square-form, to hasten, to go away paying no regard to anything. Quote from Lane's lexicon: \"a house or temple belonging to the tribe of Rabee'ah, who used to compass it, or perform circuits round it (as is done round the Kabbeh of Mekkeh)\".. . Hans Wehr - Knot, knob, node (of cane); joint, articulation, ankles, anklebone; heel (of foot or shoe) ferule; die; cube; high rank, fame, glory, honor.. . Everything that the male of the form fa'lun (being the representation of the Cl. Arabic form in question, universally applied to all roots) can mean, so can the female (fa'latun or modernly and colloquially fa'lah), with the added meaning of emphasis that the feminization of the word gives; where it is clear that there could be intensification. The female form can be found in 5:95, 5:97."
    },

    {
        "indexid":764,
        "wordid":7064,
        "word":"عَدْلُ",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word عَدْلُ comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":764,
        "wordid":7065,
        "word":"صِيَامًا",
        "rootid":792,
        "rootword":"ص و م",
        "meanings":"to fast\/abstain.",
        "sentence":"The word صِيَامًا comes from the root ص و م and is associated with the meanings: to fast\/abstain."
    },

    {
        "indexid":764,
        "wordid":7066,
        "word":"لِيَذُوقَ",
        "rootid":1121,
        "rootword":"ذ و ق",
        "meanings":"to taste\/experience\/try\/perceive. One who tastes, cause to taste.",
        "sentence":"The word لِيَذُوقَ comes from the root ذ و ق and is associated with the meanings: to taste\/experience\/try\/perceive. One who tastes, cause to taste."
    },

    {
        "indexid":764,
        "wordid":7067,
        "word":"وَبَالَ",
        "rootid":1005,
        "rootword":"و ب ل",
        "meanings":"to pour forth, rain to in large drops, pursue eagerly.",
        "sentence":"The word وَبَالَ comes from the root و ب ل and is associated with the meanings: to pour forth, rain to in large drops, pursue eagerly."
    },

    {
        "indexid":764,
        "wordid":7068,
        "word":"أَمْرِهِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرِهِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":764,
        "wordid":7069,
        "word":"فَيَنْتَقِمُ",
        "rootid":1343,
        "rootword":"ن ق م",
        "meanings":"to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment.",
        "sentence":"The word فَيَنْتَقِمُ comes from the root ن ق م and is associated with the meanings: to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment."
    }]}