{"data":[
    {
        "indexid":772,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":772,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":772,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":772,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":772,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":772,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":772,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":772,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":772,
        "wordid":2948,
        "word":"وَلَكِنَّ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنَّ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":772,
        "wordid":3416,
        "word":"يَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word يَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":772,
        "wordid":4667,
        "word":"يَفْتَرُونَ",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word يَفْتَرُونَ comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    },

    {
        "indexid":772,
        "wordid":4953,
        "word":"الْكَذِبَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word الْكَذِبَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":772,
        "wordid":7095,
        "word":"بَحِيرَةٍ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word بَحِيرَةٍ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":772,
        "wordid":7096,
        "word":"سَائِبَةٍ",
        "rootid":1451,
        "rootword":"س ي ب",
        "meanings":"to wander at random, be set free to pasture. saibatun (from saba) - it ran by itself and wandered at random and was set free to pasture. It signifies any domestic beast left to pasture without attention. Liberation of certain domestic animals to pasture and prohibiting their use or slaughter in honour of idols was a practice the Arabs in pre-Islamic days. They were selected mainly on the basis of the number, sex and sequence of their springs. According to some the animal set free was to be the mother of a bahirah an animal which had brought forth females at successive births.",
        "sentence":"The word سَائِبَةٍ comes from the root س ي ب and is associated with the meanings: to wander at random, be set free to pasture. saibatun (from saba) - it ran by itself and wandered at random and was set free to pasture. It signifies any domestic beast left to pasture without attention. Liberation of certain domestic animals to pasture and prohibiting their use or slaughter in honour of idols was a practice the Arabs in pre-Islamic days. They were selected mainly on the basis of the number, sex and sequence of their springs. According to some the animal set free was to be the mother of a bahirah an animal which had brought forth females at successive births."
    },

    {
        "indexid":772,
        "wordid":7097,
        "word":"وَصِيلَةٍ",
        "rootid":1686,
        "rootword":"و ص ل",
        "meanings":"attain, reach, connect, apply, make close, to come\/deliver\/convey, to continue, union (of companions\/friends\/lovers).",
        "sentence":"The word وَصِيلَةٍ comes from the root و ص ل and is associated with the meanings: attain, reach, connect, apply, make close, to come\/deliver\/convey, to continue, union (of companions\/friends\/lovers)."
    },

    {
        "indexid":772,
        "wordid":7098,
        "word":"حَامٍ",
        "rootid":1521,
        "rootword":"ح م ي",
        "meanings":"To protect\/prohibit\/guard\/defend against encroachment\/attack. A thing prohibited. Vehement\/angry, it was\/became hot (e.g. day, oven), disdain\/scorn\/indignation.",
        "sentence":"The word حَامٍ comes from the root ح م ي and is associated with the meanings: To protect\/prohibit\/guard\/defend against encroachment\/attack. A thing prohibited. Vehement\/angry, it was\/became hot (e.g. day, oven), disdain\/scorn\/indignation."
    },

    {
        "indexid":772,
        "wordid":7099,
        "word":"وَأَكْثَرُهُمْ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word وَأَكْثَرُهُمْ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    }]}