{"data":[
    {
        "indexid":775,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":775,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":775,
        "wordid":2079,
        "word":"بِاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word بِاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":775,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":775,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":775,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":775,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":775,
        "wordid":2167,
        "word":"الْمَوْتِ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتِ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":775,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":775,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":775,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":775,
        "wordid":2430,
        "word":"ثَمَنًا",
        "rootid":80,
        "rootword":"ث م ن",
        "meanings":"to take the eighth part of any ones goods, eight, eighteen, eighty.",
        "sentence":"The word ثَمَنًا comes from the root ث م ن and is associated with the meanings: to take the eighth part of any ones goods, eight, eighteen, eighty."
    },

    {
        "indexid":775,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":775,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":775,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":775,
        "wordid":3188,
        "word":"لَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word لَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":775,
        "wordid":3203,
        "word":"حَضَرَ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word حَضَرَ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    },

    {
        "indexid":775,
        "wordid":3205,
        "word":"الْمَوْتُ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتُ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":775,
        "wordid":3536,
        "word":"أَحَدَكُمُ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدَكُمُ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":775,
        "wordid":3865,
        "word":"إِنِ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنِ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":4114,
        "word":"ذَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":6195,
        "word":"ضَرَبْتُمْ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word ضَرَبْتُمْ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":775,
        "wordid":6244,
        "word":"الصَّلَوةِ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةِ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":775,
        "wordid":7059,
        "word":"ذَوَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَوَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":775,
        "wordid":7060,
        "word":"عَدْلٍ",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word عَدْلٍ comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":775,
        "wordid":7091,
        "word":"حِينَ",
        "rootid":1658,
        "rootword":"ح ي ن",
        "meanings":"(Ha-Alif-Nun) To arrive, come, be at hand (time, season), be fit, be reaped.",
        "sentence":"The word حِينَ comes from the root ح ي ن and is associated with the meanings: (Ha-Alif-Nun) To arrive, come, be at hand (time, season), be fit, be reaped."
    },

    {
        "indexid":775,
        "wordid":7102,
        "word":"شَهَادَةُ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شَهَادَةُ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":775,
        "wordid":7103,
        "word":"بَيْنِكُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنِكُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":775,
        "wordid":7104,
        "word":"الْوَصِيَّةِ",
        "rootid":1754,
        "rootword":"و ص ي",
        "meanings":"to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will.",
        "sentence":"The word الْوَصِيَّةِ comes from the root و ص ي and is associated with the meanings: to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will."
    },

    {
        "indexid":775,
        "wordid":7105,
        "word":"اثْنَانِ",
        "rootid":1651,
        "rootword":"ث ن ي",
        "meanings":"to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing.",
        "sentence":"The word اثْنَانِ comes from the root ث ن ي and is associated with the meanings: to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing."
    },

    {
        "indexid":775,
        "wordid":7106,
        "word":"ءَاخَرَانِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word ءَاخَرَانِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":775,
        "wordid":7107,
        "word":"غَيْرِكُمْ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرِكُمْ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":775,
        "wordid":7108,
        "word":"فَأَصَابَتْكُمْ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word فَأَصَابَتْكُمْ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":775,
        "wordid":7109,
        "word":"مُصِيبَةُ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word مُصِيبَةُ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":775,
        "wordid":7110,
        "word":"تَحْبِسُونَهُمَا",
        "rootid":692,
        "rootword":"ح ب س",
        "meanings":"To detain, restrain, hinder, shut up, confine, prevent, hold in custody.",
        "sentence":"The word تَحْبِسُونَهُمَا comes from the root ح ب س and is associated with the meanings: To detain, restrain, hinder, shut up, confine, prevent, hold in custody."
    },

    {
        "indexid":775,
        "wordid":7111,
        "word":"فَيُقْسِمَانِ",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word فَيُقْسِمَانِ comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    },

    {
        "indexid":775,
        "wordid":7112,
        "word":"ارْتَبْتُمْ",
        "rootid":1347,
        "rootword":"ر ي ب",
        "meanings":"to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge.",
        "sentence":"The word ارْتَبْتُمْ comes from the root ر ي ب and is associated with the meanings: to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge."
    },

    {
        "indexid":775,
        "wordid":7113,
        "word":"نَشْتَرِي",
        "rootid":120,
        "rootword":"ش ر ي",
        "meanings":"to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another.",
        "sentence":"The word نَشْتَرِي comes from the root ش ر ي and is associated with the meanings: to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another."
    },

    {
        "indexid":775,
        "wordid":7114,
        "word":"قُرْبَى",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word قُرْبَى comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":775,
        "wordid":7115,
        "word":"نَكْتُمُ",
        "rootid":371,
        "rootword":"ك ت م",
        "meanings":"To conceal, restrain (anger), hide, keep back (evidence), hold.",
        "sentence":"The word نَكْتُمُ comes from the root ك ت م and is associated with the meanings: To conceal, restrain (anger), hide, keep back (evidence), hold."
    },

    {
        "indexid":775,
        "wordid":7116,
        "word":"شَهَادَةَ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شَهَادَةَ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":775,
        "wordid":7117,
        "word":"الْءَاثِمِينَ",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word الْءَاثِمِينَ comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    }]}