{"data":[
    {
        "indexid":798,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":798,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":798,
        "wordid":7234,
        "word":"مَلَكًا",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَكًا comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":798,
        "wordid":7236,
        "word":"جَعَلْنَاهُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلْنَاهُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":798,
        "wordid":7237,
        "word":"لَجَعَلْنَاهُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word لَجَعَلْنَاهُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":798,
        "wordid":7238,
        "word":"رَجُلًا",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رَجُلًا comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":798,
        "wordid":7239,
        "word":"وَلَلَبَسْنَا",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word وَلَلَبَسْنَا comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    },

    {
        "indexid":798,
        "wordid":7240,
        "word":"يَلْبِسُونَ",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word يَلْبِسُونَ comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    }]}