{"data":[
    {
        "indexid":886,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":886,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":886,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":886,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":886,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":886,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":886,
        "wordid":7074,
        "word":"الْبَرِّ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word الْبَرِّ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":886,
        "wordid":7435,
        "word":"وَالْبَحْرِ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word وَالْبَحْرِ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":886,
        "wordid":7438,
        "word":"ظُلُمَاتِ",
        "rootid":434,
        "rootword":"ظ ل م",
        "meanings":"Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]",
        "sentence":"The word ظُلُمَاتِ comes from the root ظ ل م and is associated with the meanings: Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]"
    },

    {
        "indexid":886,
        "wordid":7636,
        "word":"النُّجُومَ",
        "rootid":255,
        "rootword":"ن ج م",
        "meanings":"to appear\/rise\/begin, accomplish, ensue, proceed.",
        "sentence":"The word النُّجُومَ comes from the root ن ج م and is associated with the meanings: to appear\/rise\/begin, accomplish, ensue, proceed."
    },

    {
        "indexid":886,
        "wordid":7637,
        "word":"لِتَهْتَدُوا",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word لِتَهْتَدُوا comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":886,
        "wordid":7638,
        "word":"فَصَّلْنَا",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word فَصَّلْنَا comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    }]}