{"data":[
    {
        "indexid":892,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":892,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":892,
        "wordid":7263,
        "word":"الْخَبِيرُ",
        "rootid":109,
        "rootword":"خ ب ر",
        "meanings":"To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account.",
        "sentence":"The word الْخَبِيرُ comes from the root خ ب ر and is associated with the meanings: To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account."
    },

    {
        "indexid":892,
        "wordid":7674,
        "word":"تُدْرِكُهُ",
        "rootid":183,
        "rootword":"د ر ك",
        "meanings":"To overtake, follow up, drop closely.",
        "sentence":"The word تُدْرِكُهُ comes from the root د ر ك and is associated with the meanings: To overtake, follow up, drop closely."
    },

    {
        "indexid":892,
        "wordid":7675,
        "word":"الْأَبْصَارُ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word الْأَبْصَارُ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":892,
        "wordid":7676,
        "word":"يُدْرِكُ",
        "rootid":183,
        "rootword":"د ر ك",
        "meanings":"To overtake, follow up, drop closely.",
        "sentence":"The word يُدْرِكُ comes from the root د ر ك and is associated with the meanings: To overtake, follow up, drop closely."
    },

    {
        "indexid":892,
        "wordid":7677,
        "word":"الْأَبْصَارَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word الْأَبْصَارَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":892,
        "wordid":7678,
        "word":"اللَّطِيفُ",
        "rootid":1415,
        "rootword":"ل ط ف",
        "meanings":"To be delicate, subtle, slender, graceful, courtesy, elegant, gentle, kind, fine, nice, sooth\/caress, gift\/present. latif n.m. - 6:103, 12:100, 22:63, 31:16, 33:34, 42:19, 67:14 talattafa vb. (V) impf. act. 18:19",
        "sentence":"The word اللَّطِيفُ comes from the root ل ط ف and is associated with the meanings: To be delicate, subtle, slender, graceful, courtesy, elegant, gentle, kind, fine, nice, sooth\/caress, gift\/present. latif n.m. - 6:103, 12:100, 22:63, 31:16, 33:34, 42:19, 67:14 talattafa vb. (V) impf. act. 18:19"
    }]}