{"data":[
    {
        "indexid":926,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":926,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":926,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":926,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":926,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":926,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":926,
        "wordid":2984,
        "word":"الْمُشْرِكِينَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word الْمُشْرِكِينَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":926,
        "wordid":4667,
        "word":"يَفْتَرُونَ",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word يَفْتَرُونَ comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    },

    {
        "indexid":926,
        "wordid":6025,
        "word":"فَعَلُوهُ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَعَلُوهُ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":926,
        "wordid":6429,
        "word":"دِينَهُمْ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word دِينَهُمْ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":926,
        "wordid":6742,
        "word":"قَتْلَ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قَتْلَ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":926,
        "wordid":7720,
        "word":"فَذَرْهُمْ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word فَذَرْهُمْ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":926,
        "wordid":7832,
        "word":"زَيَّنَ",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word زَيَّنَ comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":926,
        "wordid":7833,
        "word":"لِكَثِيرٍ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word لِكَثِيرٍ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":926,
        "wordid":7834,
        "word":"أَوْلَادِهِمْ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word أَوْلَادِهِمْ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":926,
        "wordid":7835,
        "word":"شُرَكَاؤُهُمْ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word شُرَكَاؤُهُمْ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":926,
        "wordid":7836,
        "word":"لِيُرْدُوهُمْ",
        "rootid":1248,
        "rootword":"ر د ي",
        "meanings":"to perish, fall down, break, knock, blandish, destroy. arda (vb. 4) - to bring to destruction\/ruin. tradda - to fall. mutarddiyatun - that which falls, which is slain by a fall.",
        "sentence":"The word لِيُرْدُوهُمْ comes from the root ر د ي and is associated with the meanings: to perish, fall down, break, knock, blandish, destroy. arda (vb. 4) - to bring to destruction\/ruin. tradda - to fall. mutarddiyatun - that which falls, which is slain by a fall."
    },

    {
        "indexid":926,
        "wordid":7837,
        "word":"وَلِيَلْبِسُوا",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word وَلِيَلْبِسُوا comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    }]}