{"data":[
    {
        "indexid":93,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":93,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":93,
        "wordid":2129,
        "word":"اشْتَرَوُا",
        "rootid":120,
        "rootword":"ش ر ي",
        "meanings":"to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another.",
        "sentence":"The word اشْتَرَوُا comes from the root ش ر ي and is associated with the meanings: to buy\/sell\/barter\/purchase, conclude a sale, give or take in exchange, refuse, choose, prefer, give up anything and take another, lay hold on another."
    },

    {
        "indexid":93,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":93,
        "wordid":2476,
        "word":"يُنْصَرُونَ",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word يُنْصَرُونَ comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":93,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":93,
        "wordid":2823,
        "word":"الْحَيَوةَ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةَ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":93,
        "wordid":2824,
        "word":"بِالْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word بِالْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":93,
        "wordid":2825,
        "word":"يُخَفَّفُ",
        "rootid":726,
        "rootword":"خ ف ف",
        "meanings":"To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable.",
        "sentence":"The word يُخَفَّفُ comes from the root خ ف ف and is associated with the meanings: To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable."
    },

    {
        "indexid":93,
        "wordid":2826,
        "word":"عَنْهُمُ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمُ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":93,
        "wordid":2827,
        "word":"الْعَذَابُ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابُ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    }]}