{"data":[
    {
        "indexid":934,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":934,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":934,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":934,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":934,
        "wordid":2588,
        "word":"رَبَّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":934,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":934,
        "wordid":3282,
        "word":"رَحِيمٌ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمٌ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":934,
        "wordid":3323,
        "word":"يَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":934,
        "wordid":3468,
        "word":"أُهِلَّ",
        "rootid":1231,
        "rootword":"ه ل ل",
        "meanings":"to appear (new moon), beginning (of lunar month). ahalla - to invoke the name of God upon an animal before slaughtering it.",
        "sentence":"The word أُهِلَّ comes from the root ه ل ل and is associated with the meanings: to appear (new moon), beginning (of lunar month). ahalla - to invoke the name of God upon an animal before slaughtering it."
    },

    {
        "indexid":934,
        "wordid":3469,
        "word":"لِغَيْرِ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word لِغَيْرِ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":934,
        "wordid":3470,
        "word":"فَمَنِ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمَنِ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":934,
        "wordid":3471,
        "word":"اضْطُرَّ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word اضْطُرَّ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":934,
        "wordid":3472,
        "word":"بَاغٍ",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word بَاغٍ comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":934,
        "wordid":3473,
        "word":"عَادٍ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word عَادٍ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":934,
        "wordid":8243,
        "word":"عَادٍ",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word عَادٍ comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":934,
        "wordid":3475,
        "word":"غَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":934,
        "wordid":4861,
        "word":"إِلَيَّ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيَّ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":7034,
        "word":"رِجْسٌ",
        "rootid":61,
        "rootword":"ر ج س",
        "meanings":"to disgrace and defile, thunder, commit foul deeds, bellow loudly, become hated, something in which there is no good, state of commotion, confuse greatly, make a noise\/sound, hinder\/prevent, unclean\/dirty\/filthy, evil, something which is unlawful\/forbidden, unbelief\/infidelity\/doubt.",
        "sentence":"The word رِجْسٌ comes from the root ر ج س and is associated with the meanings: to disgrace and defile, thunder, commit foul deeds, bellow loudly, become hated, something in which there is no good, state of commotion, confuse greatly, make a noise\/sound, hinder\/prevent, unclean\/dirty\/filthy, evil, something which is unlawful\/forbidden, unbelief\/infidelity\/doubt."
    },

    {
        "indexid":934,
        "wordid":7851,
        "word":"مَيْتَةً",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word مَيْتَةً comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":934,
        "wordid":7884,
        "word":"أَجِدُ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word أَجِدُ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":934,
        "wordid":7885,
        "word":"مُحَرَّمًا",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word مُحَرَّمًا comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":934,
        "wordid":7886,
        "word":"طَاعِمٍ",
        "rootid":1791,
        "rootword":"ط ع م",
        "meanings":"ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating.",
        "sentence":"The word طَاعِمٍ comes from the root ط ع م and is associated with the meanings: ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating."
    },

    {
        "indexid":934,
        "wordid":7887,
        "word":"يَطْعَمُهُ",
        "rootid":1791,
        "rootword":"ط ع م",
        "meanings":"ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating.",
        "sentence":"The word يَطْعَمُهُ comes from the root ط ع م and is associated with the meanings: ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating."
    },

    {
        "indexid":934,
        "wordid":7888,
        "word":"دَمًا",
        "rootid":707,
        "rootword":"د م ي",
        "meanings":"",
        "sentence":"The word دَمًا comes from the root د م ي and is associated with the meanings: "
    },

    {
        "indexid":934,
        "wordid":7889,
        "word":"مَسْفُوحًا",
        "rootid":1277,
        "rootword":"س ف ح",
        "meanings":"to shed\/flow, outpoured\/spilled, musafihun - one who commits fornication or adultery, take unlawfully (women). saffaha - to work without profit.",
        "sentence":"The word مَسْفُوحًا comes from the root س ف ح and is associated with the meanings: to shed\/flow, outpoured\/spilled, musafihun - one who commits fornication or adultery, take unlawfully (women). saffaha - to work without profit."
    },

    {
        "indexid":934,
        "wordid":7890,
        "word":"لَحْمَ",
        "rootid":144,
        "rootword":"ل ح م",
        "meanings":"flesh\/meat, to feed with flesh, skin\/hide\/cloth.",
        "sentence":"The word لَحْمَ comes from the root ل ح م and is associated with the meanings: flesh\/meat, to feed with flesh, skin\/hide\/cloth."
    },

    {
        "indexid":934,
        "wordid":7891,
        "word":"خِنْزِيرٍ",
        "rootid":990,
        "rootword":"خ ن ز ر",
        "meanings":"swine\/pig.",
        "sentence":"The word خِنْزِيرٍ comes from the root خ ن ز ر and is associated with the meanings: swine\/pig."
    },

    {
        "indexid":934,
        "wordid":7892,
        "word":"فِسْقًا",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word فِسْقًا comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    }]}