{"data":[
    {
        "indexid":935,
        "wordid":2074,
        "word":"وَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":935,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":935,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":935,
        "wordid":2619,
        "word":"هَادُوا",
        "rootid":360,
        "rootword":"ه و د",
        "meanings":"(Ya-ha-Dal) Jews",
        "sentence":"The word هَادُوا comes from the root ه و د and is associated with the meanings: (Ya-ha-Dal) Jews"
    },

    {
        "indexid":935,
        "wordid":3367,
        "word":"أَوِ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوِ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":935,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":935,
        "wordid":5867,
        "word":"ذِي",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذِي comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":935,
        "wordid":6480,
        "word":"حَرَّمْنَا",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حَرَّمْنَا comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":935,
        "wordid":7881,
        "word":"الْبَقَرِ",
        "rootid":89,
        "rootword":"ب ق ر",
        "meanings":"Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities",
        "sentence":"The word الْبَقَرِ comes from the root ب ق ر and is associated with the meanings: Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities"
    },

    {
        "indexid":935,
        "wordid":7893,
        "word":"ظُفُرٍ",
        "rootid":521,
        "rootword":"ظ ف ر",
        "meanings":"gain possession, attain, victorious\/succeed, claw\/talon\/nail.",
        "sentence":"The word ظُفُرٍ comes from the root ظ ف ر and is associated with the meanings: gain possession, attain, victorious\/succeed, claw\/talon\/nail."
    },

    {
        "indexid":935,
        "wordid":7894,
        "word":"وَالْغَنَمِ",
        "rootid":1461,
        "rootword":"غ ن م",
        "meanings":"obtained, got, took (usually in reference to spoils or booties); acquisition without difficulties, regaining, sheep or goats collected together",
        "sentence":"The word وَالْغَنَمِ comes from the root غ ن م and is associated with the meanings: obtained, got, took (usually in reference to spoils or booties); acquisition without difficulties, regaining, sheep or goats collected together"
    },

    {
        "indexid":935,
        "wordid":7895,
        "word":"شُحُومَهُمَا",
        "rootid":1042,
        "rootword":"ش ح م",
        "meanings":"to live or feed with fat, fats\/salts\/pulp, fleshy part.",
        "sentence":"The word شُحُومَهُمَا comes from the root ش ح م and is associated with the meanings: to live or feed with fat, fats\/salts\/pulp, fleshy part."
    },

    {
        "indexid":935,
        "wordid":7896,
        "word":"حَمَلَتْ",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word حَمَلَتْ comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":935,
        "wordid":7897,
        "word":"ظُهُورُهُمَا",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظُهُورُهُمَا comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":935,
        "wordid":7898,
        "word":"الْحَوَايَا",
        "rootid":1323,
        "rootword":"ح و ي",
        "meanings":"(Ha-Alif-Ya) To be or become dark green or dark red or brown or black and dried up by reason of oldness.",
        "sentence":"The word الْحَوَايَا comes from the root ح و ي and is associated with the meanings: (Ha-Alif-Ya) To be or become dark green or dark red or brown or black and dried up by reason of oldness."
    },

    {
        "indexid":935,
        "wordid":7899,
        "word":"اخْتَلَطَ",
        "rootid":545,
        "rootword":"خ ل ط",
        "meanings":"To mix\/intermingle\/incorporate\/blend, put together with another thing, confuse\/confound\/disorder, to perplex or disturb, to have intercourse (i.e. a man with his wife, or with a woman), to penetrate into [ TA - khalthu ash-shaybu (the arrow penetrated into him) ], to infect or pervade, associate\/converse, become intimate with, enter into a confederacy\/league\/compact\/covenant, good natured\/disposition.",
        "sentence":"The word اخْتَلَطَ comes from the root خ ل ط and is associated with the meanings: To mix\/intermingle\/incorporate\/blend, put together with another thing, confuse\/confound\/disorder, to perplex or disturb, to have intercourse (i.e. a man with his wife, or with a woman), to penetrate into [ TA - khalthu ash-shaybu (the arrow penetrated into him) ], to infect or pervade, associate\/converse, become intimate with, enter into a confederacy\/league\/compact\/covenant, good natured\/disposition."
    },

    {
        "indexid":935,
        "wordid":7900,
        "word":"بِعَظْمٍ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word بِعَظْمٍ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":935,
        "wordid":7901,
        "word":"جَزَيْنَاهُمْ",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word جَزَيْنَاهُمْ comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":935,
        "wordid":7902,
        "word":"بِبَغْيِهِمْ",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word بِبَغْيِهِمْ comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":935,
        "wordid":7903,
        "word":"لَصَادِقُونَ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word لَصَادِقُونَ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    }]}