{"data":[
    {
        "indexid":937,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":937,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":937,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":937,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":937,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":937,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":937,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":937,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":937,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":937,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":937,
        "wordid":2900,
        "word":"أَشْرَكُوا",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أَشْرَكُوا comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":937,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":937,
        "wordid":3089,
        "word":"قَبْلِهِمْ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِهِمْ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":937,
        "wordid":3255,
        "word":"سَيَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word سَيَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":937,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":937,
        "wordid":6471,
        "word":"عِلْمٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":937,
        "wordid":6480,
        "word":"حَرَّمْنَا",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حَرَّمْنَا comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":937,
        "wordid":7279,
        "word":"كَذَّبَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذَّبَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":937,
        "wordid":7735,
        "word":"الظَّنَّ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word الظَّنَّ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":937,
        "wordid":7907,
        "word":"أَشْرَكْنَا",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أَشْرَكْنَا comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":937,
        "wordid":7908,
        "word":"ءَابَاؤُنَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَاؤُنَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":937,
        "wordid":7909,
        "word":"ذَاقُوا",
        "rootid":1121,
        "rootword":"ذ و ق",
        "meanings":"to taste\/experience\/try\/perceive. One who tastes, cause to taste.",
        "sentence":"The word ذَاقُوا comes from the root ذ و ق and is associated with the meanings: to taste\/experience\/try\/perceive. One who tastes, cause to taste."
    },

    {
        "indexid":937,
        "wordid":7910,
        "word":"بَأْسَنَا",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word بَأْسَنَا comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":937,
        "wordid":7911,
        "word":"عِنْدَكُمْ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَكُمْ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":937,
        "wordid":7912,
        "word":"فَتُخْرِجُوهُ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word فَتُخْرِجُوهُ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":937,
        "wordid":7913,
        "word":"تَتَّبِعُونَ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word تَتَّبِعُونَ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":937,
        "wordid":7914,
        "word":"تَخْرُصُونَ",
        "rootid":111,
        "rootword":"خ ر ص",
        "meanings":"To compute a quantity by way of conjecture, opining or form an opinion of a thing of which one is not certain, to speak by opinion or conjecture, and thus, lie and speak falsely and say what is untrue, forge a lie or saying, to be hungry and cold.",
        "sentence":"The word تَخْرُصُونَ comes from the root خ ر ص and is associated with the meanings: To compute a quantity by way of conjecture, opining or form an opinion of a thing of which one is not certain, to speak by opinion or conjecture, and thus, lie and speak falsely and say what is untrue, forge a lie or saying, to be hungry and cold."
    }]}