{"data":[
    {
        "indexid":940,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":940,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":940,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":940,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":940,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":940,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":940,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":940,
        "wordid":2451,
        "word":"تَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word تَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":940,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":940,
        "wordid":2692,
        "word":"بِالْحَقِّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word بِالْحَقِّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":940,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":940,
        "wordid":2781,
        "word":"وَبِالْوَالِدَيْنِ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word وَبِالْوَالِدَيْنِ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":940,
        "wordid":2782,
        "word":"إِحْسَانًا",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word إِحْسَانًا comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":940,
        "wordid":3463,
        "word":"حَرَّمَ",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حَرَّمَ comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":940,
        "wordid":4042,
        "word":"أَوْلَادَكُمْ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word أَوْلَادَكُمْ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":940,
        "wordid":4882,
        "word":"تَعَالَوْا",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word تَعَالَوْا comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":940,
        "wordid":5168,
        "word":"رَبُّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":940,
        "wordid":5812,
        "word":"تَقْتُلُوا",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word تَقْتُلُوا comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":940,
        "wordid":5864,
        "word":"تُشْرِكُوا",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word تُشْرِكُوا comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":940,
        "wordid":5898,
        "word":"تَقْرَبُوا",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word تَقْرَبُوا comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":940,
        "wordid":6826,
        "word":"النَّفْسَ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word النَّفْسَ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":940,
        "wordid":7923,
        "word":"أَتْلُ",
        "rootid":920,
        "rootword":"ت ل و",
        "meanings":"To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing.",
        "sentence":"The word أَتْلُ comes from the root ت ل و and is associated with the meanings: To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing."
    },

    {
        "indexid":940,
        "wordid":7924,
        "word":"إِمْلَاقٍ",
        "rootid":108,
        "rootword":"م ل ق",
        "meanings":"To flay a person, also to behave in a loving and affectionate manner towards someone, run swiftly, be vehement in journeying.",
        "sentence":"The word إِمْلَاقٍ comes from the root م ل ق and is associated with the meanings: To flay a person, also to behave in a loving and affectionate manner towards someone, run swiftly, be vehement in journeying."
    },

    {
        "indexid":940,
        "wordid":7925,
        "word":"نَرْزُقُكُمْ",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word نَرْزُقُكُمْ comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    },

    {
        "indexid":940,
        "wordid":7926,
        "word":"وَإِيَّاهُمْ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word وَإِيَّاهُمْ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":940,
        "wordid":7927,
        "word":"الْفَوَاحِشَ",
        "rootid":1329,
        "rootword":"ف ح ش",
        "meanings":"became excessive\/immoderate\/enormous\/exorbitant\/overmuch\/beyond measure, foul\/bad\/evil\/unseemly\/indecency\/abominable, lewd\/gross\/obscene, committing excess which is forbidden, transgress the bounds\/limits, avaricious, adultery\/fornication.",
        "sentence":"The word الْفَوَاحِشَ comes from the root ف ح ش and is associated with the meanings: became excessive\/immoderate\/enormous\/exorbitant\/overmuch\/beyond measure, foul\/bad\/evil\/unseemly\/indecency\/abominable, lewd\/gross\/obscene, committing excess which is forbidden, transgress the bounds\/limits, avaricious, adultery\/fornication."
    },

    {
        "indexid":940,
        "wordid":7928,
        "word":"ظَهَرَ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظَهَرَ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":940,
        "wordid":7929,
        "word":"بَطَنَ",
        "rootid":378,
        "rootword":"ب ط ن",
        "meanings":"Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward.",
        "sentence":"The word بَطَنَ comes from the root ب ط ن and is associated with the meanings: Becoming fat, Midriff, stomach, belly, girth, abdomenBecoming replete, satedA belly ache or being disordered digestivelyExulting greatly and\/or excessively, behaving insolently and ungratefullyStriking or beating the bellyDisease entering (as though it penetrated through the belly)Entering into something (e.g. a valley, affair)Penetrating mentally or knowing something (state, news, circumstances, affair, case)Something becoming hidden or unapparent, esoteric, concealed or covertA lining or inner covering, inside or interior of anything, inner storyParticular or special intimate, friend or associateGoing in the middle or midst of something (e.g. meadow, garden, news)A far extending place of whose parts are remote from the otherBringing forth of youngExcrement or ejection ofLower or lowest part of the foundation, low depressed land, soft parts of the land where water stagnatesPalm of the hand, sole of the foot\/hoofArmpit hollow of the arm, hollow of the throatApparent, visible part of the skyHaving an inordinate desire or appetite for foodOne of the mansions\/stations of the moon, the 2nd. Three small stars in the form of an equilateral triangle forming the belly of the Ram\/Aries.Certain vessel made of glass or earthenware (an amphora, jar, vase, and pitcher)Inward."
    },

    {
        "indexid":940,
        "wordid":7930,
        "word":"وَصَّاكُمْ",
        "rootid":1754,
        "rootword":"و ص ي",
        "meanings":"to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will.",
        "sentence":"The word وَصَّاكُمْ comes from the root و ص ي and is associated with the meanings: to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will."
    }]}