{"data":[
    {
        "indexid":941,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":941,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":941,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":941,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":941,
        "wordid":2415,
        "word":"وَأَوْفُوا",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word وَأَوْفُوا comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":941,
        "wordid":2522,
        "word":"قُلْتُمْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْتُمْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":941,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":941,
        "wordid":2697,
        "word":"نَفْسًا",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word نَفْسًا comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":941,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":941,
        "wordid":3239,
        "word":"أَحْسَنُ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word أَحْسَنُ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":941,
        "wordid":3692,
        "word":"يَبْلُغَ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word يَبْلُغَ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    },

    {
        "indexid":941,
        "wordid":4029,
        "word":"وُسْعَهَا",
        "rootid":1606,
        "rootword":"و س ع",
        "meanings":"to be ample, take in, comprehend, embrace.",
        "sentence":"The word وُسْعَهَا comes from the root و س ع and is associated with the meanings: to be ample, take in, comprehend, embrace."
    },

    {
        "indexid":941,
        "wordid":4114,
        "word":"ذَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":941,
        "wordid":4641,
        "word":"بِالْقِسْطِ",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word بِالْقِسْطِ comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    },

    {
        "indexid":941,
        "wordid":5898,
        "word":"تَقْرَبُوا",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word تَقْرَبُوا comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":941,
        "wordid":6549,
        "word":"أَوْفُوا",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word أَوْفُوا comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":941,
        "wordid":7114,
        "word":"قُرْبَى",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word قُرْبَى comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":941,
        "wordid":7930,
        "word":"وَصَّاكُمْ",
        "rootid":1754,
        "rootword":"و ص ي",
        "meanings":"to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will.",
        "sentence":"The word وَصَّاكُمْ comes from the root و ص ي and is associated with the meanings: to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will."
    },

    {
        "indexid":941,
        "wordid":7931,
        "word":"مَالَ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word مَالَ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":941,
        "wordid":7932,
        "word":"الْيَتِيمِ",
        "rootid":1001,
        "rootword":"ي ت م",
        "meanings":"orphan",
        "sentence":"The word الْيَتِيمِ comes from the root ي ت م and is associated with the meanings: orphan"
    },

    {
        "indexid":941,
        "wordid":7934,
        "word":"أَشُدَّهُ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word أَشُدَّهُ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":941,
        "wordid":7935,
        "word":"الْكَيْلَ",
        "rootid":1059,
        "rootword":"ك ي ل",
        "meanings":"(Kaf-Alif-Lam) To measure, weigh, compare.",
        "sentence":"The word الْكَيْلَ comes from the root ك ي ل and is associated with the meanings: (Kaf-Alif-Lam) To measure, weigh, compare."
    },

    {
        "indexid":941,
        "wordid":7936,
        "word":"وَالْمِيزَانَ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word وَالْمِيزَانَ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    },

    {
        "indexid":941,
        "wordid":7937,
        "word":"نُكَلِّفُ",
        "rootid":128,
        "rootword":"ك ل ف",
        "meanings":"To take pains, be zealous, be engrossed by an object.",
        "sentence":"The word نُكَلِّفُ comes from the root ك ل ف and is associated with the meanings: To take pains, be zealous, be engrossed by an object."
    },

    {
        "indexid":941,
        "wordid":7938,
        "word":"فَاعْدِلُوا",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word فَاعْدِلُوا comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":941,
        "wordid":7939,
        "word":"وَبِعَهْدِ",
        "rootid":1290,
        "rootword":"ع ه د",
        "meanings":"to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security.",
        "sentence":"The word وَبِعَهْدِ comes from the root ع ه د and is associated with the meanings: to enjoin\/charge\/impose\/swear. ahdun - treaty\/covenant\/promise\/agreement\/compact\/oath, bond, condition, bequest, responsibility, guarantee, time, epoch, acquaintance, true, friendship, affection, security."
    },

    {
        "indexid":941,
        "wordid":7940,
        "word":"تَذَكَّرُونَ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word تَذَكَّرُونَ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    }]}