{"data":[
    {
        "indexid":962,
        "wordid":2056,
        "word":"الْمُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word الْمُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":962,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":962,
        "wordid":2400,
        "word":"فَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":962,
        "wordid":2776,
        "word":"فَأُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word فَأُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":962,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":962,
        "wordid":8009,
        "word":"وَالْوَزْنُ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word وَالْوَزْنُ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    },

    {
        "indexid":962,
        "wordid":8010,
        "word":"ثَقُلَتْ",
        "rootid":731,
        "rootword":"ث ق ل",
        "meanings":"to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards.",
        "sentence":"The word ثَقُلَتْ comes from the root ث ق ل and is associated with the meanings: to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards."
    },

    {
        "indexid":962,
        "wordid":8011,
        "word":"مَوَازِينُهُ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word مَوَازِينُهُ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    }]}