{"data":[
    {
        "indexid":974,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":974,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":974,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":974,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":974,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":974,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":974,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":974,
        "wordid":5701,
        "word":"عَنْهُمَا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمَا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":974,
        "wordid":8045,
        "word":"فَوَسْوَسَ",
        "rootid":658,
        "rootword":"و س و س",
        "meanings":"to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer.",
        "sentence":"The word فَوَسْوَسَ comes from the root و س و س and is associated with the meanings: to whisper evil, make evil suggestions, prompt false things.. . Waswasa (prf. 3rd. p. m. sing.): whispered, made evil suggestion.. Yuwaswisu (impf. 3rd. p. m. sing.): he whispers.. Tuwaswisu (imp. 3rd. p. f. sing.): she whispers.. Waswaas (act. 2nd. pic.): whisperer."
    },

    {
        "indexid":974,
        "wordid":8047,
        "word":"لِيُبْدِيَ",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word لِيُبْدِيَ comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    },

    {
        "indexid":974,
        "wordid":8048,
        "word":"وُورِيَ",
        "rootid":1207,
        "rootword":"و ر ي",
        "meanings":"made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses).",
        "sentence":"The word وُورِيَ comes from the root و ر ي and is associated with the meanings: made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses)."
    },

    {
        "indexid":974,
        "wordid":8049,
        "word":"سَوْءَاتِهِمَا",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَوْءَاتِهِمَا comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":974,
        "wordid":8050,
        "word":"نَهَاكُمَا",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word نَهَاكُمَا comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":974,
        "wordid":8051,
        "word":"رَبُّكُمَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكُمَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":974,
        "wordid":8052,
        "word":"الشَّجَرَةِ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word الشَّجَرَةِ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":974,
        "wordid":8053,
        "word":"تَكُونَا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونَا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":974,
        "wordid":8054,
        "word":"مَلَكَيْنِ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَكَيْنِ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":974,
        "wordid":8055,
        "word":"الْخَالِدِينَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word الْخَالِدِينَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    }]}