{"data":[
    {
        "indexid":990,
        "wordid":2051,
        "word":"أُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word أُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":990,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":990,
        "wordid":2257,
        "word":"خَالِدُونَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word خَالِدُونَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":990,
        "wordid":2377,
        "word":"عَنْهَا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهَا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":990,
        "wordid":2407,
        "word":"أَصْحَابُ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word أَصْحَابُ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":990,
        "wordid":2408,
        "word":"النَّارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":990,
        "wordid":4592,
        "word":"كَذَّبُوا",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذَّبُوا comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":990,
        "wordid":6533,
        "word":"وَاسْتَكْبَرُوا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word وَاسْتَكْبَرُوا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    }]}