{"data":[
    {
        "indexid":994,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":994,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":994,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":994,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":994,
        "wordid":2365,
        "word":"الْجَنَّةَ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجَنَّةَ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":994,
        "wordid":2377,
        "word":"عَنْهَا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهَا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":994,
        "wordid":4592,
        "word":"كَذَّبُوا",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذَّبُوا comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":994,
        "wordid":6346,
        "word":"يَدْخُلُونَ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word يَدْخُلُونَ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":994,
        "wordid":6533,
        "word":"وَاسْتَكْبَرُوا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word وَاسْتَكْبَرُوا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":994,
        "wordid":7421,
        "word":"الْمُجْرِمِينَ",
        "rootid":387,
        "rootword":"ج ر م",
        "meanings":"",
        "sentence":"The word الْمُجْرِمِينَ comes from the root ج ر م and is associated with the meanings: "
    },

    {
        "indexid":994,
        "wordid":7564,
        "word":"نَجْزِي",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word نَجْزِي comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":994,
        "wordid":8133,
        "word":"تُفَتَّحُ",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word تُفَتَّحُ comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":994,
        "wordid":8134,
        "word":"أَبْوَابُ",
        "rootid":154,
        "rootword":"ب و ب",
        "meanings":"door\/gate, place of entrance, mode\/manner.",
        "sentence":"The word أَبْوَابُ comes from the root ب و ب and is associated with the meanings: door\/gate, place of entrance, mode\/manner."
    },

    {
        "indexid":994,
        "wordid":8135,
        "word":"يَلِجَ",
        "rootid":1701,
        "rootword":"و ل ج",
        "meanings":"to enter, penetrate in, go in, pass through, gain.",
        "sentence":"The word يَلِجَ comes from the root و ل ج and is associated with the meanings: to enter, penetrate in, go in, pass through, gain."
    },

    {
        "indexid":994,
        "wordid":8136,
        "word":"الْجَمَلُ",
        "rootid":310,
        "rootword":"ج م ل",
        "meanings":"To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope.",
        "sentence":"The word الْجَمَلُ comes from the root ج م ل and is associated with the meanings: To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope."
    },

    {
        "indexid":994,
        "wordid":8137,
        "word":"سَمِّ",
        "rootid":262,
        "rootword":"س م م",
        "meanings":"to poison, penetrate, be burning hot. sammun - hole, eye of a needle, small doorway at the side of a large gate. samun - pestilential scorching wind which penetrate into the bodies.",
        "sentence":"The word سَمِّ comes from the root س م م and is associated with the meanings: to poison, penetrate, be burning hot. sammun - hole, eye of a needle, small doorway at the side of a large gate. samun - pestilential scorching wind which penetrate into the bodies."
    },

    {
        "indexid":994,
        "wordid":8138,
        "word":"الْخِيَاطِ",
        "rootid":1100,
        "rootword":"خ ي ط",
        "meanings":"To thread, sew\/sew together\/sew up, couple one thing with another, pass by or to or towards a person or thing, run\/pass along quickly, journey without interruption (not pausing for anything), to be streaked with whiteness of the hair or beard, sew with a thread or string, to be scattered or in an abject state.",
        "sentence":"The word الْخِيَاطِ comes from the root خ ي ط and is associated with the meanings: To thread, sew\/sew together\/sew up, couple one thing with another, pass by or to or towards a person or thing, run\/pass along quickly, journey without interruption (not pausing for anything), to be streaked with whiteness of the hair or beard, sew with a thread or string, to be scattered or in an abject state."
    }]}