{"data":[
    {
        "indexid":1009,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1009,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":1009,
        "wordid":3655,
        "word":"الْمُعْتَدِينَ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word الْمُعْتَدِينَ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":1009,
        "wordid":7457,
        "word":"تَضَرُّعًا",
        "rootid":1372,
        "rootword":"ض ر ع",
        "meanings":"to humiliate, abase, object, humble, lower one's self, humility\/submissiveness. Dry, bitter, thorny herbage.",
        "sentence":"The word تَضَرُّعًا comes from the root ض ر ع and is associated with the meanings: to humiliate, abase, object, humble, lower one's self, humility\/submissiveness. Dry, bitter, thorny herbage."
    },

    {
        "indexid":1009,
        "wordid":7458,
        "word":"وَخُفْيَةً",
        "rootid":1414,
        "rootword":"خ ف ي",
        "meanings":"Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed).",
        "sentence":"The word وَخُفْيَةً comes from the root خ ف ي and is associated with the meanings: Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed)."
    },

    {
        "indexid":1009,
        "wordid":8201,
        "word":"ادْعُوا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word ادْعُوا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":1009,
        "wordid":8202,
        "word":"رَبَّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    }]}