{"data":[
    {
        "indexid":103,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":103,
        "wordid":2074,
        "word":"وَمِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":103,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":103,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":103,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":103,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":103,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":103,
        "wordid":2482,
        "word":"الْعَذَابِ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابِ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":103,
        "wordid":2897,
        "word":"وَلَتَجِدَنَّهُمْ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word وَلَتَجِدَنَّهُمْ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":103,
        "wordid":2898,
        "word":"أَحْرَصَ",
        "rootid":985,
        "rootword":"ح ر ص",
        "meanings":"To desire ardently, eagerly, strongly, covet.",
        "sentence":"The word أَحْرَصَ comes from the root ح ر ص and is associated with the meanings: To desire ardently, eagerly, strongly, covet."
    },

    {
        "indexid":103,
        "wordid":2899,
        "word":"حَيَوةٍ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word حَيَوةٍ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":103,
        "wordid":2900,
        "word":"أَشْرَكُوا",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أَشْرَكُوا comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":103,
        "wordid":2901,
        "word":"يَوَدُّ",
        "rootid":1151,
        "rootword":"و د د",
        "meanings":"to love, wish for, desire, be fond of, will, long.",
        "sentence":"The word يَوَدُّ comes from the root و د د and is associated with the meanings: to love, wish for, desire, be fond of, will, long."
    },

    {
        "indexid":103,
        "wordid":2902,
        "word":"أَحَدُهُمْ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدُهُمْ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":103,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":103,
        "wordid":2904,
        "word":"يُعَمَّرُ",
        "rootid":507,
        "rootword":"ع م ر",
        "meanings":"to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age.",
        "sentence":"The word يُعَمَّرُ comes from the root ع م ر and is associated with the meanings: to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age."
    },

    {
        "indexid":103,
        "wordid":2905,
        "word":"أَلْفَ",
        "rootid":1554,
        "rootword":"ا ل ف",
        "meanings":"he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known.",
        "sentence":"The word أَلْفَ comes from the root ا ل ف and is associated with the meanings: he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known."
    },

    {
        "indexid":103,
        "wordid":2906,
        "word":"سَنَةٍ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word سَنَةٍ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":103,
        "wordid":2907,
        "word":"بِمُزَحْزِحِهِ",
        "rootid":847,
        "rootword":"ز ح ز ح",
        "meanings":"to remove, remove\/push\/thrust away, become far away, distant, remote.",
        "sentence":"The word بِمُزَحْزِحِهِ comes from the root ز ح ز ح and is associated with the meanings: to remove, remove\/push\/thrust away, become far away, distant, remote."
    },

    {
        "indexid":103,
        "wordid":2908,
        "word":"يُعَمَّرَ",
        "rootid":507,
        "rootword":"ع م ر",
        "meanings":"to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age.",
        "sentence":"The word يُعَمَّرَ comes from the root ع م ر and is associated with the meanings: to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age."
    },

    {
        "indexid":103,
        "wordid":2909,
        "word":"بَصِيرٌ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word بَصِيرٌ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":103,
        "wordid":2910,
        "word":"يَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word يَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    }]}