{"data":[
    {
        "indexid":1071,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1071,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1071,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1071,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":1071,
        "wordid":8424,
        "word":"أَلْقِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word أَلْقِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":1071,
        "wordid":8425,
        "word":"عَصَاكَ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word عَصَاكَ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":1071,
        "wordid":8426,
        "word":"تَلْقَفُ",
        "rootid":1385,
        "rootword":"ل ق ف",
        "meanings":"To catch up hurriedly, seize, swallow up quickly, destroy, undo, eat up, catch and retain, collapse, fall upon the enemy, crumble down. laqifa vb. (1) impf. act. [7:117, 20:69, 26:45]",
        "sentence":"The word تَلْقَفُ comes from the root ل ق ف and is associated with the meanings: To catch up hurriedly, seize, swallow up quickly, destroy, undo, eat up, catch and retain, collapse, fall upon the enemy, crumble down. laqifa vb. (1) impf. act. [7:117, 20:69, 26:45]"
    },

    {
        "indexid":1071,
        "wordid":8427,
        "word":"يَأْفِكُونَ",
        "rootid":924,
        "rootword":"ا ف ك",
        "meanings":"change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn.",
        "sentence":"The word يَأْفِكُونَ comes from the root ا ف ك and is associated with the meanings: change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn."
    }]}