{"data":[
    {
        "indexid":1081,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1081,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1081,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1081,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1081,
        "wordid":2479,
        "word":"فِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":1081,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1081,
        "wordid":3308,
        "word":"أَبْنَاءَهُمْ",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word أَبْنَاءَهُمْ comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":1081,
        "wordid":3816,
        "word":"فَوْقَهُمْ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَهُمْ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":1081,
        "wordid":8227,
        "word":"الْمَلَأُ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word الْمَلَأُ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":1081,
        "wordid":8251,
        "word":"قَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1081,
        "wordid":8448,
        "word":"أَتَذَرُ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word أَتَذَرُ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":1081,
        "wordid":8449,
        "word":"وَقَوْمَهُ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word وَقَوْمَهُ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1081,
        "wordid":8450,
        "word":"لِيُفْسِدُوا",
        "rootid":1361,
        "rootword":"ف س د",
        "meanings":"to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence.",
        "sentence":"The word لِيُفْسِدُوا comes from the root ف س د and is associated with the meanings: to become evil\/corrupted, invalid, decomposed, bad\/spoiled\/tainted, wrong, vicious, make mischief or foul deal. fasad - corruption\/violence."
    },

    {
        "indexid":1081,
        "wordid":8451,
        "word":"وَيَذَرَكَ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word وَيَذَرَكَ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":1081,
        "wordid":8452,
        "word":"وَءَالِهَتَكَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَءَالِهَتَكَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1081,
        "wordid":8453,
        "word":"سَنُقَتِّلُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word سَنُقَتِّلُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":1081,
        "wordid":8454,
        "word":"وَنَسْتَحْيِي",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word وَنَسْتَحْيِي comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":1081,
        "wordid":8455,
        "word":"نِسَاءَهُمْ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word نِسَاءَهُمْ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":1081,
        "wordid":8456,
        "word":"قَاهِرُونَ",
        "rootid":1702,
        "rootword":"ق ه ر",
        "meanings":"to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying.",
        "sentence":"The word قَاهِرُونَ comes from the root ق ه ر and is associated with the meanings: to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying."
    }]}