{"data":[
    {
        "indexid":1097,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1097,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1097,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1097,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1097,
        "wordid":2333,
        "word":"سُبْحَانَكَ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word سُبْحَانَكَ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":1097,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":1097,
        "wordid":3121,
        "word":"رَبُّهُ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّهُ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1097,
        "wordid":3385,
        "word":"وَأَنَا",
        "rootid":1523,
        "rootword":"ا ن ا",
        "meanings":"",
        "sentence":"The word وَأَنَا comes from the root ا ن ا and is associated with the meanings: "
    },

    {
        "indexid":1097,
        "wordid":3666,
        "word":"فَإِنِ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنِ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1097,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1097,
        "wordid":4214,
        "word":"وَلَكِنِ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنِ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":1097,
        "wordid":4293,
        "word":"أَرِنِي",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word أَرِنِي comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1097,
        "wordid":5177,
        "word":"جَعَلَهُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَهُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1097,
        "wordid":5713,
        "word":"تُبْتُ",
        "rootid":1156,
        "rootword":"ت و ب",
        "meanings":"To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt.",
        "sentence":"The word تُبْتُ comes from the root ت و ب and is associated with the meanings: To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt."
    },

    {
        "indexid":1097,
        "wordid":5815,
        "word":"فَسَوْفَ",
        "rootid":182,
        "rootword":"س و ف",
        "meanings":"",
        "sentence":"The word فَسَوْفَ comes from the root س و ف and is associated with the meanings: "
    },

    {
        "indexid":1097,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":1097,
        "wordid":5949,
        "word":"انْظُرْ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word انْظُرْ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":1097,
        "wordid":7980,
        "word":"أَوَّلُ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word أَوَّلُ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":1097,
        "wordid":8529,
        "word":"لِمِيقَاتِنَا",
        "rootid":1516,
        "rootword":"و ق ت",
        "meanings":"to fix, defined\/determined\/limited a thing as to time, appoint\/declare\/assign a time, measure of time (e.g. season).",
        "sentence":"The word لِمِيقَاتِنَا comes from the root و ق ت and is associated with the meanings: to fix, defined\/determined\/limited a thing as to time, appoint\/declare\/assign a time, measure of time (e.g. season)."
    },

    {
        "indexid":1097,
        "wordid":8530,
        "word":"وَكَلَّمَهُ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word وَكَلَّمَهُ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":1097,
        "wordid":8531,
        "word":"أَنْظُرْ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word أَنْظُرْ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":1097,
        "wordid":8532,
        "word":"تَرَانِي",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word تَرَانِي comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1097,
        "wordid":8533,
        "word":"الْجَبَلِ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word الْجَبَلِ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":1097,
        "wordid":8534,
        "word":"اسْتَقَرَّ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word اسْتَقَرَّ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":1097,
        "wordid":8535,
        "word":"مَكَانَهُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانَهُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1097,
        "wordid":8537,
        "word":"لِلْجَبَلِ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word لِلْجَبَلِ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":1097,
        "wordid":8538,
        "word":"دَكًّا",
        "rootid":11,
        "rootword":"د ك ك",
        "meanings":"To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces.",
        "sentence":"The word دَكًّا comes from the root د ك ك and is associated with the meanings: To crush, break, beat, deflate, ground, crumble to pieces, be completely crushed and broken to pieces."
    },

    {
        "indexid":1097,
        "wordid":8539,
        "word":"وَخَرَّ",
        "rootid":1071,
        "rootword":"خ ر ر",
        "meanings":"To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another.",
        "sentence":"The word وَخَرَّ comes from the root خ ر ر and is associated with the meanings: To sound murmured\/rumbled or gurgled (water), run so as to make a noise [run\/flow\/trickle down so as to make a murmuring, or similar, sound], to be made to run [TA], sound rustled (wind), to snore or make a sound in breathing, to fall or fall down (making a sound to be heard at the same time) [sometimes used in the sense of falling absolutely], come upon a place or person suddenly or unawares, to be lax or flabby, to pass along or away or by from one place to another."
    },

    {
        "indexid":1097,
        "wordid":8540,
        "word":"صَعِقًا",
        "rootid":622,
        "rootword":"ص ع ق",
        "meanings":"to smite or strike (lightning, thunderbolt), swoon, become unconscious, be stunned, faint.. sa'iqun - one in a swoon.. saAAiqat  (pl. sawaAAiq) - stunning noise as of a thunderbolt, vehement cry, thunderbolt, thunderclap, destructive calamity, death, noise.",
        "sentence":"The word صَعِقًا comes from the root ص ع ق and is associated with the meanings: to smite or strike (lightning, thunderbolt), swoon, become unconscious, be stunned, faint.. sa'iqun - one in a swoon.. saAAiqat  (pl. sawaAAiq) - stunning noise as of a thunderbolt, vehement cry, thunderbolt, thunderclap, destructive calamity, death, noise."
    },

    {
        "indexid":1097,
        "wordid":8541,
        "word":"أَفَاقَ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word أَفَاقَ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    }]}