{"data":[
    {
        "indexid":1099,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1099,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1099,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1099,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1099,
        "wordid":2276,
        "word":"الْفَاسِقِينَ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word الْفَاسِقِينَ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":1099,
        "wordid":2634,
        "word":"بِقُوَّةٍ",
        "rootid":377,
        "rootword":"ق و ي",
        "meanings":"to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted).",
        "sentence":"The word بِقُوَّةٍ comes from the root ق و ي and is associated with the meanings: to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted)."
    },

    {
        "indexid":1099,
        "wordid":5643,
        "word":"لِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word لِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1099,
        "wordid":6825,
        "word":"وَكَتَبْنَا",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word وَكَتَبْنَا comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":1099,
        "wordid":7947,
        "word":"وَتَفْصِيلًا",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word وَتَفْصِيلًا comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    },

    {
        "indexid":1099,
        "wordid":8547,
        "word":"الْأَلْوَاحِ",
        "rootid":1649,
        "rootword":"ل و ح",
        "meanings":"To change colour, become visible, gleam\/shine, light up, scorching one, broad table or plate, tablet.",
        "sentence":"The word الْأَلْوَاحِ comes from the root ل و ح and is associated with the meanings: To change colour, become visible, gleam\/shine, light up, scorching one, broad table or plate, tablet."
    },

    {
        "indexid":1099,
        "wordid":8548,
        "word":"مَوْعِظَةً",
        "rootid":342,
        "rootword":"و ع ظ",
        "meanings":"to admonish, exhort, preach, advise, warn, remind of that which should soften the heart by the mention of reward or punishment, give good advice or counsel, remind of the result of affairs, exhort which leads to repentance and reformation.",
        "sentence":"The word مَوْعِظَةً comes from the root و ع ظ and is associated with the meanings: to admonish, exhort, preach, advise, warn, remind of that which should soften the heart by the mention of reward or punishment, give good advice or counsel, remind of the result of affairs, exhort which leads to repentance and reformation."
    },

    {
        "indexid":1099,
        "wordid":8549,
        "word":"فَخُذْهَا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word فَخُذْهَا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1099,
        "wordid":8550,
        "word":"وَأْمُرْ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word وَأْمُرْ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1099,
        "wordid":8551,
        "word":"قَوْمَكَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمَكَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1099,
        "wordid":8552,
        "word":"يَأْخُذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word يَأْخُذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1099,
        "wordid":8553,
        "word":"بِأَحْسَنِهَا",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word بِأَحْسَنِهَا comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1099,
        "wordid":8554,
        "word":"سَأُورِيكُمْ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word سَأُورِيكُمْ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1099,
        "wordid":8555,
        "word":"دَارَ",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word دَارَ comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    }]}