{"data":[
    {
        "indexid":1106,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1106,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1106,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1106,
        "wordid":2503,
        "word":"الْعِجْلَ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word الْعِجْلَ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":1106,
        "wordid":2817,
        "word":"الْحَيَوةِ",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word الْحَيَوةِ comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":1106,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":1106,
        "wordid":6451,
        "word":"اتَّخَذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word اتَّخَذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1106,
        "wordid":7564,
        "word":"نَجْزِي",
        "rootid":1679,
        "rootword":"ج ز ي",
        "meanings":"Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense.",
        "sentence":"The word نَجْزِي comes from the root ج ز ي and is associated with the meanings: Pay\/give\/render a satisfaction, make sufficient, pay a debt, to contend, repay\/requit\/compensate, to recompense."
    },

    {
        "indexid":1106,
        "wordid":8597,
        "word":"سَيَنَالُهُمْ",
        "rootid":689,
        "rootword":"ن ي ل",
        "meanings":"to obtain\/procure, get, attain, reach, matter.",
        "sentence":"The word سَيَنَالُهُمْ comes from the root ن ي ل and is associated with the meanings: to obtain\/procure, get, attain, reach, matter."
    },

    {
        "indexid":1106,
        "wordid":8598,
        "word":"غَضَبٌ",
        "rootid":523,
        "rootword":"غ ض ب",
        "meanings":"anger\/wrath\/stern, intense\/deep redness",
        "sentence":"The word غَضَبٌ comes from the root غ ض ب and is associated with the meanings: anger\/wrath\/stern, intense\/deep redness"
    },

    {
        "indexid":1106,
        "wordid":8599,
        "word":"وَذِلَّةٌ",
        "rootid":461,
        "rootword":"ذ ل ل",
        "meanings":"to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken.",
        "sentence":"The word وَذِلَّةٌ comes from the root ذ ل ل and is associated with the meanings: to be low, hang low, low\/lowest part of something, subdued, gentle, abase, easy, submissive, meek, subject, humble, humility, paltry, wings of submissiveness out of tenderness, treating with compassion.Vileness, ignominy, weakness, despicable, meakness, abjectness, abasement.Well-trained, tractable, manageable, commodious, broken."
    },

    {
        "indexid":1106,
        "wordid":8600,
        "word":"الْمُفْتَرِينَ",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word الْمُفْتَرِينَ comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    }]}