{"data":[
    {
        "indexid":1117,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1117,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1117,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1117,
        "wordid":2563,
        "word":"يَفْسُقُونَ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word يَفْسُقُونَ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":1117,
        "wordid":2646,
        "word":"السَّبْتِ",
        "rootid":627,
        "rootword":"س ب ت",
        "meanings":"to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless.",
        "sentence":"The word السَّبْتِ comes from the root س ب ت and is associated with the meanings: to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless."
    },

    {
        "indexid":1117,
        "wordid":2819,
        "word":"وَيَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word وَيَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1117,
        "wordid":2887,
        "word":"كَانَتْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَتْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1117,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1117,
        "wordid":3404,
        "word":"الْبَحْرِ",
        "rootid":403,
        "rootword":"ب ح ر",
        "meanings":"Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?",
        "sentence":"The word الْبَحْرِ comes from the root ب ح ر and is associated with the meanings: Slit, cut, divide lengthwise, split, enlarge or make wideEmbarking upon the sea or a great river (vast expanse of water)Growing in anything (wealth, possessions, knowledge etc)A vast expanse of water (Ocean, sea, huge river)A fleet swift horse called because of its speed like the rolling of the waves in the seaA generous man who is ample in his generosityWide tract of land, land belonging to or inhabited by peopleAny town, village or city that has a running river or a body of waterLow or depressed landA large meadow or gardenA place where water stagnatesOf, relating to, or belonging to the ocean, sea or any vast body of waterSeaman, sailorVehemence of heat (corresponding to the month of July, Syrian)The moon\"Bahira\" (a camel dedicated to idols, 5:103)?"
    },

    {
        "indexid":1117,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1117,
        "wordid":6069,
        "word":"الْقَرْيَةِ",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word الْقَرْيَةِ comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":1117,
        "wordid":7212,
        "word":"تَأْتِيهِمْ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word تَأْتِيهِمْ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":1117,
        "wordid":8661,
        "word":"وَسْءَلْهُمْ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word وَسْءَلْهُمْ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":1117,
        "wordid":8662,
        "word":"حَاضِرَةَ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word حَاضِرَةَ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    },

    {
        "indexid":1117,
        "wordid":8663,
        "word":"يَعْدُونَ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word يَعْدُونَ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":1117,
        "wordid":8664,
        "word":"حِيتَانُهُمْ",
        "rootid":1128,
        "rootword":"ح و ت",
        "meanings":"(Ha-Alif-Ta) To fly about, prowl around. Ha-Waw- Tay = (Ha-Alif-Tay) To watch, guard, protect, surround.",
        "sentence":"The word حِيتَانُهُمْ comes from the root ح و ت and is associated with the meanings: (Ha-Alif-Ta) To fly about, prowl around. Ha-Waw- Tay = (Ha-Alif-Tay) To watch, guard, protect, surround."
    },

    {
        "indexid":1117,
        "wordid":8665,
        "word":"سَبْتِهِمْ",
        "rootid":627,
        "rootword":"س ب ت",
        "meanings":"to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless.",
        "sentence":"The word سَبْتِهِمْ comes from the root س ب ت and is associated with the meanings: to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless."
    },

    {
        "indexid":1117,
        "wordid":8666,
        "word":"شُرَّعًا",
        "rootid":1016,
        "rootword":"ش ر ع",
        "meanings":"to be seated upon a road, open a street (door), establish a law, begin, appoint a religion. shurra'un (pl. of shaari'un) - in shoals, upon shoals, breaking the water surface, holding up (their heads), appearing manifestly. shir'atun & shari'atun - law or institution prescribed by God, right way or mode of action, clear highway\/course\/path.",
        "sentence":"The word شُرَّعًا comes from the root ش ر ع and is associated with the meanings: to be seated upon a road, open a street (door), establish a law, begin, appoint a religion. shurra'un (pl. of shaari'un) - in shoals, upon shoals, breaking the water surface, holding up (their heads), appearing manifestly. shir'atun & shari'atun - law or institution prescribed by God, right way or mode of action, clear highway\/course\/path."
    },

    {
        "indexid":1117,
        "wordid":8667,
        "word":"يَسْبِتُونَ",
        "rootid":627,
        "rootword":"س ب ت",
        "meanings":"to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless.",
        "sentence":"The word يَسْبِتُونَ comes from the root س ب ت and is associated with the meanings: to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless."
    },

    {
        "indexid":1117,
        "wordid":8668,
        "word":"نَبْلُوهُمْ",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word نَبْلُوهُمْ comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    }]}