{"data":[
    {
        "indexid":1121,
        "wordid":2009,
        "word":"يَوْمِ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمِ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1121,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1121,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1121,
        "wordid":2308,
        "word":"رَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1121,
        "wordid":2481,
        "word":"سُوءَ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سُوءَ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":1121,
        "wordid":2482,
        "word":"الْعَذَابِ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابِ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":1121,
        "wordid":2588,
        "word":"رَبَّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1121,
        "wordid":2820,
        "word":"الْقِيَامَةِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقِيَامَةِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1121,
        "wordid":3282,
        "word":"رَحِيمٌ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمٌ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1121,
        "wordid":3716,
        "word":"الْعِقَابِ",
        "rootid":1507,
        "rootword":"ع ق ب",
        "meanings":"to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged.",
        "sentence":"The word الْعِقَابِ comes from the root ع ق ب and is associated with the meanings: to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged."
    },

    {
        "indexid":1121,
        "wordid":7991,
        "word":"لَغَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word لَغَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":1121,
        "wordid":8678,
        "word":"تَأَذَّنَ",
        "rootid":961,
        "rootword":"ا ذ ن",
        "meanings":"he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning.",
        "sentence":"The word تَأَذَّنَ comes from the root ا ذ ن and is associated with the meanings: he gave ear or listened to it, being pleased, grant leave, to allow, permit\/ordered, be informed, advised, notification\/announcement\/proclamation, ear, appetite\/longing\/yearning."
    },

    {
        "indexid":1121,
        "wordid":8679,
        "word":"لَيَبْعَثَنَّ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word لَيَبْعَثَنَّ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":1121,
        "wordid":8680,
        "word":"يَسُومُهُمْ",
        "rootid":782,
        "rootword":"س و م",
        "meanings":"to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture.",
        "sentence":"The word يَسُومُهُمْ comes from the root س و م and is associated with the meanings: to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture."
    },

    {
        "indexid":1121,
        "wordid":8681,
        "word":"لَسَرِيعُ",
        "rootid":1222,
        "rootword":"س ر ع",
        "meanings":"to hasten, be quick, swift\/prompt\/sudden, strive with one another.",
        "sentence":"The word لَسَرِيعُ comes from the root س ر ع and is associated with the meanings: to hasten, be quick, swift\/prompt\/sudden, strive with one another."
    }]}