{"data":[
    {
        "indexid":1126,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1126,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1126,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1126,
        "wordid":2308,
        "word":"رَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1126,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1126,
        "wordid":2771,
        "word":"بَلَى",
        "rootid":350,
        "rootword":"ب ل ي",
        "meanings":"decay, wear out.",
        "sentence":"The word بَلَى comes from the root ب ل ي and is associated with the meanings: decay, wear out."
    },

    {
        "indexid":1126,
        "wordid":2779,
        "word":"بَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":1126,
        "wordid":2820,
        "word":"الْقِيَامَةِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقِيَامَةِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1126,
        "wordid":2939,
        "word":"ظُهُورِهِمْ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظُهُورِهِمْ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":1126,
        "wordid":2980,
        "word":"تَقُولُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word تَقُولُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1126,
        "wordid":3020,
        "word":"أَنْفُسِهِمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسِهِمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1126,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1126,
        "wordid":4981,
        "word":"أَخَذَ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word أَخَذَ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1126,
        "wordid":5518,
        "word":"بِرَبِّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word بِرَبِّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1126,
        "wordid":6225,
        "word":"كُنَّا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنَّا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1126,
        "wordid":7806,
        "word":"شَهِدْنَا",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شَهِدْنَا comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":1126,
        "wordid":8494,
        "word":"غَافِلِينَ",
        "rootid":921,
        "rootword":"غ ف ل",
        "meanings":"unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away",
        "sentence":"The word غَافِلِينَ comes from the root غ ف ل and is associated with the meanings: unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away"
    },

    {
        "indexid":1126,
        "wordid":8708,
        "word":"ذُرِّيَّتَهُمْ",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّتَهُمْ comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":1126,
        "wordid":8709,
        "word":"وَأَشْهَدَهُمْ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word وَأَشْهَدَهُمْ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":1126,
        "wordid":8710,
        "word":"أَلَسْتُ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word أَلَسْتُ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    }]}