{"data":[
    {
        "indexid":1154,
        "wordid":2079,
        "word":"بِاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word بِاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1154,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1154,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1154,
        "wordid":3548,
        "word":"سَمِيعٌ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِيعٌ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":1154,
        "wordid":8815,
        "word":"يَنْزَغَنَّكَ",
        "rootid":938,
        "rootword":"ن ز غ",
        "meanings":"to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive.",
        "sentence":"The word يَنْزَغَنَّكَ comes from the root ن ز غ and is associated with the meanings: to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive."
    },

    {
        "indexid":1154,
        "wordid":8816,
        "word":"نَزْغٌ",
        "rootid":938,
        "rootword":"ن ز غ",
        "meanings":"to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive.",
        "sentence":"The word نَزْغٌ comes from the root ن ز غ and is associated with the meanings: to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive."
    },

    {
        "indexid":1154,
        "wordid":8817,
        "word":"فَاسْتَعِذْ",
        "rootid":1751,
        "rootword":"ع و ذ",
        "meanings":"to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge.",
        "sentence":"The word فَاسْتَعِذْ comes from the root ع و ذ and is associated with the meanings: to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge."
    }]}