{"data":[
    {
        "indexid":1189,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1189,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1189,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1189,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":1189,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1189,
        "wordid":2507,
        "word":"عَنْكُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْكُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1189,
        "wordid":2989,
        "word":"ذُو",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذُو comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":1189,
        "wordid":2990,
        "word":"الْفَضْلِ",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word الْفَضْلِ comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":1189,
        "wordid":2991,
        "word":"الْعَظِيمِ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word الْعَظِيمِ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":1189,
        "wordid":4395,
        "word":"سَيِّئَاتِكُمْ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَيِّئَاتِكُمْ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":1189,
        "wordid":4695,
        "word":"تَتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word تَتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":1189,
        "wordid":4714,
        "word":"وَيَغْفِرْ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word وَيَغْفِرْ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":1189,
        "wordid":7779,
        "word":"يَجْعَلْ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word يَجْعَلْ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1189,
        "wordid":8935,
        "word":"فُرْقَانًا",
        "rootid":1165,
        "rootword":"ف ر ق",
        "meanings":"o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear.",
        "sentence":"The word فُرْقَانًا comes from the root ف ر ق and is associated with the meanings: o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear."
    },

    {
        "indexid":1189,
        "wordid":8936,
        "word":"وَيُكَفِّرْ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word وَيُكَفِّرْ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}