{"data":[
    {
        "indexid":1219,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1219,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1219,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":1219,
        "wordid":5441,
        "word":"يَحْسَبَنَّ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word يَحْسَبَنَّ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":1219,
        "wordid":9037,
        "word":"سَبَقُوا",
        "rootid":882,
        "rootword":"س ب ق",
        "meanings":"to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race.",
        "sentence":"The word سَبَقُوا comes from the root س ب ق and is associated with the meanings: to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race."
    },

    {
        "indexid":1219,
        "wordid":9038,
        "word":"يُعْجِزُونَ",
        "rootid":453,
        "rootword":"ع ج ز",
        "meanings":"to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. ",
        "sentence":"The word يُعْجِزُونَ comes from the root ع ج ز and is associated with the meanings: to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. "
    }]}