{"data":[
    {
        "indexid":1227,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1227,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1227,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1227,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1227,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1227,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1227,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":1227,
        "wordid":3002,
        "word":"تُرِيدُونَ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word تُرِيدُونَ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":1227,
        "wordid":3323,
        "word":"يَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1227,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":1227,
        "wordid":3792,
        "word":"عَزِيزٌ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word عَزِيزٌ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":1227,
        "wordid":3793,
        "word":"حَكِيمٌ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حَكِيمٌ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":1227,
        "wordid":4125,
        "word":"لِنَبِيٍّ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word لِنَبِيٍّ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":1227,
        "wordid":5297,
        "word":"الْءَاخِرَةَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":1227,
        "wordid":6201,
        "word":"عَرَضَ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word عَرَضَ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":1227,
        "wordid":9079,
        "word":"أَسْرَى",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word أَسْرَى comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":1227,
        "wordid":9080,
        "word":"يُثْخِنَ",
        "rootid":1597,
        "rootword":"ث خ ن",
        "meanings":"to be thick, become coarse, stiff, subdue thoroughly, have a regular fighting, cause much slaughter, have a triumphant war. athkhana - to do something great, make much slaughter, overcome, battle strenuously.",
        "sentence":"The word يُثْخِنَ comes from the root ث خ ن and is associated with the meanings: to be thick, become coarse, stiff, subdue thoroughly, have a regular fighting, cause much slaughter, have a triumphant war. athkhana - to do something great, make much slaughter, overcome, battle strenuously."
    }]}