{"data":[
    {
        "indexid":1270,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1270,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1270,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1270,
        "wordid":3028,
        "word":"لِأَنْفُسِكُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word لِأَنْفُسِكُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1270,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1270,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":1270,
        "wordid":5082,
        "word":"فَذُوقُوا",
        "rootid":1121,
        "rootword":"ذ و ق",
        "meanings":"to taste\/experience\/try\/perceive. One who tastes, cause to taste.",
        "sentence":"The word فَذُوقُوا comes from the root ذ و ق and is associated with the meanings: to taste\/experience\/try\/perceive. One who tastes, cause to taste."
    },

    {
        "indexid":1270,
        "wordid":9244,
        "word":"يُحْمَى",
        "rootid":1521,
        "rootword":"ح م ي",
        "meanings":"To protect\/prohibit\/guard\/defend against encroachment\/attack. A thing prohibited. Vehement\/angry, it was\/became hot (e.g. day, oven), disdain\/scorn\/indignation.",
        "sentence":"The word يُحْمَى comes from the root ح م ي and is associated with the meanings: To protect\/prohibit\/guard\/defend against encroachment\/attack. A thing prohibited. Vehement\/angry, it was\/became hot (e.g. day, oven), disdain\/scorn\/indignation."
    },

    {
        "indexid":1270,
        "wordid":9245,
        "word":"نَارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1270,
        "wordid":9246,
        "word":"فَتُكْوَى",
        "rootid":1318,
        "rootword":"ك و ي",
        "meanings":"(Kaf-Alif-Ya) To burn, sear, scorch, brand, cauterize.",
        "sentence":"The word فَتُكْوَى comes from the root ك و ي and is associated with the meanings: (Kaf-Alif-Ya) To burn, sear, scorch, brand, cauterize."
    },

    {
        "indexid":1270,
        "wordid":9247,
        "word":"جِبَاهُهُمْ",
        "rootid":1641,
        "rootword":"ج ب ه",
        "meanings":"He slapped\/struck\/hit him. He said to him something disliked\/hated and he accused him thereof to his face. The forehead. Largeness\/width and beauty of the forehead. The protuberance\/prominence of the forehead. The upper part of the disc of the moon. The chief of people\/company of men. Abjectness\/ignominy. A state of annoyance\/molestation.",
        "sentence":"The word جِبَاهُهُمْ comes from the root ج ب ه and is associated with the meanings: He slapped\/struck\/hit him. He said to him something disliked\/hated and he accused him thereof to his face. The forehead. Largeness\/width and beauty of the forehead. The protuberance\/prominence of the forehead. The upper part of the disc of the moon. The chief of people\/company of men. Abjectness\/ignominy. A state of annoyance\/molestation."
    },

    {
        "indexid":1270,
        "wordid":9248,
        "word":"وَجُنُوبُهُمْ",
        "rootid":1358,
        "rootword":"ج ن ب",
        "meanings":"To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of.",
        "sentence":"The word وَجُنُوبُهُمْ comes from the root ج ن ب and is associated with the meanings: To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of."
    },

    {
        "indexid":1270,
        "wordid":9249,
        "word":"وَظُهُورُهُمْ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word وَظُهُورُهُمْ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":1270,
        "wordid":9250,
        "word":"كَنَزْتُمْ",
        "rootid":383,
        "rootword":"ك ن ز",
        "meanings":"to collect and store up, treasure, bury in the ground a treasure.",
        "sentence":"The word كَنَزْتُمْ comes from the root ك ن ز and is associated with the meanings: to collect and store up, treasure, bury in the ground a treasure."
    },

    {
        "indexid":1270,
        "wordid":9251,
        "word":"تَكْنِزُونَ",
        "rootid":383,
        "rootword":"ك ن ز",
        "meanings":"to collect and store up, treasure, bury in the ground a treasure.",
        "sentence":"The word تَكْنِزُونَ comes from the root ك ن ز and is associated with the meanings: to collect and store up, treasure, bury in the ground a treasure."
    }]}