{"data":[
    {
        "indexid":1282,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1282,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1282,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1282,
        "wordid":2896,
        "word":"بِالظَّالِمِينَ",
        "rootid":434,
        "rootword":"ظ ل م",
        "meanings":"Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]",
        "sentence":"The word بِالظَّالِمِينَ comes from the root ظ ل م and is associated with the meanings: Zalima - To be dark, obscure. To give shade [shelter, protection]. A thing that covers, protects, [or shades] one, overhead. ظلمات thulumati\/in\/un - Obscurity, darkness [2:17, 19; 6:59, 63, 97; 24:40; 27:63; 39:6] اظلم athlama\/u - He becomes dark, enters upon the darkness [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7] الظلمات thulumati\/u - Obscurity, darkness [2:257 (2x); 5:16; 6:1, 39, 122; 13:16; 14:1, 5; 21:87; 33:43; 35:20; 57:9; 65:11] Zalama - To do wrong or evil, treat unjustly, ill-treat, oppress, harm, suppress, tyrannize, misuse, act wrongfully, deprive anyone of a right, misplace, injure, be oppressive, be guilty of injustice, act wickedly, be wanting in or fail. [P. 1920-23. Lanes; P. 351-52. QD] الظالمين thalimeena - Wrongdoers [2:35, 124, 145, 193, 258; 3:57, 86, 140, 151; 5:29, 51, 107; 6:33, 52, 68, 129, 144; 7:19, 41, 44, 47, 150; 9:19, 109; 10:39, 85, 106; 11:18, 31, 44, 83; 12:75; 14:13, 22, 27; 17:82; 19:72; 21:29, 59, 87; 22:53; 23:28, 11, 94; 26:10; 28:21, 25, 40, 50; 40:52; 42:21, 22, 40, 44, 45; 43:76; 45:19; 46:10; 59:17; 61:7; 62:5; 66:11; 71:24, 28] ظلمتم thalamtum - You wronged [2:54; 43:39] ظلمناهم thalamna - We wronged [11:101; 16:118; 43:76] ظالم thalimun - One who treats unjustly [18:35; 35:32] ظلمت thalamtu - I wronged, did wrong [10:54; 27:44; 28:16] يظلمون yathlimoona\/yuthlamoona - They wronged, they shall be wronged [2:57, 281; 3:25, 117, 161; 4:49, 124; 6:160; 7:9, 160, 162, 177; 9:70; 10:44, 47, 54; 16:33, 111, 118; 17:71; 19:60; 23:62; 29:40; 30:9; 39:69; 42:42; 45:22; 46:19] ليظلمهم yathlima - He was to do wrong [9:70] لم تظلم lam tathlimu\/tuthlamu - Stinted not, failing not; you were wronged [18:33; 21:47; 36:54] ليظلمهم yathlima - He was to do wrong [9:70; 29:40; 30:9] الظالمون thalimoon - Wrongdoers [2:229, 254; 3:94; 5:45; 6:21, 47, 93, 135; 9:23; 12:23; 14:42; 17:47, 99; 19:38; 21:64; 24:50; 25:8; 28:37; 29:49; 31:11; 34:31; 35:40; 49:11; 60:9] مظلوما mathlooman - Oppressed, vexed, wronged [17:33] بظلم thulmin - Wrongdoing [6:82, 131; 11:117; 22:25] ظالمون thalimoona - Wrongdoers [2:51, 92; 3:128; 16:113; 23:107; 28:59; 29:14] ظلم thalama\/thulima\/thulma - He wronged\/He was wronged [2:231; 4:148; 18:87; 27:11; 40:17; 65:1] يظلم yathlim\/u - He does wrong [4:40, 110; 10:44; 18:49; 25:19] ظالمين thalimeena - Wrongdoers [7:5, 148; 8:54; 21:14, 46, 97; 26:209; 29:31; 68:29] الظالم thalim - [4:75; 25:27] تظلموا tathlimoo - O you! Wrong not [9:36] اظلم athlama\/u - To do unjustly, evil [2:20, 114, 140; 6:21, 93, 144, 157; 7:37; 10:17; 11:18; 18:15, 57; 29:68; 32:22; 39:32; 53:52; 61:7]"
    },

    {
        "indexid":1282,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":1282,
        "wordid":3331,
        "word":"فِيكُمْ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيكُمْ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1282,
        "wordid":4106,
        "word":"خَرَجُوا",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word خَرَجُوا comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":1282,
        "wordid":5052,
        "word":"وَفِيكُمْ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word وَفِيكُمْ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1282,
        "wordid":5123,
        "word":"خَبَالًا",
        "rootid":469,
        "rootword":"خ ب ل",
        "meanings":"To be or become corrupted, unsound, vitiated or disordered in intellect or reason, become possessed or insane, be lost, cut off, deprived of heart or reason. Prevent or hinder from doing a thing. Affliction\/trouble\/difficulty\/distress\/fatigue.Seek to corrupt, render unsound, occasioning to agitation like that of possession or insanity, by disease affecting the reason and thought.Difficulty in people in which they see not happiness.Egregious stupidity or foolishness, heedlessness or weakness of intellect, state of perdition or destruction. Disordered in the legs so as not to know how to walk.Going\/passing\/wasting away, being consumed or destroyed.To lend. Jinn, devil, mankind.",
        "sentence":"The word خَبَالًا comes from the root خ ب ل and is associated with the meanings: To be or become corrupted, unsound, vitiated or disordered in intellect or reason, become possessed or insane, be lost, cut off, deprived of heart or reason. Prevent or hinder from doing a thing. Affliction\/trouble\/difficulty\/distress\/fatigue.Seek to corrupt, render unsound, occasioning to agitation like that of possession or insanity, by disease affecting the reason and thought.Difficulty in people in which they see not happiness.Egregious stupidity or foolishness, heedlessness or weakness of intellect, state of perdition or destruction. Disordered in the legs so as not to know how to walk.Going\/passing\/wasting away, being consumed or destroyed.To lend. Jinn, devil, mankind."
    },

    {
        "indexid":1282,
        "wordid":6796,
        "word":"سَمَّاعُونَ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمَّاعُونَ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":1282,
        "wordid":9319,
        "word":"زَادُوكُمْ",
        "rootid":51,
        "rootword":"ز ي د",
        "meanings":"increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus",
        "sentence":"The word زَادُوكُمْ comes from the root ز ي د and is associated with the meanings: increased\/augmented\/grew, exceeded, was\/became redundant\/superfluous, remain over & above, addition, exaggerate, accessory, surplus"
    },

    {
        "indexid":1282,
        "wordid":9320,
        "word":"وَلَأَوْضَعُوا",
        "rootid":1308,
        "rootword":"و ض ع",
        "meanings":"he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing.",
        "sentence":"The word وَلَأَوْضَعُوا comes from the root و ض ع and is associated with the meanings: he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing."
    },

    {
        "indexid":1282,
        "wordid":9321,
        "word":"خِلَالَكُمْ",
        "rootid":1000,
        "rootword":"خ ل ل",
        "meanings":"To become lean, to diminish\/decrease\/waste away, to be poor, be of want or need, to perforate\/pierce\/skewer a  thing, to remove\/transfer\/shift, to pick or extract the remains of, put into the interstices of a thing, to spoil or become sour, make wine into vinegar, act as a true and sincere friend, fall short of accomplishing a task, to neglect\/omit or leave undone, to absent one's self, produce bad fruit, enter\/penetrate or pass through, interrupt or intervene, to be shaky\/ loose\/ faulty\/ defective, to be uncompact\/disordered\/unsound, to be corrupt or disordered in temperament, to attire with an anklet or pair of anklets, to be old and worn out, to die and leave a gap\/ vacancy, to be of habit\/ custom, show true and sincere affection\/ friendship\/ love, to be flawed\/imperfect\/deficient, to leave one thing for another.",
        "sentence":"The word خِلَالَكُمْ comes from the root خ ل ل and is associated with the meanings: To become lean, to diminish\/decrease\/waste away, to be poor, be of want or need, to perforate\/pierce\/skewer a  thing, to remove\/transfer\/shift, to pick or extract the remains of, put into the interstices of a thing, to spoil or become sour, make wine into vinegar, act as a true and sincere friend, fall short of accomplishing a task, to neglect\/omit or leave undone, to absent one's self, produce bad fruit, enter\/penetrate or pass through, interrupt or intervene, to be shaky\/ loose\/ faulty\/ defective, to be uncompact\/disordered\/unsound, to be corrupt or disordered in temperament, to attire with an anklet or pair of anklets, to be old and worn out, to die and leave a gap\/ vacancy, to be of habit\/ custom, show true and sincere affection\/ friendship\/ love, to be flawed\/imperfect\/deficient, to leave one thing for another."
    },

    {
        "indexid":1282,
        "wordid":9322,
        "word":"يَبْغُونَكُمُ",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word يَبْغُونَكُمُ comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":1282,
        "wordid":9323,
        "word":"الْفِتْنَةَ",
        "rootid":159,
        "rootword":"ف ت ن",
        "meanings":"to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire.",
        "sentence":"The word الْفِتْنَةَ comes from the root ف ت ن and is associated with the meanings: to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire."
    }]}