{"data":[
    {
        "indexid":1300,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1300,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1300,
        "wordid":4444,
        "word":"وَرَسُولِهِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَرَسُولِهِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1300,
        "wordid":6225,
        "word":"كُنَّا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنَّا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1300,
        "wordid":9390,
        "word":"سَأَلْتَهُمْ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word سَأَلْتَهُمْ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":1300,
        "wordid":9391,
        "word":"لَيَقُولُنَّ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word لَيَقُولُنَّ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1300,
        "wordid":9392,
        "word":"نَخُوضُ",
        "rootid":1321,
        "rootword":"خ و ض",
        "meanings":"To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair.",
        "sentence":"The word نَخُوضُ comes from the root خ و ض and is associated with the meanings: To wade\/walk\/pass through\/enter, to bring one thing to another, to penetrate or force one's way to or through a thing, plunge into a thing, follow erring, enter into false\/vain discourse or speech, mix and stir about (beverage or wine), act wrongly or in an improper manner concerning an affair."
    },

    {
        "indexid":1300,
        "wordid":9393,
        "word":"وَنَلْعَبُ",
        "rootid":1150,
        "rootword":"ل ع ب",
        "meanings":"played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool.",
        "sentence":"The word وَنَلْعَبُ comes from the root ل ع ب and is associated with the meanings: played\/sported\/gamed\/jested\/joked, passtime (in an unserious thing), engage in idle sport without meaning or purpose, slaver\/drivel, stupid\/fool."
    },

    {
        "indexid":1300,
        "wordid":9394,
        "word":"أَبِاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word أَبِاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1300,
        "wordid":9396,
        "word":"تَسْتَهْزِئُونَ",
        "rootid":1496,
        "rootword":"ه ز ا",
        "meanings":"to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) .",
        "sentence":"The word تَسْتَهْزِئُونَ comes from the root ه ز ا and is associated with the meanings: to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) ."
    }]}