{"data":[
    {
        "indexid":1343,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1343,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1343,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1343,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1343,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1343,
        "wordid":2894,
        "word":"أَبَدًا",
        "rootid":450,
        "rootword":"ا ب د",
        "meanings":"he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction).",
        "sentence":"The word أَبَدًا comes from the root ا ب د and is associated with the meanings: he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction)."
    },

    {
        "indexid":1343,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":1343,
        "wordid":3729,
        "word":"التَّقْوَى",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word التَّقْوَى comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":1343,
        "wordid":3959,
        "word":"أَحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word أَحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":1343,
        "wordid":4280,
        "word":"يَوْمٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1343,
        "wordid":8162,
        "word":"رِجَالٌ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رِجَالٌ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":1343,
        "wordid":9488,
        "word":"تَقُمْ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word تَقُمْ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1343,
        "wordid":9579,
        "word":"لَمَسْجِدٌ",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word لَمَسْجِدٌ comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":1343,
        "wordid":9580,
        "word":"أُسِّسَ",
        "rootid":963,
        "rootword":"ا س س",
        "meanings":"to lay foundation.",
        "sentence":"The word أُسِّسَ comes from the root ا س س and is associated with the meanings: to lay foundation."
    },

    {
        "indexid":1343,
        "wordid":9581,
        "word":"أَوَّلِ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word أَوَّلِ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":1343,
        "wordid":9582,
        "word":"تَقُومَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word تَقُومَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1343,
        "wordid":9583,
        "word":"يُحِبُّونَ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّونَ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":1343,
        "wordid":9584,
        "word":"يَتَطَهَّرُوا",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word يَتَطَهَّرُوا comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    },

    {
        "indexid":1343,
        "wordid":9585,
        "word":"الْمُطَّهِّرِينَ",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word الْمُطَّهِّرِينَ comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    }]}