{"data":[
    {
        "indexid":1355,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1355,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1355,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1355,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1355,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1355,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1355,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1355,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1355,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1355,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1355,
        "wordid":2556,
        "word":"الْمُحْسِنِينَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْمُحْسِنِينَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1355,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1355,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1355,
        "wordid":3345,
        "word":"سَبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":1355,
        "wordid":3514,
        "word":"كُتِبَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كُتِبَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":1355,
        "wordid":5025,
        "word":"نَفْسِهِ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word نَفْسِهِ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1355,
        "wordid":5412,
        "word":"يُضِيعُ",
        "rootid":772,
        "rootword":"ض ي ع",
        "meanings":"perished, came to nought, passed away, became lost, left alone, neglected, unmindful, destroyed, wasted.",
        "sentence":"The word يُضِيعُ comes from the root ض ي ع and is associated with the meanings: perished, came to nought, passed away, became lost, left alone, neglected, unmindful, destroyed, wasted."
    },

    {
        "indexid":1355,
        "wordid":5413,
        "word":"أَجْرَ",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word أَجْرَ comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    },

    {
        "indexid":1355,
        "wordid":6183,
        "word":"عَدُوٍّ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word عَدُوٍّ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":1355,
        "wordid":7767,
        "word":"بِأَنْفُسِهِمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word بِأَنْفُسِهِمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1355,
        "wordid":8440,
        "word":"الْمَدِينَةِ",
        "rootid":1559,
        "rootword":"م د ن",
        "meanings":"city",
        "sentence":"The word الْمَدِينَةِ comes from the root م د ن and is associated with the meanings: city"
    },

    {
        "indexid":1355,
        "wordid":9435,
        "word":"الْكُفَّارَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكُفَّارَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":1355,
        "wordid":9472,
        "word":"رَسُولِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word رَسُولِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1355,
        "wordid":9499,
        "word":"الْأَعْرَابِ",
        "rootid":1594,
        "rootword":"ع ر ب",
        "meanings":"Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven.",
        "sentence":"The word الْأَعْرَابِ comes from the root ع ر ب and is associated with the meanings: Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven."
    },

    {
        "indexid":1355,
        "wordid":9637,
        "word":"لِأَهْلِ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word لِأَهْلِ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":1355,
        "wordid":9638,
        "word":"حَوْلَهُمْ",
        "rootid":46,
        "rootword":"ح و ل",
        "meanings":"(Ha-Alif-Lam) To be changed, come in between, pass by.",
        "sentence":"The word حَوْلَهُمْ comes from the root ح و ل and is associated with the meanings: (Ha-Alif-Lam) To be changed, come in between, pass by."
    },

    {
        "indexid":1355,
        "wordid":9639,
        "word":"يَتَخَلَّفُوا",
        "rootid":1232,
        "rootword":"خ ل ف",
        "meanings":"To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar",
        "sentence":"The word يَتَخَلَّفُوا comes from the root خ ل ف and is associated with the meanings: To follow\/come after\/succeed another, substitute or supersede, to supply\/be a supplier to someone, to restore or replace a thing to someone, smite or strike from behind, yearn towards other than one's spouse (in the spouses absence\/behind his or her back), speak of\/mention someone behind his or her back, remain behind\/not go forth, to be kept back from all good, to not prosper or be successful, to become corrupt or altered for the worse, retire\/withdraw\/go away, to turn away from\/avoid\/shun a thing, to become foolish\/idiotic\/deficient in intellect, contrarious\/hard in disposition, to leave behind, to appoint someone as successor, disagree with or differ from someone, contradict or oppose someone, to break\/fail to perform a promise, to follow reciprocally\/alternate\/interchange, repeatedly move to and fro (coming and going), to differ\/ be dissimilar"
    },

    {
        "indexid":1355,
        "wordid":9640,
        "word":"يَرْغَبُوا",
        "rootid":164,
        "rootword":"ر غ ب",
        "meanings":"to desire, long for, wish, he made it wide\/ample. With 'an - to show aversion to, dislike, have no desire. With ba and 'an (9:120) - to have preferred their own lives to his life. With ila - to supplicate. raghbun - love, longing. raghibun - one who supplicates earnestly.",
        "sentence":"The word يَرْغَبُوا comes from the root ر غ ب and is associated with the meanings: to desire, long for, wish, he made it wide\/ample. With 'an - to show aversion to, dislike, have no desire. With ba and 'an (9:120) - to have preferred their own lives to his life. With ila - to supplicate. raghbun - love, longing. raghibun - one who supplicates earnestly."
    },

    {
        "indexid":1355,
        "wordid":9641,
        "word":"يُصِيبُهُمْ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word يُصِيبُهُمْ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":1355,
        "wordid":9642,
        "word":"ظَمَأٌ",
        "rootid":646,
        "rootword":"ظ م ا",
        "meanings":"to be thirsty, desire a thing, alter a thing (heat), jade.",
        "sentence":"The word ظَمَأٌ comes from the root ظ م ا and is associated with the meanings: to be thirsty, desire a thing, alter a thing (heat), jade."
    },

    {
        "indexid":1355,
        "wordid":9643,
        "word":"نَصَبٌ",
        "rootid":296,
        "rootword":"ن ص ب",
        "meanings":"to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant.",
        "sentence":"The word نَصَبٌ comes from the root ن ص ب and is associated with the meanings: to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant."
    },

    {
        "indexid":1355,
        "wordid":9644,
        "word":"مَخْمَصَةٌ",
        "rootid":757,
        "rootword":"خ م ص",
        "meanings":"Hungry, hollow\/empty in the belly, shrink or draw away from.",
        "sentence":"The word مَخْمَصَةٌ comes from the root خ م ص and is associated with the meanings: Hungry, hollow\/empty in the belly, shrink or draw away from."
    },

    {
        "indexid":1355,
        "wordid":9645,
        "word":"يَطَئُونَ",
        "rootid":729,
        "rootword":"و ط ا",
        "meanings":"to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform.",
        "sentence":"The word يَطَئُونَ comes from the root و ط ا and is associated with the meanings: to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform."
    },

    {
        "indexid":1355,
        "wordid":9646,
        "word":"مَوْطِئًا",
        "rootid":729,
        "rootword":"و ط ا",
        "meanings":"to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform.",
        "sentence":"The word مَوْطِئًا comes from the root و ط ا and is associated with the meanings: to tread upon, walk on, press the ground or anything beneath the feet, trample on, level, make plam. tawaata'a - to agree with each other respecting the affair.. . Yata'auna (imp. 3rd. p. m. plu.): They tread, step, enter a land, destroy.. Tata'u (imp. 2nd. p. m. plu.): Ye have trodden, entered.. Tata'uu (imp. 2nd. p. m. plu. acc.): That ye may trample on, trodden down.. Wat'an (v. n.): Curbing, Subduing; Treading.. Mauti'an (n. place. acc.): Trodden place.. Yuwaati'uu (III.): Adjust; Make equal; Conform."
    },

    {
        "indexid":1355,
        "wordid":9647,
        "word":"يَغِيظُ",
        "rootid":23,
        "rootword":"غ ي ظ",
        "meanings":"anger, wrath, rage, vehemence, distress; cooking-pot",
        "sentence":"The word يَغِيظُ comes from the root غ ي ظ and is associated with the meanings: anger, wrath, rage, vehemence, distress; cooking-pot"
    },

    {
        "indexid":1355,
        "wordid":9648,
        "word":"يَنَالُونَ",
        "rootid":689,
        "rootword":"ن ي ل",
        "meanings":"to obtain\/procure, get, attain, reach, matter.",
        "sentence":"The word يَنَالُونَ comes from the root ن ي ل and is associated with the meanings: to obtain\/procure, get, attain, reach, matter."
    },

    {
        "indexid":1355,
        "wordid":9649,
        "word":"نَيْلًا",
        "rootid":689,
        "rootword":"ن ي ل",
        "meanings":"to obtain\/procure, get, attain, reach, matter.",
        "sentence":"The word نَيْلًا comes from the root ن ي ل and is associated with the meanings: to obtain\/procure, get, attain, reach, matter."
    },

    {
        "indexid":1355,
        "wordid":9650,
        "word":"عَمَلٌ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word عَمَلٌ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1355,
        "wordid":9651,
        "word":"صَالِحٌ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word صَالِحٌ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    }]}