{"data":[
    {
        "indexid":1357,
        "wordid":2010,
        "word":"الدِّينِ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word الدِّينِ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":1357,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1357,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1357,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1357,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1357,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1357,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1357,
        "wordid":3787,
        "word":"كَافَّةً",
        "rootid":1285,
        "rootword":"ك ف ف",
        "meanings":"To withhold, desist, refrain from, withdraw, keep back, hold out the hand.",
        "sentence":"The word كَافَّةً comes from the root ك ف ف and is associated with the meanings: To withhold, desist, refrain from, withdraw, keep back, hold out the hand."
    },

    {
        "indexid":1357,
        "wordid":4693,
        "word":"الْمُؤْمِنُونَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنُونَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1357,
        "wordid":4928,
        "word":"طَائِفَةٌ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word طَائِفَةٌ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":1357,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1357,
        "wordid":6155,
        "word":"قَوْمَهُمْ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمَهُمْ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1357,
        "wordid":9658,
        "word":"لِيَنْفِرُوا",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word لِيَنْفِرُوا comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    },

    {
        "indexid":1357,
        "wordid":9659,
        "word":"نَفَرَ",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word نَفَرَ comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    },

    {
        "indexid":1357,
        "wordid":9660,
        "word":"فِرْقَةٍ",
        "rootid":1165,
        "rootword":"ف ر ق",
        "meanings":"o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear.",
        "sentence":"The word فِرْقَةٍ comes from the root ف ر ق and is associated with the meanings: o separate\/distinguish\/divide\/split\/decide. farqun - the act of distinction or separating. fariq - who separates, discriminates. firqun - separate part, heap. firqatun - band of human beings. fariqun - part\/portion, some party or band of human beings. furqan - criterion of right or wrong, draft, evidence or demonstration, a name of The Quran, aid, victory, argument, proof, dawn, distinction.. faraqa (vb. 2) to make a division or distinction, make a schism. tafriq - division, dissension.. faraqa (vb. 3) To quit, depart.. mutafarriqun - diverse, different. fariqa - to fear, be frightened, plunge in the wave, seek refuge in fear, succour. yafraqu - to be timid and afraid, appear in one's true colour, be cowardly, be ridden by fear."
    },

    {
        "indexid":1357,
        "wordid":9661,
        "word":"لِيَتَفَقَّهُوا",
        "rootid":240,
        "rootword":"ف ق ه",
        "meanings":"to be learned, skilled in divine law, endowed with penetration, understand a thing.",
        "sentence":"The word لِيَتَفَقَّهُوا comes from the root ف ق ه and is associated with the meanings: to be learned, skilled in divine law, endowed with penetration, understand a thing."
    },

    {
        "indexid":1357,
        "wordid":9662,
        "word":"وَلِيُنْذِرُوا",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word وَلِيُنْذِرُوا comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":1357,
        "wordid":9663,
        "word":"رَجَعُوا",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word رَجَعُوا comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":1357,
        "wordid":9664,
        "word":"يَحْذَرُونَ",
        "rootid":737,
        "rootword":"ح ذ ر",
        "meanings":"To beware, take heed of, to be cautious\/wary\/vigilant, to take care, to be on ones guard, to be in a state of preparation, to fear or be in fear of, to be angry and prepare oneself to do mischief, draw oneself together, to be enraged.",
        "sentence":"The word يَحْذَرُونَ comes from the root ح ذ ر and is associated with the meanings: To beware, take heed of, to be cautious\/wary\/vigilant, to take care, to be on ones guard, to be in a state of preparation, to fear or be in fear of, to be angry and prepare oneself to do mischief, draw oneself together, to be enraged."
    }]}