{"data":[
    {
        "indexid":1469,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1469,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1469,
        "wordid":2984,
        "word":"الْمُشْرِكِينَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word الْمُشْرِكِينَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":1469,
        "wordid":3222,
        "word":"حَنِيفًا",
        "rootid":19,
        "rootword":"ح ن ف",
        "meanings":"To lean to one side, incline, turn away from error to guidance, incline to the right religion, stand firmly on one side, leave a false religion and turn to right.",
        "sentence":"The word حَنِيفًا comes from the root ح ن ف and is associated with the meanings: To lean to one side, incline, turn away from error to guidance, incline to the right religion, stand firmly on one side, leave a false religion and turn to right."
    },

    {
        "indexid":1469,
        "wordid":3289,
        "word":"وَجْهَكَ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وَجْهَكَ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":1469,
        "wordid":3311,
        "word":"تَكُونَنَّ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونَنَّ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1469,
        "wordid":3449,
        "word":"وَأَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَأَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1469,
        "wordid":9993,
        "word":"أَقِمْ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word أَقِمْ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1469,
        "wordid":9994,
        "word":"لِلدِّينِ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word لِلدِّينِ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    }]}