{"data":[
    {
        "indexid":1513,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1513,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1513,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1513,
        "wordid":2112,
        "word":"ءَامَنَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1513,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1513,
        "wordid":2353,
        "word":"قُلْنَا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْنَا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1513,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1513,
        "wordid":3839,
        "word":"مَعَهُ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":1513,
        "wordid":5549,
        "word":"قَلِيلٌ",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلٌ comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":1513,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":1513,
        "wordid":7872,
        "word":"اثْنَيْنِ",
        "rootid":1651,
        "rootword":"ث ن ي",
        "meanings":"to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing.",
        "sentence":"The word اثْنَيْنِ comes from the root ث ن ي and is associated with the meanings: to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing."
    },

    {
        "indexid":1513,
        "wordid":9081,
        "word":"سَبَقَ",
        "rootid":882,
        "rootword":"س ب ق",
        "meanings":"to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race.",
        "sentence":"The word سَبَقَ comes from the root س ب ق and is associated with the meanings: to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race."
    },

    {
        "indexid":1513,
        "wordid":9776,
        "word":"أَمْرُنَا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرُنَا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1513,
        "wordid":10129,
        "word":"وَفَارَ",
        "rootid":593,
        "rootword":"ف و ر",
        "meanings":"to boil, boil over, gush forth, run, do in haste, rush, come in a headlong manner, be raised, be in a fit of passion, be in a hurry, come instantly, come immediately, fall of a sudden, make a sudden rush.",
        "sentence":"The word وَفَارَ comes from the root ف و ر and is associated with the meanings: to boil, boil over, gush forth, run, do in haste, rush, come in a headlong manner, be raised, be in a fit of passion, be in a hurry, come instantly, come immediately, fall of a sudden, make a sudden rush."
    },

    {
        "indexid":1513,
        "wordid":10130,
        "word":"التَّنُّورُ",
        "rootid":814,
        "rootword":"ت ن و ر",
        "meanings":"(tannur) Spring; ground; face of the earth. Highest part of the earth; place where the water of a valley collects; a circular earthen oven, furnace, fire-place. Shining of dawn.",
        "sentence":"The word التَّنُّورُ comes from the root ت ن و ر and is associated with the meanings: (tannur) Spring; ground; face of the earth. Highest part of the earth; place where the water of a valley collects; a circular earthen oven, furnace, fire-place. Shining of dawn."
    },

    {
        "indexid":1513,
        "wordid":10131,
        "word":"احْمِلْ",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word احْمِلْ comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":1513,
        "wordid":10132,
        "word":"كُلٍّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلٍّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1513,
        "wordid":10133,
        "word":"زَوْجَيْنِ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word زَوْجَيْنِ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":1513,
        "wordid":10134,
        "word":"وَأَهْلَكَ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word وَأَهْلَكَ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":1513,
        "wordid":10135,
        "word":"الْقَوْلُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word الْقَوْلُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    }]}