{"data":[
    {
        "indexid":1516,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1516,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1516,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1516,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1516,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1516,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1516,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1516,
        "wordid":4176,
        "word":"الْيَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word الْيَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1516,
        "wordid":4303,
        "word":"جَبَلٍ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word جَبَلٍ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":1516,
        "wordid":5861,
        "word":"بَيْنَهُمَا",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَهُمَا comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":1516,
        "wordid":8176,
        "word":"الْمَاءِ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word الْمَاءِ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":1516,
        "wordid":8295,
        "word":"أَمْرِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1516,
        "wordid":8718,
        "word":"فَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word فَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1516,
        "wordid":9756,
        "word":"الْمَوْجُ",
        "rootid":1599,
        "rootword":"م و ج",
        "meanings":"To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side.",
        "sentence":"The word الْمَوْجُ comes from the root م و ج and is associated with the meanings: To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side."
    },

    {
        "indexid":1516,
        "wordid":10146,
        "word":"سَءَاوِي",
        "rootid":1225,
        "rootword":"ا و ي",
        "meanings":"a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to.",
        "sentence":"The word سَءَاوِي comes from the root ا و ي and is associated with the meanings: a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to."
    },

    {
        "indexid":1516,
        "wordid":10147,
        "word":"يَعْصِمُنِي",
        "rootid":832,
        "rootword":"ع ص م",
        "meanings":"to protect\/defend\/preserve\/abstain\/save, keep any one safe from evil, prevent\/hinder, hold fast, formally seek refuge. ismatun - defence, guardianship, prevention, preservation, protection, immunity from sin, virtue, chastity.",
        "sentence":"The word يَعْصِمُنِي comes from the root ع ص م and is associated with the meanings: to protect\/defend\/preserve\/abstain\/save, keep any one safe from evil, prevent\/hinder, hold fast, formally seek refuge. ismatun - defence, guardianship, prevention, preservation, protection, immunity from sin, virtue, chastity."
    },

    {
        "indexid":1516,
        "wordid":10148,
        "word":"عَاصِمَ",
        "rootid":832,
        "rootword":"ع ص م",
        "meanings":"to protect\/defend\/preserve\/abstain\/save, keep any one safe from evil, prevent\/hinder, hold fast, formally seek refuge. ismatun - defence, guardianship, prevention, preservation, protection, immunity from sin, virtue, chastity.",
        "sentence":"The word عَاصِمَ comes from the root ع ص م and is associated with the meanings: to protect\/defend\/preserve\/abstain\/save, keep any one safe from evil, prevent\/hinder, hold fast, formally seek refuge. ismatun - defence, guardianship, prevention, preservation, protection, immunity from sin, virtue, chastity."
    },

    {
        "indexid":1516,
        "wordid":10149,
        "word":"رَحِمَ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِمَ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1516,
        "wordid":10150,
        "word":"وَحَالَ",
        "rootid":46,
        "rootword":"ح و ل",
        "meanings":"(Ha-Alif-Lam) To be changed, come in between, pass by.",
        "sentence":"The word وَحَالَ comes from the root ح و ل and is associated with the meanings: (Ha-Alif-Lam) To be changed, come in between, pass by."
    },

    {
        "indexid":1516,
        "wordid":10151,
        "word":"الْمُغْرَقِينَ",
        "rootid":344,
        "rootword":"غ ر ق",
        "meanings":"sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory",
        "sentence":"The word الْمُغْرَقِينَ comes from the root غ ر ق and is associated with the meanings: sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory"
    }]}