{"data":[
    {
        "indexid":1520,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1520,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1520,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1520,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1520,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1520,
        "wordid":2641,
        "word":"الْخَاسِرِينَ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word الْخَاسِرِينَ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    },

    {
        "indexid":1520,
        "wordid":2661,
        "word":"أَعُوذُ",
        "rootid":1751,
        "rootword":"ع و ذ",
        "meanings":"to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge.",
        "sentence":"The word أَعُوذُ comes from the root ع و ذ and is associated with the meanings: to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge."
    },

    {
        "indexid":1520,
        "wordid":3489,
        "word":"لَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word لَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":1520,
        "wordid":4917,
        "word":"عِلْمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1520,
        "wordid":6048,
        "word":"أَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word أَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1520,
        "wordid":7195,
        "word":"تَغْفِرْ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word تَغْفِرْ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":1520,
        "wordid":10168,
        "word":"أَسْءَلَكَ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word أَسْءَلَكَ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":1520,
        "wordid":10170,
        "word":"وَتَرْحَمْنِي",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word وَتَرْحَمْنِي comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    }]}