{"data":[
    {
        "indexid":1524,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1524,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1524,
        "wordid":2450,
        "word":"أَفَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَفَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1524,
        "wordid":2451,
        "word":"تَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word تَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":1524,
        "wordid":2513,
        "word":"يَاقَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word يَاقَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1524,
        "wordid":5891,
        "word":"أَجْرًا",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word أَجْرًا comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    },

    {
        "indexid":1524,
        "wordid":7580,
        "word":"أَسْءَلُكُمْ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word أَسْءَلُكُمْ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":1524,
        "wordid":9902,
        "word":"أَجْرِيَ",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word أَجْرِيَ comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    },

    {
        "indexid":1524,
        "wordid":10182,
        "word":"فَطَرَنِي",
        "rootid":67,
        "rootword":"ف ط ر",
        "meanings":"to create out of nothing, cleave\/split\/crack\/break, be broken into pieces, cleave asunder, begin to create. fitrat - natural disposition or constitution with which a child is created. The faculty of knowing God and capability of accepting the religion of truth, religion. fatir -creator, one of the names of Allah. futur - crack\/flaw. munfatirun - split one, cloven one, one rent asunder.",
        "sentence":"The word فَطَرَنِي comes from the root ف ط ر and is associated with the meanings: to create out of nothing, cleave\/split\/crack\/break, be broken into pieces, cleave asunder, begin to create. fitrat - natural disposition or constitution with which a child is created. The faculty of knowing God and capability of accepting the religion of truth, religion. fatir -creator, one of the names of Allah. futur - crack\/flaw. munfatirun - split one, cloven one, one rent asunder."
    }]}