{"data":[
    {
        "indexid":1539,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":1539,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1539,
        "wordid":2588,
        "word":"رَبَّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1539,
        "wordid":2624,
        "word":"صَالِحًا",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word صَالِحًا comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":1539,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1539,
        "wordid":3162,
        "word":"مِنَّا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَّا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1539,
        "wordid":3180,
        "word":"الْعَزِيزُ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word الْعَزِيزُ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":1539,
        "wordid":3839,
        "word":"مَعَهُ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":1539,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":1539,
        "wordid":8174,
        "word":"بِرَحْمَةٍ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word بِرَحْمَةٍ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":1539,
        "wordid":9776,
        "word":"أَمْرُنَا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرُنَا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1539,
        "wordid":10201,
        "word":"نَجَّيْنَا",
        "rootid":171,
        "rootword":"ن ج و",
        "meanings":"to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide.",
        "sentence":"The word نَجَّيْنَا comes from the root ن ج و and is associated with the meanings: to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide."
    },

    {
        "indexid":1539,
        "wordid":10232,
        "word":"خِزْيِ",
        "rootid":107,
        "rootword":"خ ز ي",
        "meanings":"To be or become abased\/vile\/despicable\/abject, fall into trial or affliction and evil, manifest foul actions or qualities, to be confounded or perplexed by reason of disgrace, moved or affected with shame.",
        "sentence":"The word خِزْيِ comes from the root خ ز ي and is associated with the meanings: To be or become abased\/vile\/despicable\/abject, fall into trial or affliction and evil, manifest foul actions or qualities, to be confounded or perplexed by reason of disgrace, moved or affected with shame."
    },

    {
        "indexid":1539,
        "wordid":10233,
        "word":"يَوْمِئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمِئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1539,
        "wordid":10234,
        "word":"الْقَوِيُّ",
        "rootid":377,
        "rootword":"ق و ي",
        "meanings":"to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted).",
        "sentence":"The word الْقَوِيُّ comes from the root ق و ي and is associated with the meanings: to be, become strong, prevail, be able to do, be powerful, be vigorous, be forceful. quwwatun (pl. quwan) - power, strength, vigour, resolution, firmness, determination. qawun - desert. aqwa - to stay in desert. muqwin - dwellers of desert\/wilderness (it is derived from the verb qawiya which means: it became desolate or deserted)."
    }]}