{"data":[
    {
        "indexid":1545,
        "wordid":3385,
        "word":"وَأَنَا",
        "rootid":1523,
        "rootword":"ا ن ا",
        "meanings":"",
        "sentence":"The word وَأَنَا comes from the root ا ن ا and is associated with the meanings: "
    },

    {
        "indexid":1545,
        "wordid":4730,
        "word":"قَالَتْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1545,
        "wordid":6750,
        "word":"يَاوَيْلَتَى",
        "rootid":232,
        "rootword":"و ي ل",
        "meanings":"word of interjection, dispraise or threat, woe!",
        "sentence":"The word يَاوَيْلَتَى comes from the root و ي ل and is associated with the meanings: word of interjection, dispraise or threat, woe!"
    },

    {
        "indexid":1545,
        "wordid":10254,
        "word":"ءَأَلِدُ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word ءَأَلِدُ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":1545,
        "wordid":10255,
        "word":"عَجُوزٌ",
        "rootid":453,
        "rootword":"ع ج ز",
        "meanings":"to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. ",
        "sentence":"The word عَجُوزٌ comes from the root ع ج ز and is associated with the meanings: to become behind, lack, become in the rear, lag behind (strength), become incapable, powerless, be weak. ujuzun - old women. a'jaza (vb. 4) to weaken, frustrate, find one to be weak. mu'ajiz - one who baffles. ajzun (pl. a'jazun) - portion of the trunk that is below its upper part.. . A'jaztu (prf. 1st. sing.): I am unable, became incapable.. Yu'jizuuna (imp. 3rd. m. plu. IV.): They shall be able to frustrate.. Li Yu'jiza (imp. 3rd. m. sing. el.): He can frustrate.. Nu'jiza (imp. 1st. plu.): We shall frustrate.. Mu'aajiziina (ap-der. m. plu. III.): Frustraters.. Mu'jizun (ap-der. m. sing. IV.): Frustrater.. Mu'jiziina \/ Mu'jizii (ap-der. m. plu. IV. final Nun is dropped.): Frustraters.. 'Ajuuzun (n.): Old woman who has passed child bearing age.. A'jaazun (n. plu.): Trunks. "
    },

    {
        "indexid":1545,
        "wordid":10256,
        "word":"بَعْلِي",
        "rootid":1661,
        "rootword":"ب ع ل",
        "meanings":"Husband, took a husband or became a wifePeople intermarrying with a peoplePlayful toying between man and wifeResistanceObedience to the husbandLord, master, owner or possessorHead, chief, ruler or person in authoritySomeone whom it is a necessary duty to obeyLacking strength, power or abilityElevated landPalm trees or trees watered only by rain, trees imbibing with roots without irrigation or rain, a male palm treeConfounded or perplexedBaal (pre-Islamic deity, 37:125)?",
        "sentence":"The word بَعْلِي comes from the root ب ع ل and is associated with the meanings: Husband, took a husband or became a wifePeople intermarrying with a peoplePlayful toying between man and wifeResistanceObedience to the husbandLord, master, owner or possessorHead, chief, ruler or person in authoritySomeone whom it is a necessary duty to obeyLacking strength, power or abilityElevated landPalm trees or trees watered only by rain, trees imbibing with roots without irrigation or rain, a male palm treeConfounded or perplexedBaal (pre-Islamic deity, 37:125)?"
    },

    {
        "indexid":1545,
        "wordid":10257,
        "word":"شَيْخًا",
        "rootid":412,
        "rootword":"ش ي خ",
        "meanings":"to be old, old\/aged man.",
        "sentence":"The word شَيْخًا comes from the root ش ي خ and is associated with the meanings: to be old, old\/aged man."
    },

    {
        "indexid":1545,
        "wordid":10258,
        "word":"لَشَيْءٌ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word لَشَيْءٌ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1545,
        "wordid":10259,
        "word":"عَجِيبٌ",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word عَجِيبٌ comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    }]}