{"data":[
    {
        "indexid":1560,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1560,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1560,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1560,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":1560,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1560,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1560,
        "wordid":7908,
        "word":"ءَابَاؤُنَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَاؤُنَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":1560,
        "wordid":8259,
        "word":"يَعْبُدُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word يَعْبُدُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":1560,
        "wordid":8335,
        "word":"يَاشُعَيْبُ",
        "rootid":1624,
        "rootword":"ش ع ب",
        "meanings":"to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites.",
        "sentence":"The word يَاشُعَيْبُ comes from the root ش ع ب and is associated with the meanings: to separate, collect, draw together, unite, appear, scatter, separate, put\/break apart, repair, impair, send (a message to), branch off, forked, derange, disorganize, adjust, put in a right or proper state, to turn away, to send back, withhold, restrain, cracked, corrupted, branched forth, become distant, remote, died, divided races or tribes, foreigners, branching of way\/road\/path, a water-course, ravine, gap between mountains, width or distance between horns of a goat, a portion\/part\/piece, eight month of Arabian year.. shu'ub (pl. of sha'bun) - large tribe, nation, collection.. shu'abin (pl. of shu'batun) - twigs or branches of a tree, space between two branches, portion.. shu'ayb - name of a prophet sent to the Midianites."
    },

    {
        "indexid":1560,
        "wordid":10312,
        "word":"أَصَلَوتُكَ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word أَصَلَوتُكَ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":1560,
        "wordid":10313,
        "word":"تَأْمُرُكَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word تَأْمُرُكَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1560,
        "wordid":10314,
        "word":"نَتْرُكَ",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word نَتْرُكَ comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":1560,
        "wordid":10315,
        "word":"نَفْعَلَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word نَفْعَلَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":1560,
        "wordid":10316,
        "word":"أَمْوَالِنَا",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word أَمْوَالِنَا comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":1560,
        "wordid":10317,
        "word":"لَأَنْتَ",
        "rootid":1639,
        "rootword":"ا ن ت",
        "meanings":"you (singular)",
        "sentence":"The word لَأَنْتَ comes from the root ا ن ت and is associated with the meanings: you (singular)"
    },

    {
        "indexid":1560,
        "wordid":10318,
        "word":"الْحَلِيمُ",
        "rootid":1558,
        "rootword":"ح ل م",
        "meanings":"To dream, have a vision, attain to puberty.",
        "sentence":"The word الْحَلِيمُ comes from the root ح ل م and is associated with the meanings: To dream, have a vision, attain to puberty."
    },

    {
        "indexid":1560,
        "wordid":10319,
        "word":"الرَّشِيدُ",
        "rootid":929,
        "rootword":"ر ش د",
        "meanings":"to follow the right way, be well guided or directed, true direction, correct rule of action, straight forwardness, maturity of a child\/intellect, capacity to manage one's affairs.",
        "sentence":"The word الرَّشِيدُ comes from the root ر ش د and is associated with the meanings: to follow the right way, be well guided or directed, true direction, correct rule of action, straight forwardness, maturity of a child\/intellect, capacity to manage one's affairs."
    }]}