{"data":[
    {
        "indexid":1584,
        "wordid":2308,
        "word":"رَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1584,
        "wordid":2910,
        "word":"يَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word يَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1584,
        "wordid":3438,
        "word":"أَعْمَالَهُمْ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالَهُمْ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":1584,
        "wordid":4053,
        "word":"خَبِيرٌ",
        "rootid":109,
        "rootword":"خ ب ر",
        "meanings":"To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account.",
        "sentence":"The word خَبِيرٌ comes from the root خ ب ر and is associated with the meanings: To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account."
    },

    {
        "indexid":1584,
        "wordid":6380,
        "word":"كُلًّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلًّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1584,
        "wordid":10387,
        "word":"لَيُوَفِّيَنَّهُمْ",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word لَيُوَفِّيَنَّهُمْ comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    }]}