{"data":[
    {
        "indexid":16,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":16,
        "wordid":2083,
        "word":"يُخَادِعُونَ",
        "rootid":888,
        "rootword":"خ د ع",
        "meanings":"To hide\/conceal, double or fold, decieve or outwit, pretend, to enter, vary in state\/condition, refrain or refuse, relinquish, to be in little demand of, deviate from the right course, resist\/unyield\/incompliant, turn away and behave proudly.",
        "sentence":"The word يُخَادِعُونَ comes from the root خ د ع and is associated with the meanings: To hide\/conceal, double or fold, decieve or outwit, pretend, to enter, vary in state\/condition, refrain or refuse, relinquish, to be in little demand of, deviate from the right course, resist\/unyield\/incompliant, turn away and behave proudly."
    },

    {
        "indexid":16,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":16,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":16,
        "wordid":2086,
        "word":"يَخْدَعُونَ",
        "rootid":888,
        "rootword":"خ د ع",
        "meanings":"To hide\/conceal, double or fold, decieve or outwit, pretend, to enter, vary in state\/condition, refrain or refuse, relinquish, to be in little demand of, deviate from the right course, resist\/unyield\/incompliant, turn away and behave proudly.",
        "sentence":"The word يَخْدَعُونَ comes from the root خ د ع and is associated with the meanings: To hide\/conceal, double or fold, decieve or outwit, pretend, to enter, vary in state\/condition, refrain or refuse, relinquish, to be in little demand of, deviate from the right course, resist\/unyield\/incompliant, turn away and behave proudly."
    },

    {
        "indexid":16,
        "wordid":2088,
        "word":"أَنْفُسَهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسَهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":16,
        "wordid":2089,
        "word":"يَشْعُرُونَ",
        "rootid":1335,
        "rootword":"ش ع ر",
        "meanings":"to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to.",
        "sentence":"The word يَشْعُرُونَ comes from the root ش ع ر and is associated with the meanings: to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to."
    }]}