{"data":[
    {
        "indexid":1614,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1614,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1614,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1614,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":1614,
        "wordid":3080,
        "word":"أَمْرًا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرًا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1614,
        "wordid":8422,
        "word":"وَجَاءُو",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word وَجَاءُو comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":1614,
        "wordid":10491,
        "word":"قَمِيصِهِ",
        "rootid":410,
        "rootword":"ق م ص",
        "meanings":"to canter or bound. qamis - long shirt.",
        "sentence":"The word قَمِيصِهِ comes from the root ق م ص and is associated with the meanings: to canter or bound. qamis - long shirt."
    },

    {
        "indexid":1614,
        "wordid":10492,
        "word":"بِدَمٍ",
        "rootid":707,
        "rootword":"د م ي",
        "meanings":"",
        "sentence":"The word بِدَمٍ comes from the root د م ي and is associated with the meanings: "
    },

    {
        "indexid":1614,
        "wordid":10493,
        "word":"كَذِبٍ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذِبٍ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":1614,
        "wordid":10494,
        "word":"سَوَّلَتْ",
        "rootid":808,
        "rootword":"س و ل",
        "meanings":"to delude, entice, contrive, suggest, prepare, embellish, deceive, lead one to error.",
        "sentence":"The word سَوَّلَتْ comes from the root س و ل and is associated with the meanings: to delude, entice, contrive, suggest, prepare, embellish, deceive, lead one to error."
    },

    {
        "indexid":1614,
        "wordid":10495,
        "word":"أَنْفُسُكُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسُكُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1614,
        "wordid":10496,
        "word":"فَصَبْرٌ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word فَصَبْرٌ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":1614,
        "wordid":10497,
        "word":"جَمِيلٌ",
        "rootid":310,
        "rootword":"ج م ل",
        "meanings":"To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope.",
        "sentence":"The word جَمِيلٌ comes from the root ج م ل and is associated with the meanings: To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope."
    },

    {
        "indexid":1614,
        "wordid":10498,
        "word":"الْمُسْتَعَانُ",
        "rootid":211,
        "rootword":"ع و ن",
        "meanings":"to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68).",
        "sentence":"The word الْمُسْتَعَانُ comes from the root ع و ن and is associated with the meanings: to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68)."
    },

    {
        "indexid":1614,
        "wordid":10499,
        "word":"تَصِفُونَ",
        "rootid":245,
        "rootword":"و ص ف",
        "meanings":"to describe (good or bad), assert something as a fact, achieve, ascribe, specify.",
        "sentence":"The word تَصِفُونَ comes from the root و ص ف and is associated with the meanings: to describe (good or bad), assert something as a fact, achieve, ascribe, specify."
    }]}