{"data":[
    {
        "indexid":1625,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1625,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1625,
        "wordid":6809,
        "word":"أَعْرِضْ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word أَعْرِضْ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":1625,
        "wordid":10556,
        "word":"وَاسْتَغْفِرِي",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word وَاسْتَغْفِرِي comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":1625,
        "wordid":10557,
        "word":"لِذَنْبِكِ",
        "rootid":1758,
        "rootword":"ذ ن ب",
        "meanings":"to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression.",
        "sentence":"The word لِذَنْبِكِ comes from the root ذ ن ب and is associated with the meanings: to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression."
    },

    {
        "indexid":1625,
        "wordid":10559,
        "word":"كُنْتِ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتِ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1625,
        "wordid":10560,
        "word":"الْخَاطِءِينَ",
        "rootid":177,
        "rootword":"خ ط ا",
        "meanings":"To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error.",
        "sentence":"The word الْخَاطِءِينَ comes from the root خ ط ا and is associated with the meanings: To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error."
    }]}