{"data":[
    {
        "indexid":163,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":163,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":163,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":163,
        "wordid":2462,
        "word":"رَاجِعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word رَاجِعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":163,
        "wordid":3358,
        "word":"أَصَابَتْهُمْ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word أَصَابَتْهُمْ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":163,
        "wordid":3359,
        "word":"مُصِيبَةٌ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word مُصِيبَةٌ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    }]}