{"data":[
    {
        "indexid":1632,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1632,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1632,
        "wordid":2556,
        "word":"الْمُحْسِنِينَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْمُحْسِنِينَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1632,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1632,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1632,
        "wordid":3839,
        "word":"مَعَهُ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":1632,
        "wordid":4865,
        "word":"فَوْقَ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":1632,
        "wordid":10079,
        "word":"نَرَاكَ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word نَرَاكَ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1632,
        "wordid":10595,
        "word":"وَدَخَلَ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word وَدَخَلَ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":1632,
        "wordid":10596,
        "word":"السِّجْنَ",
        "rootid":314,
        "rootword":"س ج ن",
        "meanings":"to imprison\/jail, restrain\/conceal, register\/record, register in which the actions of the wicked are recorded, prison, written book, sahib al-sijn (fellow prisoner), anything hard\/vehement\/severe\/continuous.",
        "sentence":"The word السِّجْنَ comes from the root س ج ن and is associated with the meanings: to imprison\/jail, restrain\/conceal, register\/record, register in which the actions of the wicked are recorded, prison, written book, sahib al-sijn (fellow prisoner), anything hard\/vehement\/severe\/continuous."
    },

    {
        "indexid":1632,
        "wordid":10597,
        "word":"فَتَيَانِ",
        "rootid":1039,
        "rootword":"ف ت ي",
        "meanings":"to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation.",
        "sentence":"The word فَتَيَانِ comes from the root ف ت ي and is associated with the meanings: to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation."
    },

    {
        "indexid":1632,
        "wordid":10598,
        "word":"أَحَدُهُمَا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدُهُمَا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":1632,
        "wordid":10599,
        "word":"أَرَانِي",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word أَرَانِي comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1632,
        "wordid":10600,
        "word":"أَعْصِرُ",
        "rootid":90,
        "rootword":"ع ص ر",
        "meanings":"to press\/squeeze\/wring, withdraw a thing from. i'sar - whirlwind, violent wind heavy rain, hurricane. mu'sirat - clouds emitting rain, rain clouds. asr - age, time, afternoon, history, succession of ages, evening, century, epoch, time that is measurable, consisting of a succession of periods, in distinction from dahr (Dal-ha-Ra) which signifies unlimited time without beginning or end. asran - night and the day, morning and evening.",
        "sentence":"The word أَعْصِرُ comes from the root ع ص ر and is associated with the meanings: to press\/squeeze\/wring, withdraw a thing from. i'sar - whirlwind, violent wind heavy rain, hurricane. mu'sirat - clouds emitting rain, rain clouds. asr - age, time, afternoon, history, succession of ages, evening, century, epoch, time that is measurable, consisting of a succession of periods, in distinction from dahr (Dal-ha-Ra) which signifies unlimited time without beginning or end. asran - night and the day, morning and evening."
    },

    {
        "indexid":1632,
        "wordid":10601,
        "word":"خَمْرًا",
        "rootid":1438,
        "rootword":"خ م ر",
        "meanings":"cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured.",
        "sentence":"The word خَمْرًا comes from the root خ م ر and is associated with the meanings: cover\/conceal\/veil, becoming changed\/altered from a former state\/condition, mixed\/mingled\/incorporated\/blended, intoxication\/wine\/grapes, make-up, any intoxicating thing that clouds\/obscures the intellect, come upon secretly\/unexpectedly, crowding of people, odour of perfume, women's head cover, man's turban, something fermented\/matured."
    },

    {
        "indexid":1632,
        "wordid":10602,
        "word":"الْءَاخَرُ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخَرُ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":1632,
        "wordid":10603,
        "word":"أَحْمِلُ",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word أَحْمِلُ comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":1632,
        "wordid":10604,
        "word":"رَأْسِي",
        "rootid":1298,
        "rootword":"ر ا س",
        "meanings":"head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people.",
        "sentence":"The word رَأْسِي comes from the root ر ا س and is associated with the meanings: head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people."
    },

    {
        "indexid":1632,
        "wordid":10605,
        "word":"خُبْزًا",
        "rootid":1437,
        "rootword":"خ ب ز",
        "meanings":"To feed with bread, to make or knead bread, he beat him or it.",
        "sentence":"The word خُبْزًا comes from the root خ ب ز and is associated with the meanings: To feed with bread, to make or knead bread, he beat him or it."
    },

    {
        "indexid":1632,
        "wordid":10606,
        "word":"تَأْكُلُ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word تَأْكُلُ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":1632,
        "wordid":10607,
        "word":"الطَّيْرُ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word الطَّيْرُ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":1632,
        "wordid":10608,
        "word":"نَبِّئْنَا",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word نَبِّئْنَا comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":1632,
        "wordid":10609,
        "word":"بِتَأْوِيلِهِ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word بِتَأْوِيلِهِ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    }]}