{"data":[
    {
        "indexid":1659,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1659,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1659,
        "wordid":3162,
        "word":"مِنَّا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَّا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1659,
        "wordid":8389,
        "word":"فَأَرْسِلْ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word فَأَرْسِلْ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1659,
        "wordid":9285,
        "word":"مَعَنَا",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَنَا comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":1659,
        "wordid":9663,
        "word":"رَجَعُوا",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word رَجَعُوا comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":1659,
        "wordid":10463,
        "word":"يَاأَبَانَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word يَاأَبَانَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":1659,
        "wordid":10470,
        "word":"لَحَافِظُونَ",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word لَحَافِظُونَ comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":1659,
        "wordid":10728,
        "word":"أَبِيهِمْ",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word أَبِيهِمْ comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":1659,
        "wordid":10729,
        "word":"مُنِعَ",
        "rootid":752,
        "rootword":"م ن ع",
        "meanings":"To prevent or hinder or hold back, to impede\/withhold\/arrest\/restrain, to keep\/debar\/preclude\/inhibit, to forbid\/prohibit\/interdict, deny or refuse, also to protect or defend or guard a thing, dispute or contest, resist or withstand, to strengthen or fortify, to make a thing inaccessible or unapproachable or difficult of access.",
        "sentence":"The word مُنِعَ comes from the root م ن ع and is associated with the meanings: To prevent or hinder or hold back, to impede\/withhold\/arrest\/restrain, to keep\/debar\/preclude\/inhibit, to forbid\/prohibit\/interdict, deny or refuse, also to protect or defend or guard a thing, dispute or contest, resist or withstand, to strengthen or fortify, to make a thing inaccessible or unapproachable or difficult of access."
    },

    {
        "indexid":1659,
        "wordid":10730,
        "word":"الْكَيْلُ",
        "rootid":1059,
        "rootword":"ك ي ل",
        "meanings":"(Kaf-Alif-Lam) To measure, weigh, compare.",
        "sentence":"The word الْكَيْلُ comes from the root ك ي ل and is associated with the meanings: (Kaf-Alif-Lam) To measure, weigh, compare."
    },

    {
        "indexid":1659,
        "wordid":10731,
        "word":"أَخَانَا",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word أَخَانَا comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":1659,
        "wordid":10732,
        "word":"نَكْتَلْ",
        "rootid":1059,
        "rootword":"ك ي ل",
        "meanings":"(Kaf-Alif-Lam) To measure, weigh, compare.",
        "sentence":"The word نَكْتَلْ comes from the root ك ي ل and is associated with the meanings: (Kaf-Alif-Lam) To measure, weigh, compare."
    }]}