{"data":[
    {
        "indexid":1673,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1673,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1673,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1673,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1673,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":1673,
        "wordid":2250,
        "word":"قَبْلُ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلُ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":1673,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1673,
        "wordid":2322,
        "word":"أَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word أَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1673,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":1673,
        "wordid":3010,
        "word":"فَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1673,
        "wordid":3851,
        "word":"شَرٌّ",
        "rootid":546,
        "rootword":"ش ر ر",
        "meanings":"to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire.",
        "sentence":"The word شَرٌّ comes from the root ش ر ر and is associated with the meanings: to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire."
    },

    {
        "indexid":1673,
        "wordid":4141,
        "word":"وَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word وَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":1673,
        "wordid":5025,
        "word":"نَفْسِهِ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word نَفْسِهِ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":1673,
        "wordid":5672,
        "word":"أَخٌ",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word أَخٌ comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":1673,
        "wordid":6918,
        "word":"مَكَانًا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانًا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1673,
        "wordid":10499,
        "word":"تَصِفُونَ",
        "rootid":245,
        "rootword":"و ص ف",
        "meanings":"to describe (good or bad), assert something as a fact, achieve, ascribe, specify.",
        "sentence":"The word تَصِفُونَ comes from the root و ص ف and is associated with the meanings: to describe (good or bad), assert something as a fact, achieve, ascribe, specify."
    },

    {
        "indexid":1673,
        "wordid":10799,
        "word":"يَسْرِقْ",
        "rootid":639,
        "rootword":"س ر ق",
        "meanings":"to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals.",
        "sentence":"The word يَسْرِقْ comes from the root س ر ق and is associated with the meanings: to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals."
    },

    {
        "indexid":1673,
        "wordid":10800,
        "word":"سَرَقَ",
        "rootid":639,
        "rootword":"س ر ق",
        "meanings":"to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals.",
        "sentence":"The word سَرَقَ comes from the root س ر ق and is associated with the meanings: to steal. sariqa - be concealed. istaraqa - to wish to steal. sariqun - one who is addicted to theft, one who steals."
    },

    {
        "indexid":1673,
        "wordid":10801,
        "word":"فَأَسَرَّهَا",
        "rootid":478,
        "rootword":"س ر ر",
        "meanings":"glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne.",
        "sentence":"The word فَأَسَرَّهَا comes from the root س ر ر and is associated with the meanings: glad\/delight\/happiness\/joy\/rejoice. sarra - to speak secretly, divulge a secret, manifest a secret. secret, heart, conscience, marriage, origin, choice part, mystery, in private, to conceal\/reveal\/manifest. sarir - couch\/throne."
    },

    {
        "indexid":1673,
        "wordid":10802,
        "word":"يُبْدِهَا",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word يُبْدِهَا comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    }]}