{"data":[
    {
        "indexid":1680,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1680,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1680,
        "wordid":3565,
        "word":"فَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word فَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1680,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1680,
        "wordid":10824,
        "word":"وَتَوَلَّى",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word وَتَوَلَّى comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":1680,
        "wordid":10825,
        "word":"يَاأَسَفَى",
        "rootid":720,
        "rootword":"ا س ف",
        "meanings":"to be sad, grieved about, afflicted with.",
        "sentence":"The word يَاأَسَفَى comes from the root ا س ف and is associated with the meanings: to be sad, grieved about, afflicted with."
    },

    {
        "indexid":1680,
        "wordid":10826,
        "word":"وَابْيَضَّتْ",
        "rootid":445,
        "rootword":"ب ي ض",
        "meanings":"White, becoming whiteSurpassing in whiteness, superiority in whiteness (e.g. whiteness of day\/daylight)An egg of any bird or like an egg (also used metaphorically)Whitening something, bleaching or whitewashingTerritory, place, quarter, tract, region, district, portions that belong to some peopleBulb of the saffron plantContainer or receptaclePrinciple place of abode, seat of power, heart of the kingdomWhite smooth land",
        "sentence":"The word وَابْيَضَّتْ comes from the root ب ي ض and is associated with the meanings: White, becoming whiteSurpassing in whiteness, superiority in whiteness (e.g. whiteness of day\/daylight)An egg of any bird or like an egg (also used metaphorically)Whitening something, bleaching or whitewashingTerritory, place, quarter, tract, region, district, portions that belong to some peopleBulb of the saffron plantContainer or receptaclePrinciple place of abode, seat of power, heart of the kingdomWhite smooth land"
    },

    {
        "indexid":1680,
        "wordid":10827,
        "word":"عَيْنَاهُ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عَيْنَاهُ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":1680,
        "wordid":10828,
        "word":"الْحُزْنِ",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word الْحُزْنِ comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":1680,
        "wordid":10829,
        "word":"كَظِيمٌ",
        "rootid":975,
        "rootword":"ك ظ م",
        "meanings":"To shut, stop, abstract, suppress one’s anger, choke, tight or fill something with a check, abstain from chewing the end.",
        "sentence":"The word كَظِيمٌ comes from the root ك ظ م and is associated with the meanings: To shut, stop, abstract, suppress one’s anger, choke, tight or fill something with a check, abstain from chewing the end."
    }]}