{"data":[
    {
        "indexid":1681,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1681,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":1681,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1681,
        "wordid":3669,
        "word":"تَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":1681,
        "wordid":10785,
        "word":"تَاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word تَاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1681,
        "wordid":10830,
        "word":"تَفْتَؤُا",
        "rootid":1632,
        "rootword":"ف ت ا",
        "meanings":"to cease from, forget, break, desist (it is always used in a negative sense).",
        "sentence":"The word تَفْتَؤُا comes from the root ف ت ا and is associated with the meanings: to cease from, forget, break, desist (it is always used in a negative sense)."
    },

    {
        "indexid":1681,
        "wordid":10831,
        "word":"تَذْكُرُ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word تَذْكُرُ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":1681,
        "wordid":10832,
        "word":"حَرَضًا",
        "rootid":786,
        "rootword":"ح ر ض",
        "meanings":"To become emaciated, be disordered, be profligate, become sick or diseased, be weary, become fatigued at the point of death, be dissolved by excessive grief or love, constantly affected by grief so as to be at the point of death, suffer protracted disquietude of mind and disease, be unable to rise from or quit the place, become low or sordid or bad, be neglected or forsaken.",
        "sentence":"The word حَرَضًا comes from the root ح ر ض and is associated with the meanings: To become emaciated, be disordered, be profligate, become sick or diseased, be weary, become fatigued at the point of death, be dissolved by excessive grief or love, constantly affected by grief so as to be at the point of death, suffer protracted disquietude of mind and disease, be unable to rise from or quit the place, become low or sordid or bad, be neglected or forsaken."
    },

    {
        "indexid":1681,
        "wordid":10833,
        "word":"الْهَالِكِينَ",
        "rootid":1683,
        "rootword":"ه ل ك",
        "meanings":"to die, perish, wasted, be lost, destroyed, spoiled.",
        "sentence":"The word الْهَالِكِينَ comes from the root ه ل ك and is associated with the meanings: to die, perish, wasted, be lost, destroyed, spoiled."
    }]}