{"data":[
    {
        "indexid":1683,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1683,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1683,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1683,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1683,
        "wordid":3197,
        "word":"يَابَنِيَّ",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word يَابَنِيَّ comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":1683,
        "wordid":6441,
        "word":"الْكَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":1683,
        "wordid":7389,
        "word":"الْقَوْمُ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقَوْمُ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1683,
        "wordid":9934,
        "word":"وَأَخِيهِ",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word وَأَخِيهِ comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":1683,
        "wordid":10837,
        "word":"اذْهَبُوا",
        "rootid":1657,
        "rootword":"ذ ه ب",
        "meanings":"to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold.",
        "sentence":"The word اذْهَبُوا comes from the root ذ ه ب and is associated with the meanings: to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold."
    },

    {
        "indexid":1683,
        "wordid":10838,
        "word":"فَتَحَسَّسُوا",
        "rootid":295,
        "rootword":"ح س س",
        "meanings":"To slaughter, extirpate, destroy, kill, make one’s perceiving powers dead, rout, make one's sound or motion to cease, trod and despise someone or a people, devour, blast or burn, carry or remove or shake off, to be tender or compassionate towards someone (lit., to feel for someone), lament for someone, perceive or become sensible of something, know a thing by means of any of the senses, ascertain a thing, know a thing certainly, to be certain or sure of something, to listen, to seek repeatedly\/time after time to know a thing, ask or inquire after news or tidings of something, inquire or seek for information about something or someone, to be pulled out or up or off, to be eradicated or displaced, fall out or come out, fall continuously\/by degrees\/one part after another, break into pieces.",
        "sentence":"The word فَتَحَسَّسُوا comes from the root ح س س and is associated with the meanings: To slaughter, extirpate, destroy, kill, make one’s perceiving powers dead, rout, make one's sound or motion to cease, trod and despise someone or a people, devour, blast or burn, carry or remove or shake off, to be tender or compassionate towards someone (lit., to feel for someone), lament for someone, perceive or become sensible of something, know a thing by means of any of the senses, ascertain a thing, know a thing certainly, to be certain or sure of something, to listen, to seek repeatedly\/time after time to know a thing, ask or inquire after news or tidings of something, inquire or seek for information about something or someone, to be pulled out or up or off, to be eradicated or displaced, fall out or come out, fall continuously\/by degrees\/one part after another, break into pieces."
    },

    {
        "indexid":1683,
        "wordid":10839,
        "word":"تَايْءَسُوا",
        "rootid":879,
        "rootword":"ي ا س",
        "meanings":"to despair, desperate, to give up hope, to know.",
        "sentence":"The word تَايْءَسُوا comes from the root ي ا س and is associated with the meanings: to despair, desperate, to give up hope, to know."
    },

    {
        "indexid":1683,
        "wordid":10840,
        "word":"رَوْحِ",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word رَوْحِ comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    },

    {
        "indexid":1683,
        "wordid":10841,
        "word":"يَايْءَسُ",
        "rootid":879,
        "rootword":"ي ا س",
        "meanings":"to despair, desperate, to give up hope, to know.",
        "sentence":"The word يَايْءَسُ comes from the root ي ا س and is associated with the meanings: to despair, desperate, to give up hope, to know."
    }]}