{"data":[
    {
        "indexid":1719,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1719,
        "wordid":8204,
        "word":"خَوْفًا",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خَوْفًا comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":1719,
        "wordid":8205,
        "word":"وَطَمَعًا",
        "rootid":768,
        "rootword":"ط م ع",
        "meanings":"to covet, eagerly desire, long or hope for, yearn for. tama'un - desire, hoping and longing for, causing to be full of hope.",
        "sentence":"The word وَطَمَعًا comes from the root ط م ع and is associated with the meanings: to covet, eagerly desire, long or hope for, yearn for. tama'un - desire, hoping and longing for, causing to be full of hope."
    },

    {
        "indexid":1719,
        "wordid":10973,
        "word":"يُرِيكُمُ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word يُرِيكُمُ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":1719,
        "wordid":10974,
        "word":"الْبَرْقَ",
        "rootid":918,
        "rootword":"ب ر ق",
        "meanings":"Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness",
        "sentence":"The word الْبَرْقَ comes from the root ب ر ق and is associated with the meanings: Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness"
    },

    {
        "indexid":1719,
        "wordid":10975,
        "word":"وَيُنْشِئُ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word وَيُنْشِئُ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    },

    {
        "indexid":1719,
        "wordid":10976,
        "word":"السَّحَابَ",
        "rootid":684,
        "rootword":"س ح ب",
        "meanings":"to drag, trail, drag along the ground. sahab - cloud.",
        "sentence":"The word السَّحَابَ comes from the root س ح ب and is associated with the meanings: to drag, trail, drag along the ground. sahab - cloud."
    },

    {
        "indexid":1719,
        "wordid":10977,
        "word":"الثِّقَالَ",
        "rootid":731,
        "rootword":"ث ق ل",
        "meanings":"to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards.",
        "sentence":"The word الثِّقَالَ comes from the root ث ق ل and is associated with the meanings: to be heavy\/weighty, slow\/dull\/sluggish, difficult\/hard\/grievous. thaqalaan (dual of thaqalan) - two big and weighty things, two armies. athqaal (pl. of thiql) - burden. thaqiil (pl. thiqaal) - heavy. mithqaal - weight, weight of a balance. tathaaqal - to be dull\/sluggish. thaqala - to grow heavy, oppress, weigh down. mathqalatun - burdened, heavily laden, any cause of depriving a mother of her child. iththaqala (for tathaaqala) - to be born down heavily, incline heavily downwards."
    }]}