{"data":[
    {
        "indexid":1765,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1765,
        "wordid":10208,
        "word":"جَبَّارٍ",
        "rootid":842,
        "rootword":"ج ب ر",
        "meanings":"To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence.",
        "sentence":"The word جَبَّارٍ comes from the root ج ب ر and is associated with the meanings: To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence."
    },

    {
        "indexid":1765,
        "wordid":10209,
        "word":"عَنِيدٍ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عَنِيدٍ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":1765,
        "wordid":11146,
        "word":"وَاسْتَفْتَحُوا",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word وَاسْتَفْتَحُوا comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":1765,
        "wordid":11147,
        "word":"وَخَابَ",
        "rootid":805,
        "rootword":"خ ي ب",
        "meanings":"Fail of attaining a desire or what is sought, to be denied\/prohibted\/debarred from what one desires or seeks, disappointed or frustrated, suffer loss, habitually unsuccessful.",
        "sentence":"The word وَخَابَ comes from the root خ ي ب and is associated with the meanings: Fail of attaining a desire or what is sought, to be denied\/prohibted\/debarred from what one desires or seeks, disappointed or frustrated, suffer loss, habitually unsuccessful."
    }]}