{"data":[
    {
        "indexid":1776,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1776,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":1776,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1776,
        "wordid":3457,
        "word":"وَمَثَلُ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word وَمَثَلُ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":1776,
        "wordid":4899,
        "word":"كَلِمَةٍ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word كَلِمَةٍ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":1776,
        "wordid":11185,
        "word":"كَشَجَرَةٍ",
        "rootid":1271,
        "rootword":"ش ج ر",
        "meanings":"to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person.",
        "sentence":"The word كَشَجَرَةٍ comes from the root ش ج ر and is associated with the meanings: to avert, be a matter of controversy, dispute about, turn aside, thrust (with a spear), be disputed between. shajar alamru bainahun - the affair or case became complicated and confused so as to be a subject of disagreement and difference between them. shajarun\/shajaratun - tree, plant having a trunk or stem, stock or origin of a person."
    },

    {
        "indexid":1776,
        "wordid":11191,
        "word":"خَبِيثَةٍ",
        "rootid":1060,
        "rootword":"خ ب ث",
        "meanings":"bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil.",
        "sentence":"The word خَبِيثَةٍ comes from the root خ ب ث and is associated with the meanings: bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil."
    },

    {
        "indexid":1776,
        "wordid":11192,
        "word":"اجْتُثَّتْ",
        "rootid":642,
        "rootword":"ج ث ث",
        "meanings":"To pull up or pull out, cut or cut off, to uproot, to eradicate.",
        "sentence":"The word اجْتُثَّتْ comes from the root ج ث ث and is associated with the meanings: To pull up or pull out, cut or cut off, to uproot, to eradicate."
    },

    {
        "indexid":1776,
        "wordid":11193,
        "word":"فَوْقِ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقِ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":1776,
        "wordid":11194,
        "word":"قَرَارٍ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word قَرَارٍ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    }]}