{"data":[
    {
        "indexid":1780,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1780,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1780,
        "wordid":2210,
        "word":"أَنْدَادًا",
        "rootid":1111,
        "rootword":"ن د د",
        "meanings":"to flee, run away, defame, divulge (secret). nid - match, a like, opponent, equal, image, idol, compeer, rival, object of adoration to which some or all of Gods qualities are ascribed whether it be conceived as deity in its own right or a saint.",
        "sentence":"The word أَنْدَادًا comes from the root ن د د and is associated with the meanings: to flee, run away, defame, divulge (secret). nid - match, a like, opponent, equal, image, idol, compeer, rival, object of adoration to which some or all of Gods qualities are ascribed whether it be conceived as deity in its own right or a saint."
    },

    {
        "indexid":1780,
        "wordid":2408,
        "word":"النَّارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1780,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1780,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1780,
        "wordid":6780,
        "word":"سَبِيلِهِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِهِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":1780,
        "wordid":7662,
        "word":"وَجَعَلُوا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلُوا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1780,
        "wordid":9944,
        "word":"لِيُضِلُّوا",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word لِيُضِلُّوا comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":1780,
        "wordid":10228,
        "word":"تَمَتَّعُوا",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word تَمَتَّعُوا comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":1780,
        "wordid":11205,
        "word":"مَصِيرَكُمْ",
        "rootid":77,
        "rootword":"ص ي ر",
        "meanings":"to go, become, tend towards. masiir - the act of going, journey, departure. To retreat, result, issue.",
        "sentence":"The word مَصِيرَكُمْ comes from the root ص ي ر and is associated with the meanings: to go, become, tend towards. masiir - the act of going, journey, departure. To retreat, result, issue."
    }]}