{"data":[
    {
        "indexid":1790,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1790,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1790,
        "wordid":3127,
        "word":"ذُرِّيَّتِي",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّتِي comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":1790,
        "wordid":3160,
        "word":"رَبَّنَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّنَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":1790,
        "wordid":6244,
        "word":"الصَّلَوةِ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةِ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":1790,
        "wordid":10700,
        "word":"اجْعَلْنِي",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word اجْعَلْنِي comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":1790,
        "wordid":11240,
        "word":"مُقِيمَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مُقِيمَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1790,
        "wordid":11241,
        "word":"وَتَقَبَّلْ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word وَتَقَبَّلْ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":1790,
        "wordid":11242,
        "word":"دُعَاءِ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دُعَاءِ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    }]}