{"data":[
    {
        "indexid":1793,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1793,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":1793,
        "wordid":11249,
        "word":"مُهْطِعِينَ",
        "rootid":544,
        "rootword":"ه ط ع",
        "meanings":"to hasten forward, go along fearfully in looking fixedly at a point. ahta'a - to walk fast while stretching the neck (camel).",
        "sentence":"The word مُهْطِعِينَ comes from the root ه ط ع and is associated with the meanings: to hasten forward, go along fearfully in looking fixedly at a point. ahta'a - to walk fast while stretching the neck (camel)."
    },

    {
        "indexid":1793,
        "wordid":11250,
        "word":"مُقْنِعِي",
        "rootid":91,
        "rootword":"ق ن ع",
        "meanings":"to be content, satisfied with what is within one's approach, not looking for more, beg with some reservation, beseech earnestly. qani'un (pl. qunna'un) - one who is deserving charity but does not beg, content. muqni'un (vb. 4) - one who lifts up the head. aqna'a - to raise (the head), outstretched neck.",
        "sentence":"The word مُقْنِعِي comes from the root ق ن ع and is associated with the meanings: to be content, satisfied with what is within one's approach, not looking for more, beg with some reservation, beseech earnestly. qani'un (pl. qunna'un) - one who is deserving charity but does not beg, content. muqni'un (vb. 4) - one who lifts up the head. aqna'a - to raise (the head), outstretched neck."
    },

    {
        "indexid":1793,
        "wordid":11251,
        "word":"رُءُوسِهِمْ",
        "rootid":1298,
        "rootword":"ر ا س",
        "meanings":"head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people.",
        "sentence":"The word رُءُوسِهِمْ comes from the root ر ا س and is associated with the meanings: head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people."
    },

    {
        "indexid":1793,
        "wordid":11252,
        "word":"يَرْتَدُّ",
        "rootid":1636,
        "rootword":"ر د د",
        "meanings":"to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro.",
        "sentence":"The word يَرْتَدُّ comes from the root ر د د and is associated with the meanings: to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro."
    },

    {
        "indexid":1793,
        "wordid":11253,
        "word":"طَرْفُهُمْ",
        "rootid":1291,
        "rootword":"ط ر ف",
        "meanings":"",
        "sentence":"The word طَرْفُهُمْ comes from the root ط ر ف and is associated with the meanings: "
    },

    {
        "indexid":1793,
        "wordid":11254,
        "word":"وَأَفْئِدَتُهُمْ",
        "rootid":960,
        "rootword":"ف ا د",
        "meanings":"to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind.",
        "sentence":"The word وَأَفْئِدَتُهُمْ comes from the root ف ا د and is associated with the meanings: to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind."
    },

    {
        "indexid":1793,
        "wordid":11255,
        "word":"هَوَاءٌ",
        "rootid":1497,
        "rootword":"ه و ي",
        "meanings":"to fall steep as a bird to its prey, rev, perish, pull down, destroy, disappear, yearn, fancy, beguile, infatuate, be blown, inspire with low passion.",
        "sentence":"The word هَوَاءٌ comes from the root ه و ي and is associated with the meanings: to fall steep as a bird to its prey, rev, perish, pull down, destroy, disappear, yearn, fancy, beguile, infatuate, be blown, inspire with low passion."
    }]}