{"data":[
    {
        "indexid":1800,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1800,
        "wordid":2761,
        "word":"النَّارُ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارُ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":1800,
        "wordid":11279,
        "word":"سَرَابِيلُهُمْ",
        "rootid":1490,
        "rootword":"س ر ب ل",
        "meanings":"to clothe, put on the garment, be confused. sirbil - shirt, clothing\/garment, breast plate, coat of mail.",
        "sentence":"The word سَرَابِيلُهُمْ comes from the root س ر ب ل and is associated with the meanings: to clothe, put on the garment, be confused. sirbil - shirt, clothing\/garment, breast plate, coat of mail."
    },

    {
        "indexid":1800,
        "wordid":11280,
        "word":"قَطِرَانٍ",
        "rootid":1689,
        "rootword":"ق ط ر",
        "meanings":"to drop, drip (liquid). taqattara - to fall on the side. taqatara - to walk side by side. aqtar (pl. of qutrun) - sides, regions. qitran - molten copper, liquid pitch.",
        "sentence":"The word قَطِرَانٍ comes from the root ق ط ر and is associated with the meanings: to drop, drip (liquid). taqattara - to fall on the side. taqatara - to walk side by side. aqtar (pl. of qutrun) - sides, regions. qitran - molten copper, liquid pitch."
    },

    {
        "indexid":1800,
        "wordid":11282,
        "word":"وُجُوهَهُمُ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وُجُوهَهُمُ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    }]}