{"data":[
    {
        "indexid":1805,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1805,
        "wordid":5815,
        "word":"فَسَوْفَ",
        "rootid":182,
        "rootword":"س و ف",
        "meanings":"",
        "sentence":"The word فَسَوْفَ comes from the root س و ف and is associated with the meanings: "
    },

    {
        "indexid":1805,
        "wordid":7589,
        "word":"ذَرْهُمْ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word ذَرْهُمْ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":1805,
        "wordid":11289,
        "word":"يَأْكُلُوا",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word يَأْكُلُوا comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":1805,
        "wordid":11290,
        "word":"وَيَتَمَتَّعُوا",
        "rootid":258,
        "rootword":"م ت ع",
        "meanings":"to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity.",
        "sentence":"The word وَيَتَمَتَّعُوا comes from the root م ت ع and is associated with the meanings: to enjoy\/benefit, gift, anything useful\/advantageous, goods (e.g. utensils, furniture), a commodity."
    },

    {
        "indexid":1805,
        "wordid":11291,
        "word":"وَيُلْهِهِمُ",
        "rootid":473,
        "rootword":"ل ه و",
        "meanings":"become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless.",
        "sentence":"The word وَيُلْهِهِمُ comes from the root ل ه و and is associated with the meanings: become diverted from it as to forget it, To preoccupy, beguile, distract, sport\/play\/amusement, divert, diversion, forget, delight\/cheer, turn away, what is thrown, unmindful\/careless."
    },

    {
        "indexid":1805,
        "wordid":11292,
        "word":"الْأَمَلُ",
        "rootid":770,
        "rootword":"ا م ل",
        "meanings":"hoped for it, expect, distant or remote expectation, clinging of the heart to the coming to pass of a future desired event, affection of the heart for some good to be attained, in respect of hope",
        "sentence":"The word الْأَمَلُ comes from the root ا م ل and is associated with the meanings: hoped for it, expect, distant or remote expectation, clinging of the heart to the coming to pass of a future desired event, affection of the heart for some good to be attained, in respect of hope"
    }]}