{"data":[
    {
        "indexid":1806,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1806,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1806,
        "wordid":2855,
        "word":"كِتَابٌ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابٌ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":1806,
        "wordid":4269,
        "word":"قَرْيَةٍ",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word قَرْيَةٍ comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":1806,
        "wordid":7219,
        "word":"أَهْلَكْنَا",
        "rootid":1683,
        "rootword":"ه ل ك",
        "meanings":"to die, perish, wasted, be lost, destroyed, spoiled.",
        "sentence":"The word أَهْلَكْنَا comes from the root ه ل ك and is associated with the meanings: to die, perish, wasted, be lost, destroyed, spoiled."
    },

    {
        "indexid":1806,
        "wordid":11294,
        "word":"مَعْلُومٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word مَعْلُومٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}