{"data":[
    {
        "indexid":1831,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1831,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1831,
        "wordid":8434,
        "word":"سَاجِدِينَ",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word سَاجِدِينَ comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":1831,
        "wordid":11344,
        "word":"سَوَّيْتُهُ",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word سَوَّيْتُهُ comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":1831,
        "wordid":11345,
        "word":"وَنَفَخْتُ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word وَنَفَخْتُ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":1831,
        "wordid":11346,
        "word":"رُوحِي",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word رُوحِي comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    },

    {
        "indexid":1831,
        "wordid":11347,
        "word":"فَقَعُوا",
        "rootid":464,
        "rootword":"و ق ع",
        "meanings":"to fall down, befall, come to pass, be conformed, happen, take place, ascertain.",
        "sentence":"The word فَقَعُوا comes from the root و ق ع and is associated with the meanings: to fall down, befall, come to pass, be conformed, happen, take place, ascertain."
    }]}