{"data":[
    {
        "indexid":1853,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1853,
        "wordid":11373,
        "word":"وَنَبِّئْهُمْ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word وَنَبِّئْهُمْ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":1853,
        "wordid":11374,
        "word":"ضَيْفِ",
        "rootid":394,
        "rootword":"ض ي ف",
        "meanings":"Inclined, approached, drew near to setting (said of the sun). Menstruation (said of a woman). Become a guest, refuge of someone. Become correlative to something. Correlation, or reciprocal correlation, so that one cannot be conceived in the mind without the other. Beign collected, joined, added together.Ran, hastened, fled, sped, turned away.Beset by distress of mind. Hardship, difficulty, or distress.Asking, or calling, for an aid.",
        "sentence":"The word ضَيْفِ comes from the root ض ي ف and is associated with the meanings: Inclined, approached, drew near to setting (said of the sun). Menstruation (said of a woman). Become a guest, refuge of someone. Become correlative to something. Correlation, or reciprocal correlation, so that one cannot be conceived in the mind without the other. Beign collected, joined, added together.Ran, hastened, fled, sped, turned away.Beset by distress of mind. Hardship, difficulty, or distress.Asking, or calling, for an aid."
    }]}