{"data":[
    {
        "indexid":187,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":187,
        "wordid":3203,
        "word":"حَضَرَ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word حَضَرَ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    },

    {
        "indexid":187,
        "wordid":3205,
        "word":"الْمَوْتُ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتُ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":187,
        "wordid":3373,
        "word":"خَيْرًا",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرًا comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":187,
        "wordid":3514,
        "word":"كُتِبَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كُتِبَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":187,
        "wordid":3527,
        "word":"بِالْمَعْرُوفِ",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word بِالْمَعْرُوفِ comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    },

    {
        "indexid":187,
        "wordid":3536,
        "word":"أَحَدَكُمُ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدَكُمُ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":187,
        "wordid":3537,
        "word":"تَرَكَ",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word تَرَكَ comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":187,
        "wordid":3538,
        "word":"الْوَصِيَّةُ",
        "rootid":1754,
        "rootword":"و ص ي",
        "meanings":"to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will.",
        "sentence":"The word الْوَصِيَّةُ comes from the root و ص ي and is associated with the meanings: to join to, be joined, be contiguous, to have dense vegetation. wassa - to bequeath, recommend, order, command with wise counsel and sermon, charge, exhort, enjoin, make a will."
    },

    {
        "indexid":187,
        "wordid":3539,
        "word":"لِلْوَالِدَيْنِ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word لِلْوَالِدَيْنِ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":187,
        "wordid":3540,
        "word":"وَالْأَقْرَبِينَ",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word وَالْأَقْرَبِينَ comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":187,
        "wordid":3541,
        "word":"حَقًّا",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word حَقًّا comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":187,
        "wordid":3542,
        "word":"الْمُتَّقِينَ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word الْمُتَّقِينَ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    }]}