{"data":[
    {
        "indexid":1875,
        "wordid":6449,
        "word":"فَأَخَذَتْهُمُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word فَأَخَذَتْهُمُ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1875,
        "wordid":10235,
        "word":"الصَّيْحَةُ",
        "rootid":408,
        "rootword":"ص ي ح",
        "meanings":"to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise.",
        "sentence":"The word الصَّيْحَةُ comes from the root ص ي ح and is associated with the meanings: to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise."
    },

    {
        "indexid":1875,
        "wordid":11402,
        "word":"مُشْرِقِينَ",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word مُشْرِقِينَ comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    }]}