{"data":[
    {
        "indexid":1896,
        "wordid":2984,
        "word":"الْمُشْرِكِينَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word الْمُشْرِكِينَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":1896,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":1896,
        "wordid":7689,
        "word":"وَأَعْرِضْ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word وَأَعْرِضْ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":1896,
        "wordid":11436,
        "word":"فَاصْدَعْ",
        "rootid":1763,
        "rootword":"ص د ع",
        "meanings":"to split, expound, cleave, profess openly, divide, cross, proclaim, promulgate aloud, declare openly, be affected with headache, manifest, make clear. sad'un - fissure. suddi'a - to oppress with or suffer from headache. issada'a (vb. 5) - to be split up or divided. mutasaddiun - that which is cloven or splits in two.. . Yusadda'uun (pip. 3rd. p.m. plu. II.): They will be affected with headache.. Yasadda'uun (imp 3rd. p.m. plu. V): They will be separated.. Isda (prt. m. sing): declare openly.. sad'un (v.n.): splitting, bursting forth.",
        "sentence":"The word فَاصْدَعْ comes from the root ص د ع and is associated with the meanings: to split, expound, cleave, profess openly, divide, cross, proclaim, promulgate aloud, declare openly, be affected with headache, manifest, make clear. sad'un - fissure. suddi'a - to oppress with or suffer from headache. issada'a (vb. 5) - to be split up or divided. mutasaddiun - that which is cloven or splits in two.. . Yusadda'uun (pip. 3rd. p.m. plu. II.): They will be affected with headache.. Yasadda'uun (imp 3rd. p.m. plu. V): They will be separated.. Isda (prt. m. sing): declare openly.. sad'un (v.n.): splitting, bursting forth."
    },

    {
        "indexid":1896,
        "wordid":11437,
        "word":"تُؤْمَرُ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word تُؤْمَرُ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    }]}