{"data":[
    {
        "indexid":1899,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":1899,
        "wordid":2752,
        "word":"يَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1899,
        "wordid":5390,
        "word":"نَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word نَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1899,
        "wordid":10047,
        "word":"صَدْرُكَ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word صَدْرُكَ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    },

    {
        "indexid":1899,
        "wordid":11442,
        "word":"يَضِيقُ",
        "rootid":686,
        "rootword":"ض ي ق",
        "meanings":"Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition.",
        "sentence":"The word يَضِيقُ comes from the root ض ي ق and is associated with the meanings: Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition."
    }]}