{"data":[
    {
        "indexid":1917,
        "wordid":3456,
        "word":"يَهْتَدُونَ",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word يَهْتَدُونَ comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    },

    {
        "indexid":1917,
        "wordid":11495,
        "word":"وَعَلَامَاتٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَعَلَامَاتٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1917,
        "wordid":11496,
        "word":"وَبِالنَّجْمِ",
        "rootid":255,
        "rootword":"ن ج م",
        "meanings":"to appear\/rise\/begin, accomplish, ensue, proceed.",
        "sentence":"The word وَبِالنَّجْمِ comes from the root ن ج م and is associated with the meanings: to appear\/rise\/begin, accomplish, ensue, proceed."
    }]}