{"data":[
    {
        "indexid":1926,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1926,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1926,
        "wordid":2614,
        "word":"بِغَيْرِ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word بِغَيْرِ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":1926,
        "wordid":2820,
        "word":"الْقِيَامَةِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقِيَامَةِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1926,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":1926,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1926,
        "wordid":6471,
        "word":"عِلْمٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":1926,
        "wordid":6956,
        "word":"سَاءَ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَاءَ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":1926,
        "wordid":7319,
        "word":"أَوْزَارَهُمْ",
        "rootid":1184,
        "rootword":"و ز ر",
        "meanings":"to carry a burden, bear a load, perpetrate (a crime)",
        "sentence":"The word أَوْزَارَهُمْ comes from the root و ز ر and is associated with the meanings: to carry a burden, bear a load, perpetrate (a crime)"
    },

    {
        "indexid":1926,
        "wordid":7320,
        "word":"يَزِرُونَ",
        "rootid":1184,
        "rootword":"و ز ر",
        "meanings":"to carry a burden, bear a load, perpetrate (a crime)",
        "sentence":"The word يَزِرُونَ comes from the root و ز ر and is associated with the meanings: to carry a burden, bear a load, perpetrate (a crime)"
    },

    {
        "indexid":1926,
        "wordid":11505,
        "word":"لِيَحْمِلُوا",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word لِيَحْمِلُوا comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":1926,
        "wordid":11506,
        "word":"كَامِلَةً",
        "rootid":873,
        "rootword":"ك م ل",
        "meanings":"complete, in total, in all, perfect achieved.",
        "sentence":"The word كَامِلَةً comes from the root ك م ل and is associated with the meanings: complete, in total, in all, perfect achieved."
    },

    {
        "indexid":1926,
        "wordid":11507,
        "word":"أَوْزَارِ",
        "rootid":1184,
        "rootword":"و ز ر",
        "meanings":"to carry a burden, bear a load, perpetrate (a crime)",
        "sentence":"The word أَوْزَارِ comes from the root و ز ر and is associated with the meanings: to carry a burden, bear a load, perpetrate (a crime)"
    },

    {
        "indexid":1926,
        "wordid":11508,
        "word":"يُضِلُّونَهُمْ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word يُضِلُّونَهُمْ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    }]}