{"data":[
    {
        "indexid":1936,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1936,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1936,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1936,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":1936,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1936,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1936,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1936,
        "wordid":2900,
        "word":"أَشْرَكُوا",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أَشْرَكُوا comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":1936,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":1936,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":1936,
        "wordid":3089,
        "word":"قَبْلِهِمْ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِهِمْ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":1936,
        "wordid":4654,
        "word":"الْبَلَاغُ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word الْبَلَاغُ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    },

    {
        "indexid":1936,
        "wordid":6318,
        "word":"دُونِهِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِهِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":1936,
        "wordid":6480,
        "word":"حَرَّمْنَا",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حَرَّمْنَا comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":1936,
        "wordid":6506,
        "word":"الرُّسُلِ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word الرُّسُلِ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":1936,
        "wordid":7042,
        "word":"فَهَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word فَهَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":1936,
        "wordid":7046,
        "word":"الْمُبِينُ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word الْمُبِينُ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":1936,
        "wordid":7908,
        "word":"ءَابَاؤُنَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَاؤُنَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":1936,
        "wordid":8614,
        "word":"فَعَلَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَعَلَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":1936,
        "wordid":11531,
        "word":"عَبَدْنَا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَبَدْنَا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    }]}