{"data":[
    {
        "indexid":1959,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1959,
        "wordid":2902,
        "word":"أَحَدُهُمْ",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدُهُمْ comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":1959,
        "wordid":3522,
        "word":"بِالْأُنْثَى",
        "rootid":1029,
        "rootword":"ا ن ث",
        "meanings":"It was or became female, feminine, or of the feminine gender; It was or became soft.",
        "sentence":"The word بِالْأُنْثَى comes from the root ا ن ث and is associated with the meanings: It was or became female, feminine, or of the feminine gender; It was or became soft."
    },

    {
        "indexid":1959,
        "wordid":10829,
        "word":"كَظِيمٌ",
        "rootid":975,
        "rootword":"ك ظ م",
        "meanings":"To shut, stop, abstract, suppress one’s anger, choke, tight or fill something with a check, abstain from chewing the end.",
        "sentence":"The word كَظِيمٌ comes from the root ك ظ م and is associated with the meanings: To shut, stop, abstract, suppress one’s anger, choke, tight or fill something with a check, abstain from chewing the end."
    },

    {
        "indexid":1959,
        "wordid":11570,
        "word":"بُشِّرَ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word بُشِّرَ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":1959,
        "wordid":11571,
        "word":"ظَلَّ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word ظَلَّ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    },

    {
        "indexid":1959,
        "wordid":11572,
        "word":"وَجْهُهُ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وَجْهُهُ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":1959,
        "wordid":11573,
        "word":"مُسْوَدًّا",
        "rootid":420,
        "rootword":"س و د",
        "meanings":"to be lord\/noble\/glorious, rule\/lead, overcome in glory. sawida - to be black, bold. iswadda - to beget a black boy, boy who is chief. swad - great number. al-siyyidda - blessed lady. aswad - black, greater. aswadda wajhuhu - his face became expressive of grief or sorrow. He became sorrowful\/confounded\/disgraced. It is a token of bad conclusion and failure and sorrow.",
        "sentence":"The word مُسْوَدًّا comes from the root س و د and is associated with the meanings: to be lord\/noble\/glorious, rule\/lead, overcome in glory. sawida - to be black, bold. iswadda - to beget a black boy, boy who is chief. swad - great number. al-siyyidda - blessed lady. aswad - black, greater. aswadda wajhuhu - his face became expressive of grief or sorrow. He became sorrowful\/confounded\/disgraced. It is a token of bad conclusion and failure and sorrow."
    }]}