{"data":[
    {
        "indexid":1960,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1960,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":1960,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1960,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1960,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":1960,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1960,
        "wordid":4190,
        "word":"الْقَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1960,
        "wordid":6956,
        "word":"سَاءَ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَاءَ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":1960,
        "wordid":7831,
        "word":"يَحْكُمُونَ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word يَحْكُمُونَ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":1960,
        "wordid":11570,
        "word":"بُشِّرَ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word بُشِّرَ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":1960,
        "wordid":11574,
        "word":"يَتَوَارَى",
        "rootid":1207,
        "rootword":"و ر ي",
        "meanings":"made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses).",
        "sentence":"The word يَتَوَارَى comes from the root و ر ي and is associated with the meanings: made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses)."
    },

    {
        "indexid":1960,
        "wordid":11575,
        "word":"سُوءِ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سُوءِ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":1960,
        "wordid":11576,
        "word":"أَيُمْسِكُهُ",
        "rootid":953,
        "rootword":"م س ك",
        "meanings":"To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement.",
        "sentence":"The word أَيُمْسِكُهُ comes from the root م س ك and is associated with the meanings: To retain, withhold, maintain, be tenacious or niggardly, hold fast a thing, arrest a thing, restrain\/detain\/confine\/imprison a person, restrain or abstain from a thing, grasp\/clutch\/seize a thing, take a thing with the hand, intelligent or sound in judgement."
    },

    {
        "indexid":1960,
        "wordid":11577,
        "word":"هُونٍ",
        "rootid":470,
        "rootword":"ه و ن",
        "meanings":"to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn.",
        "sentence":"The word هُونٍ comes from the root ه و ن and is associated with the meanings: to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn."
    },

    {
        "indexid":1960,
        "wordid":11578,
        "word":"يَدُسُّهُ",
        "rootid":323,
        "rootword":"د س س",
        "meanings":"To hide, bury, conceal, insinuate, thrust. (Dal-Siin-Waw) corrupt",
        "sentence":"The word يَدُسُّهُ comes from the root د س س and is associated with the meanings: To hide, bury, conceal, insinuate, thrust. (Dal-Siin-Waw) corrupt"
    },

    {
        "indexid":1960,
        "wordid":11579,
        "word":"التُّرَابِ",
        "rootid":943,
        "rootword":"ت ر ب",
        "meanings":"To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs.",
        "sentence":"The word التُّرَابِ comes from the root ت ر ب and is associated with the meanings: To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs."
    }]}