{"data":[
    {
        "indexid":1968,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":1968,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1968,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1968,
        "wordid":3126,
        "word":"وَمِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1968,
        "wordid":3416,
        "word":"يَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word يَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":1968,
        "wordid":4117,
        "word":"حَسَنًا",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حَسَنًا comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":1968,
        "wordid":8282,
        "word":"تَتَّخِذُونَ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word تَتَّخِذُونَ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":1968,
        "wordid":11597,
        "word":"ثَمَرَاتِ",
        "rootid":1562,
        "rootword":"ث م ر",
        "meanings":"to bear fruit, fructify, get rich, increase. thamar - fruit, wealth, possession, profit, income.",
        "sentence":"The word ثَمَرَاتِ comes from the root ث م ر and is associated with the meanings: to bear fruit, fructify, get rich, increase. thamar - fruit, wealth, possession, profit, income."
    },

    {
        "indexid":1968,
        "wordid":11598,
        "word":"النَّخِيلِ",
        "rootid":1547,
        "rootword":"ن خ ل",
        "meanings":"to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice.",
        "sentence":"The word النَّخِيلِ comes from the root ن خ ل and is associated with the meanings: to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice."
    },

    {
        "indexid":1968,
        "wordid":11599,
        "word":"وَالْأَعْنَابِ",
        "rootid":788,
        "rootword":"ع ن ب",
        "meanings":"to produce grapes, grape.",
        "sentence":"The word وَالْأَعْنَابِ comes from the root ع ن ب and is associated with the meanings: to produce grapes, grape."
    },

    {
        "indexid":1968,
        "wordid":11600,
        "word":"سَكَرًا",
        "rootid":667,
        "rootword":"س ك ر",
        "meanings":"intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar.",
        "sentence":"The word سَكَرًا comes from the root س ك ر and is associated with the meanings: intoxicated, inebriated, drunken, violent\/angry, full\/still\/motionless\/calm, abolish, do away with, be dim, dazzled, rage against, be confused of judgement, bewildered, hindrance, bar, obstacle, obstruction, prevention, brake or stoppage between a person and his understanding and wits and he takes a wrong decision, become silly or blockhead, fail to understand, become cursed in intellect, lose one's wits, dam, to shut or close up, burn\/hot, dazzle\/cover\/confuse, grief, any disturbing element which may distract one's attention or observe one's reason, in a state of mental disequilibrium, one who has no sense as he is in raptures of love\/passion\/amour, sugar, sweet substance, very sweet date, sakr - sugar."
    },

    {
        "indexid":1968,
        "wordid":11601,
        "word":"وَرِزْقًا",
        "rootid":1179,
        "rootword":"ر ز ق",
        "meanings":"to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier.",
        "sentence":"The word وَرِزْقًا comes from the root ر ز ق and is associated with the meanings: to provide, supply, bestow, grant. turzaqan - you both shall be supplied. rizq - bounty, gift. raziq - one who provides or supplies. razzaq -great provider\/supplier."
    }]}