{"data":[
    {
        "indexid":1977,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":1977,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":1977,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":1977,
        "wordid":2261,
        "word":"مَثَلًا",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word مَثَلًا comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":1977,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1977,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":1977,
        "wordid":2996,
        "word":"بِخَيْرٍ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word بِخَيْرٍ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":1977,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":1977,
        "wordid":3260,
        "word":"صِرَاطٍ",
        "rootid":451,
        "rootword":"ص ر ط",
        "meanings":"a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword.",
        "sentence":"The word صِرَاطٍ comes from the root ص ر ط and is associated with the meanings: a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword."
    },

    {
        "indexid":1977,
        "wordid":3261,
        "word":"مُسْتَقِيمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مُسْتَقِيمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":1977,
        "wordid":3319,
        "word":"يَأْتِ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يَأْتِ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":1977,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":1977,
        "wordid":4463,
        "word":"بِالْعَدْلِ",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word بِالْعَدْلِ comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":1977,
        "wordid":4482,
        "word":"رَجُلَيْنِ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رَجُلَيْنِ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":1977,
        "wordid":6085,
        "word":"أَيْنَمَا",
        "rootid":1460,
        "rootword":"ا ي ن",
        "meanings":"",
        "sentence":"The word أَيْنَمَا comes from the root ا ي ن and is associated with the meanings: "
    },

    {
        "indexid":1977,
        "wordid":6206,
        "word":"يَسْتَوِي",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word يَسْتَوِي comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":1977,
        "wordid":8095,
        "word":"يَأْمُرُ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word يَأْمُرُ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":1977,
        "wordid":10598,
        "word":"أَحَدُهُمَا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدُهُمَا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":1977,
        "wordid":11628,
        "word":"يَقْدِرُ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word يَقْدِرُ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":1977,
        "wordid":11631,
        "word":"وَضَرَبَ",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word وَضَرَبَ comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":1977,
        "wordid":11632,
        "word":"أَبْكَمُ",
        "rootid":1065,
        "rootword":"ب ك م",
        "meanings":"dumb (either by natural conformation or from an inability to find words to express himself), no understanding to reply, no ability to frame speech well though possessing the faculty of speech, refrain\/cease speaking intentionally or from ignorance, impeded speech, unable to speak freely.",
        "sentence":"The word أَبْكَمُ comes from the root ب ك م and is associated with the meanings: dumb (either by natural conformation or from an inability to find words to express himself), no understanding to reply, no ability to frame speech well though possessing the faculty of speech, refrain\/cease speaking intentionally or from ignorance, impeded speech, unable to speak freely."
    },

    {
        "indexid":1977,
        "wordid":11633,
        "word":"كَلٌّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كَلٌّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":1977,
        "wordid":11634,
        "word":"مَوْلَاهُ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word مَوْلَاهُ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":1977,
        "wordid":11635,
        "word":"يُوَجِّهْهُ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word يُوَجِّهْهُ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    }]}