{"data":[
    {
        "indexid":2000,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2000,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2000,
        "wordid":3489,
        "word":"لَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word لَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":2000,
        "wordid":8845,
        "word":"يَتَوَكَّلُونَ",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word يَتَوَكَّلُونَ comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":2000,
        "wordid":11361,
        "word":"سُلْطَانٌ",
        "rootid":844,
        "rootword":"س ل ط",
        "meanings":"prevailed\/overcame\/predominated, firm\/established in superior power\/force, strength, possess power of dominion\/sovereignty\/rule\/authority, sharp\/eloquent, miracle",
        "sentence":"The word سُلْطَانٌ comes from the root س ل ط and is associated with the meanings: prevailed\/overcame\/predominated, firm\/established in superior power\/force, strength, possess power of dominion\/sovereignty\/rule\/authority, sharp\/eloquent, miracle"
    }]}