{"data":[
    {
        "indexid":2017,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2017,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2017,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2017,
        "wordid":2424,
        "word":"لِمَا",
        "rootid":1155,
        "rootword":"ل م ا",
        "meanings":"Why? For what reason?",
        "sentence":"The word لِمَا comes from the root ل م ا and is associated with the meanings: Why? For what reason?"
    },

    {
        "indexid":2017,
        "wordid":2980,
        "word":"تَقُولُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word تَقُولُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2017,
        "wordid":4667,
        "word":"يَفْتَرُونَ",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word يَفْتَرُونَ comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    },

    {
        "indexid":2017,
        "wordid":4953,
        "word":"الْكَذِبَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word الْكَذِبَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":2017,
        "wordid":9888,
        "word":"يُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word يُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":2017,
        "wordid":11748,
        "word":"تَصِفُ",
        "rootid":245,
        "rootword":"و ص ف",
        "meanings":"to describe (good or bad), assert something as a fact, achieve, ascribe, specify.",
        "sentence":"The word تَصِفُ comes from the root و ص ف and is associated with the meanings: to describe (good or bad), assert something as a fact, achieve, ascribe, specify."
    },

    {
        "indexid":2017,
        "wordid":11749,
        "word":"أَلْسِنَتُكُمُ",
        "rootid":227,
        "rootword":"ل س ن",
        "meanings":"a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech.",
        "sentence":"The word أَلْسِنَتُكُمُ comes from the root ل س ن and is associated with the meanings: a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech."
    },

    {
        "indexid":2017,
        "wordid":11750,
        "word":"حَلَالٌ",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word حَلَالٌ comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":2017,
        "wordid":11751,
        "word":"حَرَامٌ",
        "rootid":1667,
        "rootword":"ح ر م",
        "meanings":"To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred.",
        "sentence":"The word حَرَامٌ comes from the root ح ر م and is associated with the meanings: To forbid, prevent, prohibit, make or declare unlawful, deprive, declare a thing sacred."
    },

    {
        "indexid":2017,
        "wordid":11752,
        "word":"لِتَفْتَرُوا",
        "rootid":1336,
        "rootword":"ف ر ي",
        "meanings":"to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent.",
        "sentence":"The word لِتَفْتَرُوا comes from the root ف ر ي and is associated with the meanings: to cut\/split\/cleave, slander, fabricate (a lie). In this root the letter Ya is changed to Alif when the verb is joined to the pronominal. fariya - to be astonished\/amazed, blame, repair. farriyun - new, strange, wonderful, remarkable, unheard, unprecedent."
    }]}