{"data":[
    {
        "indexid":2032,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2032,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":2032,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2032,
        "wordid":6492,
        "word":"نُوحٍ",
        "rootid":194,
        "rootword":"ن و ح",
        "meanings":"Noah\/Nuh. To lament, wail, coo.",
        "sentence":"The word نُوحٍ comes from the root ن و ح and is associated with the meanings: Noah\/Nuh. To lament, wail, coo."
    },

    {
        "indexid":2032,
        "wordid":6525,
        "word":"عَبْدًا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَبْدًا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":2032,
        "wordid":11780,
        "word":"ذُرِّيَّةَ",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّةَ comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":2032,
        "wordid":11781,
        "word":"حَمَلْنَا",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word حَمَلْنَا comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":2032,
        "wordid":11782,
        "word":"شَكُورًا",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word شَكُورًا comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    }]}