{"data":[
    {
        "indexid":2041,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2041,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2041,
        "wordid":2490,
        "word":"رَبِّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2041,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2041,
        "wordid":3733,
        "word":"فَضْلًا",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word فَضْلًا comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":2041,
        "wordid":4682,
        "word":"اللَّيْلَ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلَ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2041,
        "wordid":4683,
        "word":"النَّهَارِ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word النَّهَارِ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":2041,
        "wordid":6644,
        "word":"وَجَعَلْنَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلْنَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2041,
        "wordid":8184,
        "word":"فَصَّلْنَاهُ",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word فَصَّلْنَاهُ comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    },

    {
        "indexid":2041,
        "wordid":9697,
        "word":"عَدَدَ",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word عَدَدَ comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    },

    {
        "indexid":2041,
        "wordid":9698,
        "word":"السِّنِينَ",
        "rootid":1518,
        "rootword":"س ن و",
        "meanings":"to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage.",
        "sentence":"The word السِّنِينَ comes from the root س ن و and is associated with the meanings: to blaze (fire, lightning), flash. sana - brightness, splendour, gleaming, light. sanatun - year, sinin - years.There is a difference between the words sinatun & AAam (2:259) both words are used for year but sinatun is used for years with drought\/death\/hard\/distresing and AAam are those years in which there is ampleness\/abundance\/life\/herbage."
    },

    {
        "indexid":2041,
        "wordid":9699,
        "word":"وَالْحِسَابَ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word وَالْحِسَابَ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":2041,
        "wordid":9886,
        "word":"وَالنَّهَارَ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word وَالنَّهَارَ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":2041,
        "wordid":11817,
        "word":"فَمَحَوْنَا",
        "rootid":1722,
        "rootword":"م ح و",
        "meanings":"To efface or erase a thing, to obliterate\/cancel\/remove\/do away with a thing, to dispell a thing.",
        "sentence":"The word فَمَحَوْنَا comes from the root م ح و and is associated with the meanings: To efface or erase a thing, to obliterate\/cancel\/remove\/do away with a thing, to dispell a thing."
    },

    {
        "indexid":2041,
        "wordid":11818,
        "word":"مُبْصِرَةً",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word مُبْصِرَةً comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":2041,
        "wordid":11819,
        "word":"لِتَبْتَغُوا",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word لِتَبْتَغُوا comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":2041,
        "wordid":11820,
        "word":"وَلِتَعْلَمُوا",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَلِتَعْلَمُوا comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2041,
        "wordid":11821,
        "word":"وَكُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2041,
        "wordid":11822,
        "word":"تَفْصِيلًا",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word تَفْصِيلًا comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    }]}