{"data":[
    {
        "indexid":2042,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2042,
        "wordid":2820,
        "word":"الْقِيَامَةِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقِيَامَةِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":2042,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2042,
        "wordid":5256,
        "word":"كِتَابًا",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابًا comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":2042,
        "wordid":11821,
        "word":"وَكُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2042,
        "wordid":11823,
        "word":"إِنْسَانٍ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word إِنْسَانٍ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":2042,
        "wordid":11824,
        "word":"أَلْزَمْنَاهُ",
        "rootid":1112,
        "rootword":"ل ز م",
        "meanings":"To stick close to, to cling, associate, adhere, belong, intend, fasten, remain, made incumbent\/obligatory.",
        "sentence":"The word أَلْزَمْنَاهُ comes from the root ل ز م and is associated with the meanings: To stick close to, to cling, associate, adhere, belong, intend, fasten, remain, made incumbent\/obligatory."
    },

    {
        "indexid":2042,
        "wordid":11825,
        "word":"طَائِرَهُ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word طَائِرَهُ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":2042,
        "wordid":11826,
        "word":"عُنُقِهِ",
        "rootid":1353,
        "rootword":"ع ن ق",
        "meanings":"to be long-necked, become thin in the neck. ta'anaqa - to embrace. unuqun (pl. a'naq) neck, company (of men), trunk (of a tree), stalk (of a leaf or fruit), heads or chiefs of men, great ones. In 17:29 it is used as  a metaphorical phrase to mean: do not keep your hand stackled to your neck out of miserliness, do not be niggardly. In verse 17:13 unuqun is metaphorically used and refers to the principle that every action produces an effect which is \"made to cling to a person\" and that his deeds will be recorded in a Book and that their effect will be seen on the day of resurrection. \"Clinging to the neck\" indicates the inseparability of one thing from another, thus establishing the law of cause and effect.",
        "sentence":"The word عُنُقِهِ comes from the root ع ن ق and is associated with the meanings: to be long-necked, become thin in the neck. ta'anaqa - to embrace. unuqun (pl. a'naq) neck, company (of men), trunk (of a tree), stalk (of a leaf or fruit), heads or chiefs of men, great ones. In 17:29 it is used as  a metaphorical phrase to mean: do not keep your hand stackled to your neck out of miserliness, do not be niggardly. In verse 17:13 unuqun is metaphorically used and refers to the principle that every action produces an effect which is \"made to cling to a person\" and that his deeds will be recorded in a Book and that their effect will be seen on the day of resurrection. \"Clinging to the neck\" indicates the inseparability of one thing from another, thus establishing the law of cause and effect."
    },

    {
        "indexid":2042,
        "wordid":11827,
        "word":"وَنُخْرِجُ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word وَنُخْرِجُ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":2042,
        "wordid":11828,
        "word":"يَلْقَاهُ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word يَلْقَاهُ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2042,
        "wordid":11829,
        "word":"مَنْشُورًا",
        "rootid":993,
        "rootword":"ن ش ر",
        "meanings":"to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad.",
        "sentence":"The word مَنْشُورًا comes from the root ن ش ر and is associated with the meanings: to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad."
    }]}