{"data":[
    {
        "indexid":2045,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2045,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2045,
        "wordid":6003,
        "word":"أَرَدْنَا",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word أَرَدْنَا comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2045,
        "wordid":10135,
        "word":"الْقَوْلُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word الْقَوْلُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2045,
        "wordid":11738,
        "word":"قَرْيَةً",
        "rootid":337,
        "rootword":"ق ر ي",
        "meanings":"To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town.",
        "sentence":"The word قَرْيَةً comes from the root ق ر ي and is associated with the meanings: To entertain a guest, that with which a guest is entertained. To collect, run to\/into. To explore; investigate; with a much and diligent search, city\/town."
    },

    {
        "indexid":2045,
        "wordid":11835,
        "word":"نُهْلِكَ",
        "rootid":1683,
        "rootword":"ه ل ك",
        "meanings":"to die, perish, wasted, be lost, destroyed, spoiled.",
        "sentence":"The word نُهْلِكَ comes from the root ه ل ك and is associated with the meanings: to die, perish, wasted, be lost, destroyed, spoiled."
    },

    {
        "indexid":2045,
        "wordid":11836,
        "word":"أَمَرْنَا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمَرْنَا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2045,
        "wordid":11837,
        "word":"مُتْرَفِيهَا",
        "rootid":1773,
        "rootword":"ت ر ف",
        "meanings":"soft, ease, to lead a delicate life, enjoy good things of life, to bestow the good things of life.Luxuriant\/flourishing\/succulent\/plentifulness.Corrupted, well to do, ungrateful, proud, one whom a life of softness and ease has caused to behave insolently, one whom the exclusive pursuit of pleasures of life has corrupted.",
        "sentence":"The word مُتْرَفِيهَا comes from the root ت ر ف and is associated with the meanings: soft, ease, to lead a delicate life, enjoy good things of life, to bestow the good things of life.Luxuriant\/flourishing\/succulent\/plentifulness.Corrupted, well to do, ungrateful, proud, one whom a life of softness and ease has caused to behave insolently, one whom the exclusive pursuit of pleasures of life has corrupted."
    },

    {
        "indexid":2045,
        "wordid":11838,
        "word":"فَفَسَقُوا",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word فَفَسَقُوا comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":2045,
        "wordid":11839,
        "word":"فَحَقَّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word فَحَقَّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":2045,
        "wordid":11840,
        "word":"فَدَمَّرْنَاهَا",
        "rootid":1737,
        "rootword":"د م ر",
        "meanings":"To perish utterly, be annihilated, to destroy.",
        "sentence":"The word فَدَمَّرْنَاهَا comes from the root د م ر and is associated with the meanings: To perish utterly, be annihilated, to destroy."
    },

    {
        "indexid":2045,
        "wordid":11841,
        "word":"تَدْمِيرًا",
        "rootid":1737,
        "rootword":"د م ر",
        "meanings":"To perish utterly, be annihilated, to destroy.",
        "sentence":"The word تَدْمِيرًا comes from the root د م ر and is associated with the meanings: To perish utterly, be annihilated, to destroy."
    }]}