{"data":[
    {
        "indexid":2047,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2047,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2047,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2047,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2047,
        "wordid":3130,
        "word":"جَعَلْنَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلْنَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2047,
        "wordid":3343,
        "word":"لِمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word لِمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2047,
        "wordid":3576,
        "word":"يُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word يُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2047,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":2047,
        "wordid":7160,
        "word":"نُرِيدُ",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word نُرِيدُ comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":2047,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2047,
        "wordid":8040,
        "word":"مَدْحُورًا",
        "rootid":641,
        "rootword":"د ح ر",
        "meanings":"To drive away, repel, turn off, discard, banish.",
        "sentence":"The word مَدْحُورًا comes from the root د ح ر and is associated with the meanings: To drive away, repel, turn off, discard, banish."
    },

    {
        "indexid":2047,
        "wordid":11844,
        "word":"الْعَاجِلَةَ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word الْعَاجِلَةَ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":2047,
        "wordid":11845,
        "word":"عَجَّلْنَا",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word عَجَّلْنَا comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":2047,
        "wordid":11846,
        "word":"يَصْلَاهَا",
        "rootid":380,
        "rootword":"ص ل ي",
        "meanings":"to warm at the fire, endure heat, to roast\/fry\/broil\/burn.",
        "sentence":"The word يَصْلَاهَا comes from the root ص ل ي and is associated with the meanings: to warm at the fire, endure heat, to roast\/fry\/broil\/burn."
    },

    {
        "indexid":2047,
        "wordid":11847,
        "word":"مَذْمُومًا",
        "rootid":215,
        "rootword":"ذ م م",
        "meanings":"to revile\/blame\/reprove\/condemn\/censure\/reprehend, blameworthy, blamed one, disgraced, abused, shun\/avoid.Treaty, good faith, agreement, covenant, protection, grant protection\/security, engagement, obligation, compact, responsibility.",
        "sentence":"The word مَذْمُومًا comes from the root ذ م م and is associated with the meanings: to revile\/blame\/reprove\/condemn\/censure\/reprehend, blameworthy, blamed one, disgraced, abused, shun\/avoid.Treaty, good faith, agreement, covenant, protection, grant protection\/security, engagement, obligation, compact, responsibility."
    }]}