{"data":[
    {
        "indexid":2058,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2058,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2058,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2058,
        "wordid":6727,
        "word":"يَدَكَ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word يَدَكَ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":2058,
        "wordid":11859,
        "word":"تَجْعَلْ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word تَجْعَلْ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2058,
        "wordid":11860,
        "word":"فَتَقْعُدَ",
        "rootid":1162,
        "rootword":"ق ع د",
        "meanings":"to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment.",
        "sentence":"The word فَتَقْعُدَ comes from the root ق ع د and is associated with the meanings: to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment."
    },

    {
        "indexid":2058,
        "wordid":11887,
        "word":"مَغْلُولَةً",
        "rootid":874,
        "rootword":"غ ل ل",
        "meanings":"to [make something] enter, clad with, put upon, burning with thirst, became unfaithful, collar, shackle, a thing in which one hides himself, dishonesty, insincerity, revenue from the land",
        "sentence":"The word مَغْلُولَةً comes from the root غ ل ل and is associated with the meanings: to [make something] enter, clad with, put upon, burning with thirst, became unfaithful, collar, shackle, a thing in which one hides himself, dishonesty, insincerity, revenue from the land"
    },

    {
        "indexid":2058,
        "wordid":11888,
        "word":"عُنُقِكَ",
        "rootid":1353,
        "rootword":"ع ن ق",
        "meanings":"to be long-necked, become thin in the neck. ta'anaqa - to embrace. unuqun (pl. a'naq) neck, company (of men), trunk (of a tree), stalk (of a leaf or fruit), heads or chiefs of men, great ones. In 17:29 it is used as  a metaphorical phrase to mean: do not keep your hand stackled to your neck out of miserliness, do not be niggardly. In verse 17:13 unuqun is metaphorically used and refers to the principle that every action produces an effect which is \"made to cling to a person\" and that his deeds will be recorded in a Book and that their effect will be seen on the day of resurrection. \"Clinging to the neck\" indicates the inseparability of one thing from another, thus establishing the law of cause and effect.",
        "sentence":"The word عُنُقِكَ comes from the root ع ن ق and is associated with the meanings: to be long-necked, become thin in the neck. ta'anaqa - to embrace. unuqun (pl. a'naq) neck, company (of men), trunk (of a tree), stalk (of a leaf or fruit), heads or chiefs of men, great ones. In 17:29 it is used as  a metaphorical phrase to mean: do not keep your hand stackled to your neck out of miserliness, do not be niggardly. In verse 17:13 unuqun is metaphorically used and refers to the principle that every action produces an effect which is \"made to cling to a person\" and that his deeds will be recorded in a Book and that their effect will be seen on the day of resurrection. \"Clinging to the neck\" indicates the inseparability of one thing from another, thus establishing the law of cause and effect."
    },

    {
        "indexid":2058,
        "wordid":11889,
        "word":"تَبْسُطْهَا",
        "rootid":368,
        "rootword":"ب س ط",
        "meanings":"Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)",
        "sentence":"The word تَبْسُطْهَا comes from the root ب س ط and is associated with the meanings: Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)"
    },

    {
        "indexid":2058,
        "wordid":11890,
        "word":"الْبَسْطِ",
        "rootid":368,
        "rootword":"ب س ط",
        "meanings":"Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)",
        "sentence":"The word الْبَسْطِ comes from the root ب س ط and is associated with the meanings: Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)"
    },

    {
        "indexid":2058,
        "wordid":11891,
        "word":"مَلُومًا",
        "rootid":1209,
        "rootword":"ل و م",
        "meanings":"(lama)To blame someone for something, accuse.",
        "sentence":"The word مَلُومًا comes from the root ل و م and is associated with the meanings: (lama)To blame someone for something, accuse."
    },

    {
        "indexid":2058,
        "wordid":11892,
        "word":"مَحْسُورًا",
        "rootid":1545,
        "rootword":"ح س ر",
        "meanings":"To get tired, fatigued, fall short.",
        "sentence":"The word مَحْسُورًا comes from the root ح س ر and is associated with the meanings: To get tired, fatigued, fall short."
    }]}