{"data":[
    {
        "indexid":2079,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":2079,
        "wordid":2647,
        "word":"كُونُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُونُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2079,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2079,
        "wordid":8946,
        "word":"حِجَارَةً",
        "rootid":283,
        "rootword":"ح ج ر",
        "meanings":"To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place).",
        "sentence":"The word حِجَارَةً comes from the root ح ج ر and is associated with the meanings: To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place)."
    },

    {
        "indexid":2079,
        "wordid":11952,
        "word":"حَدِيدًا",
        "rootid":862,
        "rootword":"ح د د",
        "meanings":"To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen.",
        "sentence":"The word حَدِيدًا comes from the root ح د د and is associated with the meanings: To define a limit, determine (a thing), punish (a culprit), prevent, thrust back, throw back, sharpen."
    }]}