{"data":[
    {
        "indexid":2097,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2097,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":2097,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2097,
        "wordid":4513,
        "word":"تَجِدُوا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word تَجِدُوا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":2097,
        "wordid":6107,
        "word":"وَكِيلًا",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word وَكِيلًا comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":2097,
        "wordid":7074,
        "word":"الْبَرِّ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word الْبَرِّ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":2097,
        "wordid":11545,
        "word":"يَخْسِفَ",
        "rootid":496,
        "rootword":"خ س ف",
        "meanings":"To sink or go away into the ground or earth (place or person), become depressed (such as the eye becoming depressed in the head), to lose sight\/become blind, to lose light (like the sun or moon during an eclipse), become defective or deficient, become lean or emaciated, to recover (such as from disease or illness), to put out one's eye, make a hole in a thing, to abase or humble or make lowly, to disgrace, to be vile.",
        "sentence":"The word يَخْسِفَ comes from the root خ س ف and is associated with the meanings: To sink or go away into the ground or earth (place or person), become depressed (such as the eye becoming depressed in the head), to lose sight\/become blind, to lose light (like the sun or moon during an eclipse), become defective or deficient, become lean or emaciated, to recover (such as from disease or illness), to put out one's eye, make a hole in a thing, to abase or humble or make lowly, to disgrace, to be vile."
    },

    {
        "indexid":2097,
        "wordid":12006,
        "word":"أَفَأَمِنْتُمْ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word أَفَأَمِنْتُمْ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2097,
        "wordid":12007,
        "word":"جَانِبَ",
        "rootid":1358,
        "rootword":"ج ن ب",
        "meanings":"To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of.",
        "sentence":"The word جَانِبَ comes from the root ج ن ب and is associated with the meanings: To break or hit or hurt one's side, to lead one by his side, place or put a thing aside, to remove or send a thing far away or far off, estrange or alienate someone, descend and abode\/settle as a stranger among people, to be remote\/distant\/far off\/aloof from someone, shun or avoid someone, alienate or estrange oneself from someone, to be under the obligation of performing a total bath or ablution (by reason of sexual intercourse and semenal discharge), to be lateral or adjacent to someone or to a thing, walk by the side of another, to be gentle\/compliant\/easy to deal with, to be much of."
    },

    {
        "indexid":2097,
        "wordid":12008,
        "word":"يُرْسِلَ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word يُرْسِلَ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":2097,
        "wordid":12009,
        "word":"حَاصِبًا",
        "rootid":1427,
        "rootword":"ح ص ب",
        "meanings":"To throw pebbles at, scatter gravel, cast into the fire. Firewood, stones.",
        "sentence":"The word حَاصِبًا comes from the root ح ص ب and is associated with the meanings: To throw pebbles at, scatter gravel, cast into the fire. Firewood, stones."
    }]}