{"data":[
    {
        "indexid":21,
        "wordid":2078,
        "word":"ءَامَنَّا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَّا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":21,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":21,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":21,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":21,
        "wordid":2117,
        "word":"لَقُوا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لَقُوا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":21,
        "wordid":2118,
        "word":"خَلَوْا",
        "rootid":1339,
        "rootword":"خ ل و",
        "meanings":"To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed).",
        "sentence":"The word خَلَوْا comes from the root خ ل و and is associated with the meanings: To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed)."
    },

    {
        "indexid":21,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":21,
        "wordid":2122,
        "word":"مَعَكُمْ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَكُمْ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":21,
        "wordid":2123,
        "word":"مُسْتَهْزِءُونَ",
        "rootid":1496,
        "rootword":"ه ز ا",
        "meanings":"to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) .",
        "sentence":"The word مُسْتَهْزِءُونَ comes from the root ه ز ا and is associated with the meanings: to bring down disgrace upon, send down contempt. To mock\/ridicule\/deride\/laugh. (e.g. huzuwan, 2:67) ."
    }]}