{"data":[
    {
        "indexid":2103,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2103,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":2103,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2103,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2103,
        "wordid":5377,
        "word":"لَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word لَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2103,
        "wordid":12027,
        "word":"ثَبَّتْنَاكَ",
        "rootid":68,
        "rootword":"ث ب ت",
        "meanings":"to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed).",
        "sentence":"The word ثَبَّتْنَاكَ comes from the root ث ب ت and is associated with the meanings: to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed)."
    },

    {
        "indexid":2103,
        "wordid":12028,
        "word":"كِدْتَ",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word كِدْتَ comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":2103,
        "wordid":12029,
        "word":"تَرْكَنُ",
        "rootid":1576,
        "rootword":"ر ك ن",
        "meanings":"to lean on, rely upon, trust. ruknun - support, stay, firm part of a thing on which it rests, pillar, corner-stone, court, pride of power and might, resistance, kinsfolk or clan, party, person by whom one is aided and strengthened, noble or high person, thing whereby one is strengthened.",
        "sentence":"The word تَرْكَنُ comes from the root ر ك ن and is associated with the meanings: to lean on, rely upon, trust. ruknun - support, stay, firm part of a thing on which it rests, pillar, corner-stone, court, pride of power and might, resistance, kinsfolk or clan, party, person by whom one is aided and strengthened, noble or high person, thing whereby one is strengthened."
    }]}