{"data":[
    {
        "indexid":2107,
        "wordid":2037,
        "word":"الصَّلَوةَ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةَ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":2107,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2107,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2107,
        "wordid":3401,
        "word":"اللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2107,
        "wordid":3618,
        "word":"الْفَجْرِ",
        "rootid":1452,
        "rootword":"ف ج ر",
        "meanings":"cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows.",
        "sentence":"The word الْفَجْرِ comes from the root ف ج ر and is associated with the meanings: cut\/divide lengthwise, break open, vent, incline\/decline\/deviate, dawn\/sunrise\/daybreak, source, abundantly and suddenly, ample bounty\/generosity, a place from which water flows."
    },

    {
        "indexid":2107,
        "wordid":12042,
        "word":"أَقِمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word أَقِمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":2107,
        "wordid":12043,
        "word":"لِدُلُوكِ",
        "rootid":93,
        "rootword":"د ل ك",
        "meanings":"rubbing, squeezing, pressing, decline, sinking, become red, set, incline downwards from the meridian (sun). The whole phrase \"duluk-as-shams\" defined as \"sunset\" by Lane.",
        "sentence":"The word لِدُلُوكِ comes from the root د ل ك and is associated with the meanings: rubbing, squeezing, pressing, decline, sinking, become red, set, incline downwards from the meridian (sun). The whole phrase \"duluk-as-shams\" defined as \"sunset\" by Lane."
    },

    {
        "indexid":2107,
        "wordid":12044,
        "word":"الشَّمْسِ",
        "rootid":638,
        "rootword":"ش م س",
        "meanings":"to be bright with sunshine, be glorious, be sunny. shams - sun.",
        "sentence":"The word الشَّمْسِ comes from the root ش م س and is associated with the meanings: to be bright with sunshine, be glorious, be sunny. shams - sun."
    },

    {
        "indexid":2107,
        "wordid":12045,
        "word":"غَسَقِ",
        "rootid":1739,
        "rootword":"غ س ق",
        "meanings":"darkness, the night; shed tears, poured water; intense coldness; watery\/thick purulent matter that flows or drips; intensely red (applied to she-camel)",
        "sentence":"The word غَسَقِ comes from the root غ س ق and is associated with the meanings: darkness, the night; shed tears, poured water; intense coldness; watery\/thick purulent matter that flows or drips; intensely red (applied to she-camel)"
    },

    {
        "indexid":2107,
        "wordid":12046,
        "word":"وَقُرْءَانَ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word وَقُرْءَانَ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":2107,
        "wordid":12047,
        "word":"قُرْءَانَ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word قُرْءَانَ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":2107,
        "wordid":12048,
        "word":"مَشْهُودًا",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word مَشْهُودًا comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    }]}