{"data":[
    {
        "indexid":2115,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2115,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2115,
        "wordid":4702,
        "word":"تَجِدُ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word تَجِدُ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":2115,
        "wordid":6107,
        "word":"وَكِيلًا",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word وَكِيلًا comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":2115,
        "wordid":8720,
        "word":"شِئْنَا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شِئْنَا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2115,
        "wordid":12075,
        "word":"لَنَذْهَبَنَّ",
        "rootid":1657,
        "rootword":"ذ ه ب",
        "meanings":"to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold.",
        "sentence":"The word لَنَذْهَبَنَّ comes from the root ذ ه ب and is associated with the meanings: to go, go away, depart, take away or go away with, consume, receive, pass along, die, be ended.Opinion, belief, way of action, rite. Hold an opinion, follow the opinion of, hold a belief, adapt an opinion.Gold."
    }]}