{"data":[
    {
        "indexid":2122,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2122,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2122,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":2122,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":2122,
        "wordid":2229,
        "word":"وَلَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word وَلَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":2122,
        "wordid":2525,
        "word":"نُؤْمِنَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word نُؤْمِنَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2122,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2122,
        "wordid":3174,
        "word":"رَسُولًا",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word رَسُولًا comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":2122,
        "wordid":3323,
        "word":"يَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2122,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":2122,
        "wordid":4839,
        "word":"رَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2122,
        "wordid":5256,
        "word":"كِتَابًا",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابًا comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":2122,
        "wordid":6054,
        "word":"كُنْتُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2122,
        "wordid":6444,
        "word":"تُنَزِّلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word تُنَزِّلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2122,
        "wordid":10080,
        "word":"بَشَرًا",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word بَشَرًا comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":2122,
        "wordid":11772,
        "word":"سُبْحَانَ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word سُبْحَانَ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":2122,
        "wordid":12095,
        "word":"بَيْتٌ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word بَيْتٌ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":2122,
        "wordid":12096,
        "word":"زُخْرُفٍ",
        "rootid":604,
        "rootword":"ز خ ر ف",
        "meanings":"the adorning\/decorating\/embellishing\/ornamenting a thing, anything embellished or varnished with a false colouring, lies, falsifying\/adulterating of speech.",
        "sentence":"The word زُخْرُفٍ comes from the root ز خ ر ف and is associated with the meanings: the adorning\/decorating\/embellishing\/ornamenting a thing, anything embellished or varnished with a false colouring, lies, falsifying\/adulterating of speech."
    },

    {
        "indexid":2122,
        "wordid":12097,
        "word":"تَرْقَى",
        "rootid":101,
        "rootword":"ر ق ي",
        "meanings":"to ascend, rise gradually, mount a ladder. mirqat - stair, ladder, stepping-stone, ascent. raqin - physician, charmer. taraqiya (pl. of tarquwutun) - collar bone(s), throat, clavicle (according to some its root is raqawa or tarqawa).",
        "sentence":"The word تَرْقَى comes from the root ر ق ي and is associated with the meanings: to ascend, rise gradually, mount a ladder. mirqat - stair, ladder, stepping-stone, ascent. raqin - physician, charmer. taraqiya (pl. of tarquwutun) - collar bone(s), throat, clavicle (according to some its root is raqawa or tarqawa)."
    },

    {
        "indexid":2122,
        "wordid":12098,
        "word":"لِرُقِيِّكَ",
        "rootid":101,
        "rootword":"ر ق ي",
        "meanings":"to ascend, rise gradually, mount a ladder. mirqat - stair, ladder, stepping-stone, ascent. raqin - physician, charmer. taraqiya (pl. of tarquwutun) - collar bone(s), throat, clavicle (according to some its root is raqawa or tarqawa).",
        "sentence":"The word لِرُقِيِّكَ comes from the root ر ق ي and is associated with the meanings: to ascend, rise gradually, mount a ladder. mirqat - stair, ladder, stepping-stone, ascent. raqin - physician, charmer. taraqiya (pl. of tarquwutun) - collar bone(s), throat, clavicle (according to some its root is raqawa or tarqawa)."
    },

    {
        "indexid":2122,
        "wordid":12099,
        "word":"نَقْرَؤُهُ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word نَقْرَؤُهُ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    }]}