{"data":[
    {
        "indexid":2143,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2143,
        "wordid":2894,
        "word":"أَبَدًا",
        "rootid":450,
        "rootword":"ا ب د",
        "meanings":"he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction).",
        "sentence":"The word أَبَدًا comes from the root ا ب د and is associated with the meanings: he remained\/stayed, abode, dwelt constantly\/permanently, to render perpetual, time (in an absolute sense), long time, endless\/eternal\/forever, unlimited\/indivisible, lasting\/everlasting, unsocial\/unfamiliar, never (when used in negative construction)."
    },

    {
        "indexid":2143,
        "wordid":12157,
        "word":"مَاكِثِينَ",
        "rootid":388,
        "rootword":"م ك ث",
        "meanings":"To tarry, to tarry and wait\/expect, to loiter, to stay, pause in expectation, to not haste, be slow of speech.",
        "sentence":"The word مَاكِثِينَ comes from the root م ك ث and is associated with the meanings: To tarry, to tarry and wait\/expect, to loiter, to stay, pause in expectation, to not haste, be slow of speech."
    }]}