{"data":[
    {
        "indexid":2152,
        "wordid":2424,
        "word":"لِمَا",
        "rootid":1155,
        "rootword":"ل م ا",
        "meanings":"Why? For what reason?",
        "sentence":"The word لِمَا comes from the root ل م ا and is associated with the meanings: Why? For what reason?"
    },

    {
        "indexid":2152,
        "wordid":3271,
        "word":"لِنَعْلَمَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word لِنَعْلَمَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2152,
        "wordid":4709,
        "word":"أَمَدًا",
        "rootid":848,
        "rootword":"ا م د",
        "meanings":"time considered in regard to its end, utmost\/extreme\/extent \/term, limits, limited, remainder",
        "sentence":"The word أَمَدًا comes from the root ا م د and is associated with the meanings: time considered in regard to its end, utmost\/extreme\/extent \/term, limits, limited, remainder"
    },

    {
        "indexid":2152,
        "wordid":7264,
        "word":"أَيُّ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word أَيُّ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":2152,
        "wordid":12177,
        "word":"بَعَثْنَاهُمْ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word بَعَثْنَاهُمْ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":2152,
        "wordid":12178,
        "word":"الْحِزْبَيْنِ",
        "rootid":1267,
        "rootword":"ح ز ب",
        "meanings":"To befall and distress, divide.",
        "sentence":"The word الْحِزْبَيْنِ comes from the root ح ز ب and is associated with the meanings: To befall and distress, divide."
    },

    {
        "indexid":2152,
        "wordid":12179,
        "word":"أَحْصَى",
        "rootid":1147,
        "rootword":"ح ص ي",
        "meanings":"Calculate, to count\/number. To strike with a pebble.",
        "sentence":"The word أَحْصَى comes from the root ح ص ي and is associated with the meanings: Calculate, to count\/number. To strike with a pebble."
    },

    {
        "indexid":2152,
        "wordid":12180,
        "word":"لَبِثُوا",
        "rootid":812,
        "rootword":"ل ب ث",
        "meanings":"to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb.",
        "sentence":"The word لَبِثُوا comes from the root ل ب ث and is associated with the meanings: to delay, tarry, sojourn, to pause\/wait\/expect\/stop\/remain, was patient. labitha vb."
    }]}