{"data":[
    {
        "indexid":2158,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2158,
        "wordid":8840,
        "word":"ذَاتَ",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَاتَ comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":2158,
        "wordid":9303,
        "word":"لَوِ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوِ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":2158,
        "wordid":11551,
        "word":"الْيَمِينِ",
        "rootid":114,
        "rootword":"ي م ن",
        "meanings":"right side, right, right hand, oath.",
        "sentence":"The word الْيَمِينِ comes from the root ي م ن and is associated with the meanings: right side, right, right hand, oath."
    },

    {
        "indexid":2158,
        "wordid":12200,
        "word":"الشِّمَالِ",
        "rootid":887,
        "rootword":"ش م ل",
        "meanings":"to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths.",
        "sentence":"The word الشِّمَالِ comes from the root ش م ل and is associated with the meanings: to include, contain, conceive, comprise, comprehend. shimaal (pl. shamaa'il) - left, norths."
    },

    {
        "indexid":2158,
        "wordid":12203,
        "word":"وَتَحْسَبُهُمْ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word وَتَحْسَبُهُمْ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":2158,
        "wordid":12204,
        "word":"أَيْقَاظًا",
        "rootid":1081,
        "rootword":"ي ق ظ",
        "meanings":"awake",
        "sentence":"The word أَيْقَاظًا comes from the root ي ق ظ and is associated with the meanings: awake"
    },

    {
        "indexid":2158,
        "wordid":12205,
        "word":"رُقُودٌ",
        "rootid":366,
        "rootword":"ر ق د",
        "meanings":"to sleep, lull, be dull, ragged, overlook. ruqud - sleeping. marqad - bed, sleeping place, grave.",
        "sentence":"The word رُقُودٌ comes from the root ر ق د and is associated with the meanings: to sleep, lull, be dull, ragged, overlook. ruqud - sleeping. marqad - bed, sleeping place, grave."
    },

    {
        "indexid":2158,
        "wordid":12206,
        "word":"وَنُقَلِّبُهُمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word وَنُقَلِّبُهُمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":2158,
        "wordid":12207,
        "word":"وَذَاتَ",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word وَذَاتَ comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":2158,
        "wordid":12208,
        "word":"وَكَلْبُهُمْ",
        "rootid":767,
        "rootword":"ك ل ب",
        "meanings":"To bark (for days). Kalbun: Dog; Any animal of prey.",
        "sentence":"The word وَكَلْبُهُمْ comes from the root ك ل ب and is associated with the meanings: To bark (for days). Kalbun: Dog; Any animal of prey."
    },

    {
        "indexid":2158,
        "wordid":12209,
        "word":"بَاسِطٌ",
        "rootid":368,
        "rootword":"ب س ط",
        "meanings":"Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)",
        "sentence":"The word بَاسِطٌ comes from the root ب س ط and is associated with the meanings: Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)"
    },

    {
        "indexid":2158,
        "wordid":12210,
        "word":"ذِرَاعَيْهِ",
        "rootid":1154,
        "rootword":"ذ ر ع",
        "meanings":"to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride.",
        "sentence":"The word ذِرَاعَيْهِ comes from the root ذ ر ع and is associated with the meanings: to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride."
    },

    {
        "indexid":2158,
        "wordid":12211,
        "word":"بِالْوَصِيدِ",
        "rootid":260,
        "rootword":"و ص د",
        "meanings":"to be fast, firm, remain in a place, build a store, enclosure, close (a door), stop, shut.",
        "sentence":"The word بِالْوَصِيدِ comes from the root و ص د and is associated with the meanings: to be fast, firm, remain in a place, build a store, enclosure, close (a door), stop, shut."
    },

    {
        "indexid":2158,
        "wordid":12212,
        "word":"اطَّلَعْتَ",
        "rootid":1517,
        "rootword":"ط ل ع",
        "meanings":"to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah).",
        "sentence":"The word اطَّلَعْتَ comes from the root ط ل ع and is associated with the meanings: to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah)."
    },

    {
        "indexid":2158,
        "wordid":12213,
        "word":"لَوَلَّيْتَ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word لَوَلَّيْتَ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":2158,
        "wordid":12214,
        "word":"فِرَارًا",
        "rootid":676,
        "rootword":"ف ر ر",
        "meanings":"to flee, run away\/off, escape, fleeing, flight, act of fleeing\/running away. mafarr - refuge, shift, place of refuge.",
        "sentence":"The word فِرَارًا comes from the root ف ر ر and is associated with the meanings: to flee, run away\/off, escape, fleeing, flight, act of fleeing\/running away. mafarr - refuge, shift, place of refuge."
    },

    {
        "indexid":2158,
        "wordid":12215,
        "word":"وَلَمُلِئْتَ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word وَلَمُلِئْتَ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":2158,
        "wordid":12216,
        "word":"رُعْبًا",
        "rootid":1052,
        "rootword":"ر ع ب",
        "meanings":"fear\/terror, frighten, tremble with fear, great awe.",
        "sentence":"The word رُعْبًا comes from the root ر ع ب and is associated with the meanings: fear\/terror, frighten, tremble with fear, great awe."
    }]}