{"data":[
    {
        "indexid":2198,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2198,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":2198,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":2198,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":2198,
        "wordid":2989,
        "word":"ذُو",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذُو comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":2198,
        "wordid":3423,
        "word":"الْعَذَابَ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابَ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":2198,
        "wordid":3755,
        "word":"كَسَبُوا",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word كَسَبُوا comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":2198,
        "wordid":6015,
        "word":"يَجِدُوا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word يَجِدُوا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":2198,
        "wordid":6318,
        "word":"دُونِهِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِهِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":2198,
        "wordid":6702,
        "word":"وَرَبُّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word وَرَبُّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2198,
        "wordid":7813,
        "word":"الرَّحْمَةِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَةِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2198,
        "wordid":10003,
        "word":"الْغَفُورُ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word الْغَفُورُ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":2198,
        "wordid":12408,
        "word":"يُؤَاخِذُهُمْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word يُؤَاخِذُهُمْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":2198,
        "wordid":12409,
        "word":"لَعَجَّلَ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word لَعَجَّلَ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":2198,
        "wordid":12410,
        "word":"مَوْعِدٌ",
        "rootid":732,
        "rootword":"و ع د",
        "meanings":"to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise.",
        "sentence":"The word مَوْعِدٌ comes from the root و ع د and is associated with the meanings: to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise."
    },

    {
        "indexid":2198,
        "wordid":12411,
        "word":"مَوْئِلًا",
        "rootid":1504,
        "rootword":"و ا ل",
        "meanings":"to seek refuge, find escape, seek shelter.",
        "sentence":"The word مَوْئِلًا comes from the root و ا ل and is associated with the meanings: to seek refuge, find escape, seek shelter."
    }]}