{"data":[
    {
        "indexid":2202,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2202,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2202,
        "wordid":3750,
        "word":"ءَاتِنَا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word ءَاتِنَا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":2202,
        "wordid":5377,
        "word":"لَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word لَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2202,
        "wordid":12414,
        "word":"لِفَتَاهُ",
        "rootid":1039,
        "rootword":"ف ت ي",
        "meanings":"to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation.",
        "sentence":"The word لِفَتَاهُ comes from the root ف ت ي and is associated with the meanings: to be young, full-grown, brave, generous, manly qualities, bold, courageous, fine fellow, gallant, young comrade, young slave, servant.afta - to advise, give an opinion\/instruction, decision, judgement or decision in a matter of law, give a formal legal decree, announce of inform a legal order, issue a (divine) decree or sacred law, explain the meaning, pronounce, furnish explanation."
    },

    {
        "indexid":2202,
        "wordid":12427,
        "word":"جَاوَزَا",
        "rootid":257,
        "rootword":"ج و ز",
        "meanings":"To pass in or pass along a place, leave it (a place) behind, pass through a place, traverse or cross, pass beyond a place, exceed or transgress the proper bound\/limit\/measure, excessive\/extravagant\/immoderate, allowable (pass as right or sound or valid or lawful), effect a judgement or opinion, give, clear away, relax or remit, overlook.",
        "sentence":"The word جَاوَزَا comes from the root ج و ز and is associated with the meanings: To pass in or pass along a place, leave it (a place) behind, pass through a place, traverse or cross, pass beyond a place, exceed or transgress the proper bound\/limit\/measure, excessive\/extravagant\/immoderate, allowable (pass as right or sound or valid or lawful), effect a judgement or opinion, give, clear away, relax or remit, overlook."
    },

    {
        "indexid":2202,
        "wordid":12428,
        "word":"غَدَاءَنَا",
        "rootid":1182,
        "rootword":"غ د و",
        "meanings":"early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day",
        "sentence":"The word غَدَاءَنَا comes from the root غ د و and is associated with the meanings: early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day"
    },

    {
        "indexid":2202,
        "wordid":12429,
        "word":"لَقِينَا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لَقِينَا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2202,
        "wordid":12430,
        "word":"سَفَرِنَا",
        "rootid":1465,
        "rootword":"س ف ر",
        "meanings":"to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write.",
        "sentence":"The word سَفَرِنَا comes from the root س ف ر and is associated with the meanings: to scribe, sweep, disperse, separate, depart, travel, set out on a journey, shine (dawn), subside, unveil, dispel (the clouds), write."
    },

    {
        "indexid":2202,
        "wordid":12431,
        "word":"نَصَبًا",
        "rootid":296,
        "rootword":"ن ص ب",
        "meanings":"to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant.",
        "sentence":"The word نَصَبًا comes from the root ن ص ب and is associated with the meanings: to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant."
    }]}