{"data":[
    {
        "indexid":2209,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2209,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2209,
        "wordid":2181,
        "word":"شَاءَ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَاءَ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2209,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2209,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2209,
        "wordid":3080,
        "word":"أَمْرًا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرًا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2209,
        "wordid":12451,
        "word":"سَتَجِدُنِي",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word سَتَجِدُنِي comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":2209,
        "wordid":12452,
        "word":"صَابِرًا",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word صَابِرًا comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":2209,
        "wordid":12453,
        "word":"أَعْصِي",
        "rootid":468,
        "rootword":"ع ص ي",
        "meanings":"to rebel, disobey, oppose, resist, transgress.",
        "sentence":"The word أَعْصِي comes from the root ع ص ي and is associated with the meanings: to rebel, disobey, oppose, resist, transgress."
    }]}