{"data":[
    {
        "indexid":2213,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2213,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2213,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2213,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2213,
        "wordid":12435,
        "word":"نَسِيتُ",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word نَسِيتُ comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    },

    {
        "indexid":2213,
        "wordid":12464,
        "word":"تُؤَاخِذْنِي",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word تُؤَاخِذْنِي comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":2213,
        "wordid":12465,
        "word":"تُرْهِقْنِي",
        "rootid":849,
        "rootword":"ر ه ق",
        "meanings":"to follow closely, cover, be foolish, lie, be mischievous, be ungodly, hasten, overtake, reach, draw near, overspread. rahaqa - to oppress, cause to suffer, be given to evil practices. rahqun - folly, oppression, evil disposition. arhaqa - to impose a difficult task, afflict with troubles and difficulties.",
        "sentence":"The word تُرْهِقْنِي comes from the root ر ه ق and is associated with the meanings: to follow closely, cover, be foolish, lie, be mischievous, be ungodly, hasten, overtake, reach, draw near, overspread. rahaqa - to oppress, cause to suffer, be given to evil practices. rahqun - folly, oppression, evil disposition. arhaqa - to impose a difficult task, afflict with troubles and difficulties."
    },

    {
        "indexid":2213,
        "wordid":12466,
        "word":"أَمْرِي",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرِي comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2213,
        "wordid":12467,
        "word":"عُسْرًا",
        "rootid":1611,
        "rootword":"ع س ر",
        "meanings":"to be difficult\/hard, be hard to one another, hardship.",
        "sentence":"The word عُسْرًا comes from the root ع س ر and is associated with the meanings: to be difficult\/hard, be hard to one another, hardship."
    }]}