{"data":[
    {
        "indexid":2243,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2243,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":2243,
        "wordid":12583,
        "word":"نُنَبِّئُكُمْ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word نُنَبِّئُكُمْ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":2243,
        "wordid":12584,
        "word":"بِالْأَخْسَرِينَ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word بِالْأَخْسَرِينَ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    },

    {
        "indexid":2243,
        "wordid":12585,
        "word":"أَعْمَالًا",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالًا comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    }]}