{"data":[
    {
        "indexid":2263,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2263,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2263,
        "wordid":6031,
        "word":"لَدُنَّا",
        "rootid":1731,
        "rootword":"ل د ن",
        "meanings":"At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same.",
        "sentence":"The word لَدُنَّا comes from the root ل د ن and is associated with the meanings: At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same."
    },

    {
        "indexid":2263,
        "wordid":12646,
        "word":"وَحَنَانًا",
        "rootid":986,
        "rootword":"ح ن ن",
        "meanings":"To have a longing desire for, emit a sound as a she-camel towards her young, be moved with pity, yearn towards, incline towards.",
        "sentence":"The word وَحَنَانًا comes from the root ح ن ن and is associated with the meanings: To have a longing desire for, emit a sound as a she-camel towards her young, be moved with pity, yearn towards, incline towards."
    },

    {
        "indexid":2263,
        "wordid":12647,
        "word":"وَزَكَوةً",
        "rootid":467,
        "rootword":"ز ك و",
        "meanings":"it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due",
        "sentence":"The word وَزَكَوةً comes from the root ز ك و and is associated with the meanings: it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due"
    },

    {
        "indexid":2263,
        "wordid":12648,
        "word":"تَقِيًّا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word تَقِيًّا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    }]}