{"data":[
    {
        "indexid":2272,
        "wordid":6918,
        "word":"مَكَانًا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانًا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2272,
        "wordid":12669,
        "word":"فَحَمَلَتْهُ",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word فَحَمَلَتْهُ comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":2272,
        "wordid":12670,
        "word":"فَانْتَبَذَتْ",
        "rootid":225,
        "rootword":"ن ب ذ",
        "meanings":"(Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account.",
        "sentence":"The word فَانْتَبَذَتْ comes from the root ن ب ذ and is associated with the meanings: (Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account."
    },

    {
        "indexid":2272,
        "wordid":12671,
        "word":"قَصِيًّا",
        "rootid":439,
        "rootword":"ق ص و",
        "meanings":"distant\/remote, far, go far away. quswa - more remote, further.",
        "sentence":"The word قَصِيًّا comes from the root ق ص و and is associated with the meanings: distant\/remote, far, go far away. quswa - more remote, further."
    }]}