{"data":[
    {
        "indexid":2273,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2273,
        "wordid":4730,
        "word":"قَالَتْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2273,
        "wordid":6053,
        "word":"يَالَيْتَنِي",
        "rootid":696,
        "rootword":"ل ي ت",
        "meanings":"To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo.",
        "sentence":"The word يَالَيْتَنِي comes from the root ل ي ت and is associated with the meanings: To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo."
    },

    {
        "indexid":2273,
        "wordid":6477,
        "word":"قَبْلَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":2273,
        "wordid":7189,
        "word":"وَكُنْتُ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكُنْتُ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2273,
        "wordid":12672,
        "word":"فَأَجَاءَهَا",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word فَأَجَاءَهَا comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":2273,
        "wordid":12673,
        "word":"الْمَخَاضُ",
        "rootid":1017,
        "rootword":"م خ ض",
        "meanings":"To churn\/beat\/agitate (milk), extract or fetch out the butter from milk, shake or agitate vehemently, turn over or revolve a thing.",
        "sentence":"The word الْمَخَاضُ comes from the root م خ ض and is associated with the meanings: To churn\/beat\/agitate (milk), extract or fetch out the butter from milk, shake or agitate vehemently, turn over or revolve a thing."
    },

    {
        "indexid":2273,
        "wordid":12674,
        "word":"جِذْعِ",
        "rootid":1061,
        "rootword":"ج ذ ع",
        "meanings":"",
        "sentence":"The word جِذْعِ comes from the root ج ذ ع and is associated with the meanings: "
    },

    {
        "indexid":2273,
        "wordid":12675,
        "word":"النَّخْلَةِ",
        "rootid":1547,
        "rootword":"ن خ ل",
        "meanings":"to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice.",
        "sentence":"The word النَّخْلَةِ comes from the root ن خ ل and is associated with the meanings: to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice."
    },

    {
        "indexid":2273,
        "wordid":12676,
        "word":"مِتُّ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word مِتُّ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":2273,
        "wordid":12677,
        "word":"نَسْيًا",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word نَسْيًا comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    },

    {
        "indexid":2273,
        "wordid":12678,
        "word":"مَنْسِيًّا",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word مَنْسِيًّا comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    }]}