{"data":[
    {
        "indexid":2274,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2274,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2274,
        "wordid":2243,
        "word":"تَحْتِهَا",
        "rootid":1266,
        "rootword":"ت ح ت",
        "meanings":"(taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran.",
        "sentence":"The word تَحْتِهَا comes from the root ت ح ت and is associated with the meanings: (taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran."
    },

    {
        "indexid":2274,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2274,
        "wordid":12666,
        "word":"رَبُّكِ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّكِ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2274,
        "wordid":12680,
        "word":"تَحْزَنِي",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word تَحْزَنِي comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":2274,
        "wordid":12681,
        "word":"تَحْتَكِ",
        "rootid":1266,
        "rootword":"ت ح ت",
        "meanings":"(taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran.",
        "sentence":"The word تَحْتَكِ comes from the root ت ح ت and is associated with the meanings: (taht) Particle: that which is below; the lower part;. beneath; inferior, slop; declivity of a mountain; under. It. is the opposite of fawq\/above.This particle has been used. about 51 times in al quran."
    }]}