{"data":[
    {
        "indexid":2276,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2276,
        "wordid":2574,
        "word":"عَيْنًا",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عَيْنًا comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":2276,
        "wordid":2767,
        "word":"فَلَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word فَلَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":2276,
        "wordid":4176,
        "word":"الْيَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word الْيَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2276,
        "wordid":4725,
        "word":"نَذَرْتُ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word نَذَرْتُ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":2276,
        "wordid":6685,
        "word":"أَحَدًا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word أَحَدًا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":2276,
        "wordid":12690,
        "word":"فَكُلِي",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word فَكُلِي comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":2276,
        "wordid":12691,
        "word":"وَاشْرَبِي",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word وَاشْرَبِي comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":2276,
        "wordid":12692,
        "word":"وَقَرِّي",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word وَقَرِّي comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":2276,
        "wordid":12693,
        "word":"تَرَيِنَّ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word تَرَيِنَّ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":2276,
        "wordid":12694,
        "word":"الْبَشَرِ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word الْبَشَرِ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    },

    {
        "indexid":2276,
        "wordid":12695,
        "word":"فَقُولِي",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقُولِي comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2276,
        "wordid":12696,
        "word":"لِلرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word لِلرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2276,
        "wordid":12697,
        "word":"صَوْمًا",
        "rootid":792,
        "rootword":"ص و م",
        "meanings":"to fast\/abstain.",
        "sentence":"The word صَوْمًا comes from the root ص و م and is associated with the meanings: to fast\/abstain."
    },

    {
        "indexid":2276,
        "wordid":12698,
        "word":"أُكَلِّمَ",
        "rootid":1478,
        "rootword":"ك ل م",
        "meanings":"To speak, express.",
        "sentence":"The word أُكَلِّمَ comes from the root ك ل م and is associated with the meanings: To speak, express."
    },

    {
        "indexid":2276,
        "wordid":12699,
        "word":"إِنْسِيًّا",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word إِنْسِيًّا comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    }]}