{"data":[
    {
        "indexid":2290,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":2290,
        "wordid":2197,
        "word":"الْأَرْضَ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضَ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2290,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2290,
        "wordid":4997,
        "word":"يُرْجَعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word يُرْجَعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":2290,
        "wordid":12735,
        "word":"نَرِثُ",
        "rootid":452,
        "rootword":"و ر ث",
        "meanings":"to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed.",
        "sentence":"The word نَرِثُ comes from the root و ر ث and is associated with the meanings: to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed."
    },

    {
        "indexid":2290,
        "wordid":12736,
        "word":"وَإِلَيْنَا",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَيْنَا comes from the root ا ل ي and is associated with the meanings: "
    }]}