{"data":[
    {
        "indexid":2296,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":2296,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2296,
        "wordid":2338,
        "word":"أَنْتَ",
        "rootid":1639,
        "rootword":"ا ن ت",
        "meanings":"you (singular)",
        "sentence":"The word أَنْتَ comes from the root ا ن ت and is associated with the meanings: you (singular)"
    },

    {
        "indexid":2296,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2296,
        "wordid":12747,
        "word":"أَرَاغِبٌ",
        "rootid":164,
        "rootword":"ر غ ب",
        "meanings":"to desire, long for, wish, he made it wide\/ample. With 'an - to show aversion to, dislike, have no desire. With ba and 'an (9:120) - to have preferred their own lives to his life. With ila - to supplicate. raghbun - love, longing. raghibun - one who supplicates earnestly.",
        "sentence":"The word أَرَاغِبٌ comes from the root ر غ ب and is associated with the meanings: to desire, long for, wish, he made it wide\/ample. With 'an - to show aversion to, dislike, have no desire. With ba and 'an (9:120) - to have preferred their own lives to his life. With ila - to supplicate. raghbun - love, longing. raghibun - one who supplicates earnestly."
    },

    {
        "indexid":2296,
        "wordid":12748,
        "word":"ءَالِهَتِي",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word ءَالِهَتِي comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2296,
        "wordid":12749,
        "word":"تَنْتَهِ",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word تَنْتَهِ comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":2296,
        "wordid":12750,
        "word":"لَأَرْجُمَنَّكَ",
        "rootid":1542,
        "rootword":"ر ج م",
        "meanings":"to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned.",
        "sentence":"The word لَأَرْجُمَنَّكَ comes from the root ر ج م and is associated with the meanings: to stone, cast stones, stone to death, curse, revile, expel, put a stone (on a tomb), speak conjecturally, guess, surmise. rajmun - conjecture, guesswork, missile. rujum - shooting stars, throw off, damned, thrown off with curse. marajim - foul speech. marjum - stoned."
    },

    {
        "indexid":2296,
        "wordid":12751,
        "word":"وَاهْجُرْنِي",
        "rootid":807,
        "rootword":"ه ج ر",
        "meanings":"to leave\/abandon\/desert\/forsake\/depart\/renounce\/quit, separate oneself from, break with, abstain from, shun, leave with body or tongue or heart, leave lust and bad manners. hijr - bad manner, shameful action, nonsense talk.",
        "sentence":"The word وَاهْجُرْنِي comes from the root ه ج ر and is associated with the meanings: to leave\/abandon\/desert\/forsake\/depart\/renounce\/quit, separate oneself from, break with, abstain from, shun, leave with body or tongue or heart, leave lust and bad manners. hijr - bad manner, shameful action, nonsense talk."
    },

    {
        "indexid":2296,
        "wordid":12752,
        "word":"مَلِيًّا",
        "rootid":637,
        "rootword":"م ل و",
        "meanings":"To live long, enjoy a thing.",
        "sentence":"The word مَلِيًّا comes from the root م ل و and is associated with the meanings: To live long, enjoy a thing."
    }]}