{"data":[
    {
        "indexid":2299,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2299,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2299,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2299,
        "wordid":2224,
        "word":"دُونِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":2299,
        "wordid":3130,
        "word":"جَعَلْنَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلْنَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2299,
        "wordid":6216,
        "word":"وَكُلًّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلًّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2299,
        "wordid":7559,
        "word":"إِسْحَاقَ",
        "rootid":974,
        "rootword":"س ح ق",
        "meanings":"to be distant, far removed (from good), sahiq - far off place, distant and remote place, deep place. sahaqa - to pound\/crush, sweep (the earth), wind, wear out, destroy. suhqan - be far away, be cursed. Ishaq - Abraham's son.",
        "sentence":"The word إِسْحَاقَ comes from the root س ح ق and is associated with the meanings: to be distant, far removed (from good), sahiq - far off place, distant and remote place, deep place. sahaqa - to pound\/crush, sweep (the earth), wind, wear out, destroy. suhqan - be far away, be cursed. Ishaq - Abraham's son."
    },

    {
        "indexid":2299,
        "wordid":10383,
        "word":"يَعْبُدُونَ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word يَعْبُدُونَ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":2299,
        "wordid":12714,
        "word":"نَبِيًّا",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word نَبِيًّا comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":2299,
        "wordid":12758,
        "word":"اعْتَزَلَهُمْ",
        "rootid":501,
        "rootword":"ع ز ل",
        "meanings":"to set aside, remove from. ma'zilun - a place separate from the rest, secluded spot, place of retirement, far away. ma'zulun - removed. i'tizal (vb. 8) to separate or remove one self from.. . 'Azalta (prt. 2nd. m. sing.): Thou put aside (in the matter) provisionally.. I'tazala (prf. 3rd. m. sing. VIII): He withdrew, kept away.. I'tazalaa (prf. 3rd. m. plu.): They kept away, left you alone.. I'tazaltumuu (prf.2nd p. m. plu. juss.): You have left (them).. Ya'taziluu (imp. 3rd. m. plu. final Nun dropped): They withdraw, leave (you) alone.. A'tazilu (imp. 1st. sing. VIII): I shall withdraw, shall keep away.. I'taziluu (prt. n. plu.): You keep away.. I'taziluuni (comp. I'tazilu + nii prt. m. plu.): Keep away from me.. Ma'zuuluuna (pct. pic. n. plu.): Removed ones; Precluded ones.. Ma`zilun (n. of place): Place where one is set aloof.",
        "sentence":"The word اعْتَزَلَهُمْ comes from the root ع ز ل and is associated with the meanings: to set aside, remove from. ma'zilun - a place separate from the rest, secluded spot, place of retirement, far away. ma'zulun - removed. i'tizal (vb. 8) to separate or remove one self from.. . 'Azalta (prt. 2nd. m. sing.): Thou put aside (in the matter) provisionally.. I'tazala (prf. 3rd. m. sing. VIII): He withdrew, kept away.. I'tazalaa (prf. 3rd. m. plu.): They kept away, left you alone.. I'tazaltumuu (prf.2nd p. m. plu. juss.): You have left (them).. Ya'taziluu (imp. 3rd. m. plu. final Nun dropped): They withdraw, leave (you) alone.. A'tazilu (imp. 1st. sing. VIII): I shall withdraw, shall keep away.. I'taziluu (prt. n. plu.): You keep away.. I'taziluuni (comp. I'tazilu + nii prt. m. plu.): Keep away from me.. Ma'zuuluuna (pct. pic. n. plu.): Removed ones; Precluded ones.. Ma`zilun (n. of place): Place where one is set aloof."
    },

    {
        "indexid":2299,
        "wordid":12759,
        "word":"وَهَبْنَا",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word وَهَبْنَا comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    }]}