{"data":[
    {
        "indexid":2319,
        "wordid":2002,
        "word":"الرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2319,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2319,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2319,
        "wordid":2711,
        "word":"أَشَدُّ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word أَشَدُّ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":2319,
        "wordid":4797,
        "word":"أَيُّهُمْ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word أَيُّهُمْ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":2319,
        "wordid":12634,
        "word":"عِتِيًّا",
        "rootid":528,
        "rootword":"ع ت و",
        "meanings":"to drag, push violently, draw along, pull, carry anyone away forcibly. atiya - to be quick to do evil. utuyyun - prone\/quick to do evil, wicked, rough, glutton, rude, hard-hearted ruffian, cruel, greedy, violent, ignoble, ill-mannered. atiyatin - blowing with extraordinary force.",
        "sentence":"The word عِتِيًّا comes from the root ع ت و and is associated with the meanings: to drag, push violently, draw along, pull, carry anyone away forcibly. atiya - to be quick to do evil. utuyyun - prone\/quick to do evil, wicked, rough, glutton, rude, hard-hearted ruffian, cruel, greedy, violent, ignoble, ill-mannered. atiyatin - blowing with extraordinary force."
    },

    {
        "indexid":2319,
        "wordid":12802,
        "word":"لَنَنْزِعَنَّ",
        "rootid":817,
        "rootword":"ن ز ع",
        "meanings":"to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive.",
        "sentence":"The word لَنَنْزِعَنَّ comes from the root ن ز ع and is associated with the meanings: to draw forth, take away, pluck out, bring out, snatch away, remove, strip off, tear off, extract, withdraw, draw out sharply, perform ones duty, yearn, depose high officials, resemble, draw with vigour, invite others to truth, rise, ascend, draw from the abode or bottom, carry off forcibly, deprive."
    },

    {
        "indexid":2319,
        "wordid":12803,
        "word":"شِيعَةٍ",
        "rootid":698,
        "rootword":"ش ي ع",
        "meanings":"become spread\/published\/known\/revealed\/apparent, scattered\/dispersed, conforming\/agreeing with another, befriend\/friendly, went along together, like\/similar, follower\/assistant\/friend\/comrade\/sharer\/partner, separate\/distinct party\/sect, way of doctrine\/system\/practice.",
        "sentence":"The word شِيعَةٍ comes from the root ش ي ع and is associated with the meanings: become spread\/published\/known\/revealed\/apparent, scattered\/dispersed, conforming\/agreeing with another, befriend\/friendly, went along together, like\/similar, follower\/assistant\/friend\/comrade\/sharer\/partner, separate\/distinct party\/sect, way of doctrine\/system\/practice."
    }]}