{"data":[
    {
        "indexid":2320,
        "wordid":2322,
        "word":"أَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word أَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2320,
        "wordid":4921,
        "word":"أَوْلَى",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word أَوْلَى comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":2320,
        "wordid":11331,
        "word":"لَنَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word لَنَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":2320,
        "wordid":12804,
        "word":"صِلِيًّا",
        "rootid":380,
        "rootword":"ص ل ي",
        "meanings":"to warm at the fire, endure heat, to roast\/fry\/broil\/burn.",
        "sentence":"The word صِلِيًّا comes from the root ص ل ي and is associated with the meanings: to warm at the fire, endure heat, to roast\/fry\/broil\/burn."
    }]}