{"data":[
    {
        "indexid":233,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":233,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":233,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":233,
        "wordid":3282,
        "word":"رَحِيمٌ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمٌ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":233,
        "wordid":3475,
        "word":"غَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":233,
        "wordid":3942,
        "word":"نِسَائِهِمْ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word نِسَائِهِمْ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":233,
        "wordid":3943,
        "word":"تَرَبُّصُ",
        "rootid":1224,
        "rootword":"ر ب ص",
        "meanings":"to wait, lay in wait, stick, watch for an opportunity, an expectation, desist from (with 'an), watch for something, befall anyone, one who waits, one who withholds, or collects and withholds (e.g. wheat or the like, waiting for a time of dearness).",
        "sentence":"The word تَرَبُّصُ comes from the root ر ب ص and is associated with the meanings: to wait, lay in wait, stick, watch for an opportunity, an expectation, desist from (with 'an), watch for something, befall anyone, one who waits, one who withholds, or collects and withholds (e.g. wheat or the like, waiting for a time of dearness)."
    },

    {
        "indexid":233,
        "wordid":3944,
        "word":"أَرْبَعَةِ",
        "rootid":1796,
        "rootword":"ر ب ع",
        "meanings":"four, fourth, quarter, forty",
        "sentence":"The word أَرْبَعَةِ comes from the root ر ب ع and is associated with the meanings: four, fourth, quarter, forty"
    },

    {
        "indexid":233,
        "wordid":3945,
        "word":"أَشْهُرٍ",
        "rootid":1257,
        "rootword":"ش ه ر",
        "meanings":"make it notable\/known\/manifest\/public\/infamous (in a bad or good sense), hire\/contract for a month, stay a month, month old, month, new moon, moon, full moon, any evil thing that exposes its author to disgrace, a vice\/fault or the like, big & bulky, reputable\/eminent.",
        "sentence":"The word أَشْهُرٍ comes from the root ش ه ر and is associated with the meanings: make it notable\/known\/manifest\/public\/infamous (in a bad or good sense), hire\/contract for a month, stay a month, month old, month, new moon, moon, full moon, any evil thing that exposes its author to disgrace, a vice\/fault or the like, big & bulky, reputable\/eminent."
    },

    {
        "indexid":233,
        "wordid":3946,
        "word":"فَاءُو",
        "rootid":495,
        "rootword":"ف ي ا",
        "meanings":"to return, go back, go from (a vow), bring under the authority, change its place, shift, turn (shadow). fai - shade, gain of war, prisoner of war.",
        "sentence":"The word فَاءُو comes from the root ف ي ا and is associated with the meanings: to return, go back, go from (a vow), bring under the authority, change its place, shift, turn (shadow). fai - shade, gain of war, prisoner of war."
    }]}