{"data":[
    {
        "indexid":2366,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2366,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2366,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":2366,
        "wordid":6255,
        "word":"أُخْرَى",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word أُخْرَى comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":2366,
        "wordid":12904,
        "word":"عَصَايَ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word عَصَايَ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":2366,
        "wordid":12905,
        "word":"أَتَوَكَّؤُا",
        "rootid":1201,
        "rootword":"و ك ا",
        "meanings":"to recline.",
        "sentence":"The word أَتَوَكَّؤُا comes from the root و ك ا and is associated with the meanings: to recline."
    },

    {
        "indexid":2366,
        "wordid":12906,
        "word":"وَأَهُشُّ",
        "rootid":212,
        "rootword":"ه ش ش",
        "meanings":"to beat down the leaves of a tree.",
        "sentence":"The word وَأَهُشُّ comes from the root ه ش ش and is associated with the meanings: to beat down the leaves of a tree."
    },

    {
        "indexid":2366,
        "wordid":12907,
        "word":"غَنَمِي",
        "rootid":1461,
        "rootword":"غ ن م",
        "meanings":"obtained, got, took (usually in reference to spoils or booties); acquisition without difficulties, regaining, sheep or goats collected together",
        "sentence":"The word غَنَمِي comes from the root غ ن م and is associated with the meanings: obtained, got, took (usually in reference to spoils or booties); acquisition without difficulties, regaining, sheep or goats collected together"
    },

    {
        "indexid":2366,
        "wordid":12909,
        "word":"مَءَارِبُ",
        "rootid":660,
        "rootword":"ا ر ب",
        "meanings":"He was, or became, cunning, characterized by intelligence with craft and forecast, or simply intelligent, excellent in judgment, sagacious, and knowing in affairs; He became excellent, or skilful, in the thing, or he became accustomed to, practised or exercised in, the thing, and became knowing, or skilful (therein); He devoted, or addicted himself, or cleaved or kept to a thing; he was, or became, niggardly, avaricious, or tenacious, of a thing. His member or limb (generally meaning the arm or hand) was cut off or dropped off; his members or limbs (generally relating to the members or fingers) of the arm or hand dropped off one after the other in consequence of a certain disease (usually termed jeem-dhal-alif-meem); A member, a distinct part of the animal body, a limb; expert skillful",
        "sentence":"The word مَءَارِبُ comes from the root ا ر ب and is associated with the meanings: He was, or became, cunning, characterized by intelligence with craft and forecast, or simply intelligent, excellent in judgment, sagacious, and knowing in affairs; He became excellent, or skilful, in the thing, or he became accustomed to, practised or exercised in, the thing, and became knowing, or skilful (therein); He devoted, or addicted himself, or cleaved or kept to a thing; he was, or became, niggardly, avaricious, or tenacious, of a thing. His member or limb (generally meaning the arm or hand) was cut off or dropped off; his members or limbs (generally relating to the members or fingers) of the arm or hand dropped off one after the other in consequence of a certain disease (usually termed jeem-dhal-alif-meem); A member, a distinct part of the animal body, a limb; expert skillful"
    }]}