{"data":[
    {
        "indexid":2375,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2375,
        "wordid":12927,
        "word":"وَاحْلُلْ",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word وَاحْلُلْ comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":2375,
        "wordid":12928,
        "word":"عُقْدَةً",
        "rootid":104,
        "rootword":"ع ق د",
        "meanings":"to tie in a knot, make a knot, strike a bargain, contract, make a compact, enter into an obligation, bind, judgement, consideration of one's affairs, management, promise of obedience or vow of allegiance.. . 'aqadat (prf. 3rd. f. sing.): she made a covenant, ratified agreements.. 'aqadtum (prf. 2nd. m. pl.): We bound, took in earnest.. 'uquud (n. pl.): obligation. Its sing. is 'aqdun \/ 'uqdatun (n.): knot, tie, firm resolution, judgement, consideration of one's affairs, management regulating and ordering of one's affairs. It also signifies a promise of obedience or vow of allegiance.",
        "sentence":"The word عُقْدَةً comes from the root ع ق د and is associated with the meanings: to tie in a knot, make a knot, strike a bargain, contract, make a compact, enter into an obligation, bind, judgement, consideration of one's affairs, management, promise of obedience or vow of allegiance.. . 'aqadat (prf. 3rd. f. sing.): she made a covenant, ratified agreements.. 'aqadtum (prf. 2nd. m. pl.): We bound, took in earnest.. 'uquud (n. pl.): obligation. Its sing. is 'aqdun \/ 'uqdatun (n.): knot, tie, firm resolution, judgement, consideration of one's affairs, management regulating and ordering of one's affairs. It also signifies a promise of obedience or vow of allegiance."
    },

    {
        "indexid":2375,
        "wordid":12929,
        "word":"لِسَانِي",
        "rootid":227,
        "rootword":"ل س ن",
        "meanings":"a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech.",
        "sentence":"The word لِسَانِي comes from the root ل س ن and is associated with the meanings: a tongue\/speech\/language, to seize one by the tongue, bite one in words, make a thing sharp pointed, eloquent speech."
    }]}