{"data":[
    {
        "indexid":2377,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2377,
        "wordid":6072,
        "word":"وَاجْعَلْ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَاجْعَلْ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2377,
        "wordid":10162,
        "word":"أَهْلِي",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلِي comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":2377,
        "wordid":12932,
        "word":"وَزِيرًا",
        "rootid":1184,
        "rootword":"و ز ر",
        "meanings":"to carry a burden, bear a load, perpetrate (a crime)",
        "sentence":"The word وَزِيرًا comes from the root و ز ر and is associated with the meanings: to carry a burden, bear a load, perpetrate (a crime)"
    }]}