{"data":[
    {
        "indexid":2385,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2385,
        "wordid":6255,
        "word":"أُخْرَى",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word أُخْرَى comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":2385,
        "wordid":9466,
        "word":"مَرَّةً",
        "rootid":1074,
        "rootword":"م ر ر",
        "meanings":"To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile.",
        "sentence":"The word مَرَّةً comes from the root م ر ر and is associated with the meanings: To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile."
    },

    {
        "indexid":2385,
        "wordid":12941,
        "word":"مَنَنَّا",
        "rootid":875,
        "rootword":"م ن ن",
        "meanings":"To confer or bestow a benefit or favour to someone, to be bountiful or beneficent or gratuitous, to be reasonable (too reasonable to do that which is deemed bad), min often means some of or among, min can be used in the sense of fi meaning  in or on.",
        "sentence":"The word مَنَنَّا comes from the root م ن ن and is associated with the meanings: To confer or bestow a benefit or favour to someone, to be bountiful or beneficent or gratuitous, to be reasonable (too reasonable to do that which is deemed bad), min often means some of or among, min can be used in the sense of fi meaning  in or on."
    }]}