{"data":[
    {
        "indexid":2408,
        "wordid":8300,
        "word":"فَتَوَلَّى",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word فَتَوَلَّى comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":2408,
        "wordid":8436,
        "word":"فِرْعَوْنُ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنُ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":2408,
        "wordid":11448,
        "word":"أَتَى",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word أَتَى comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":2408,
        "wordid":13011,
        "word":"فَجَمَعَ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word فَجَمَعَ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":2408,
        "wordid":13012,
        "word":"كَيْدَهُ",
        "rootid":1295,
        "rootword":"ك ي د",
        "meanings":"(Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish.",
        "sentence":"The word كَيْدَهُ comes from the root ك ي د and is associated with the meanings: (Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish."
    }]}