{"data":[
    {
        "indexid":2414,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2414,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2414,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2414,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":2414,
        "wordid":8417,
        "word":"أَلْقُوا",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word أَلْقُوا comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2414,
        "wordid":12900,
        "word":"تَسْعَى",
        "rootid":1050,
        "rootword":"س ع ي",
        "meanings":"he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child).",
        "sentence":"The word تَسْعَى comes from the root س ع ي and is associated with the meanings: he walked or went along, to strive\/exert\/labour\/work, go quickly, effort, endeavour, hasten\/act\/run, be active, diligent, age of running or work and assist (child)."
    },

    {
        "indexid":2414,
        "wordid":13031,
        "word":"حِبَالُهُمْ",
        "rootid":983,
        "rootword":"ح ب ل",
        "meanings":"tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians).",
        "sentence":"The word حِبَالُهُمْ comes from the root ح ب ل and is associated with the meanings: tie\/fasten with rope, rope\/cord, covenant, a thing by means of which one snares\/catches\/snares, obtaining an assurance\/promise of safety, snare, to entrap, to captivate, being pregnant\/full, bond, cause of union, link of connexion, marriage, carotid artery, jugular vein, calamity\/misfortune, a foetus in the womb, grapevine, one who binds, crisped\/plaited\/rope-like hair (e.g. that of Ethiopians)."
    },

    {
        "indexid":2414,
        "wordid":13032,
        "word":"وَعِصِيُّهُمْ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word وَعِصِيُّهُمْ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":2414,
        "wordid":13033,
        "word":"يُخَيَّلُ",
        "rootid":656,
        "rootword":"خ ي ل",
        "meanings":"To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse).",
        "sentence":"The word يُخَيَّلُ comes from the root خ ي ل and is associated with the meanings: To think or have an opinion of a thing, surmise or fancy a thing, limp or halt, slightly lame, image a thing (form an image) in the mind, perceive or discover, convey doubt or suspicion, to be cowardly or weak-hearted on the occassion of a fight [and thus do not act\/proceed firmly or steadily], hold back from people or a party through cowardice, vie with\/rival\/imitate someone (do as he does) in pride and self-conceit, dubious\/confused\/vague, become abundant in plants or herbage (land), go on or away, act with a penetrative energy (being quick), behave proudly or haughtily, walk with pride or self-conceit, weak in heart and body, free from an attachment of love (having no spouse)."
    },

    {
        "indexid":2414,
        "wordid":13034,
        "word":"سِحْرِهِمْ",
        "rootid":1083,
        "rootword":"س ح ر",
        "meanings":"To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding.",
        "sentence":"The word سِحْرِهِمْ comes from the root س ح ر and is associated with the meanings: To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding."
    }]}