{"data":[
    {
        "indexid":2447,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2447,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2447,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2447,
        "wordid":2727,
        "word":"وَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":2447,
        "wordid":3748,
        "word":"ذِكْرًا",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرًا comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2447,
        "wordid":4791,
        "word":"أَنْبَاءِ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word أَنْبَاءِ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":2447,
        "wordid":6031,
        "word":"لَدُنَّا",
        "rootid":1731,
        "rootword":"ل د ن",
        "meanings":"At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same.",
        "sentence":"The word لَدُنَّا comes from the root ل د ن and is associated with the meanings: At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same."
    },

    {
        "indexid":2447,
        "wordid":8376,
        "word":"نَقُصُّ",
        "rootid":1708,
        "rootword":"ق ص ص",
        "meanings":"",
        "sentence":"The word نَقُصُّ comes from the root ق ص ص and is associated with the meanings: "
    },

    {
        "indexid":2447,
        "wordid":9081,
        "word":"سَبَقَ",
        "rootid":882,
        "rootword":"س ب ق",
        "meanings":"to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race.",
        "sentence":"The word سَبَقَ comes from the root س ب ق and is associated with the meanings: to be in advance, go\/pass before, surpass, get the better of, get in advance, precede, overtake, come first to the goal, outstrip, overcome, go forth previously, escape, go speedily, go first, race\/strive\/excel, prevent, the act of advancing. One who precedes or outstrips in race, foremost.masbuq - one who is surpassed or beaten or is out run in a race."
    },

    {
        "indexid":2447,
        "wordid":11421,
        "word":"ءَاتَيْنَاكَ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word ءَاتَيْنَاكَ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    }]}