{"data":[
    {
        "indexid":2453,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2453,
        "wordid":3885,
        "word":"وَيَسْءَلُونَكَ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word وَيَسْءَلُونَكَ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":2453,
        "wordid":4646,
        "word":"فَقُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2453,
        "wordid":4839,
        "word":"رَبِّي",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّي comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2453,
        "wordid":11414,
        "word":"الْجِبَالِ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word الْجِبَالِ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":2453,
        "wordid":13139,
        "word":"نَسْفًا",
        "rootid":1628,
        "rootword":"ن س ف",
        "meanings":"to uproot, reduce to powder, scatter, throw down, destroy, shatter, smash, blown down to pieces.",
        "sentence":"The word نَسْفًا comes from the root ن س ف and is associated with the meanings: to uproot, reduce to powder, scatter, throw down, destroy, shatter, smash, blown down to pieces."
    },

    {
        "indexid":2453,
        "wordid":13150,
        "word":"يَنْسِفُهَا",
        "rootid":1628,
        "rootword":"ن س ف",
        "meanings":"to uproot, reduce to powder, scatter, throw down, destroy, shatter, smash, blown down to pieces.",
        "sentence":"The word يَنْسِفُهَا comes from the root ن س ف and is associated with the meanings: to uproot, reduce to powder, scatter, throw down, destroy, shatter, smash, blown down to pieces."
    }]}