{"data":[
    {
        "indexid":2464,
        "wordid":2309,
        "word":"لِلْمَلَائِكَةِ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word لِلْمَلَائِكَةِ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":2464,
        "wordid":2353,
        "word":"قُلْنَا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْنَا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2464,
        "wordid":2354,
        "word":"اسْجُدُوا",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word اسْجُدُوا comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":2464,
        "wordid":2356,
        "word":"فَسَجَدُوا",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word فَسَجَدُوا comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":2464,
        "wordid":2357,
        "word":"إِبْلِيسَ",
        "rootid":94,
        "rootword":"ب ل س",
        "meanings":"despair, give up hope, become broken (in spirit), mournful, become silent\/confounded\/perplexed unable to see right way or course, repent\/grieve.",
        "sentence":"The word إِبْلِيسَ comes from the root ب ل س and is associated with the meanings: despair, give up hope, become broken (in spirit), mournful, become silent\/confounded\/perplexed unable to see right way or course, repent\/grieve."
    },

    {
        "indexid":2464,
        "wordid":2358,
        "word":"أَبَى",
        "rootid":1575,
        "rootword":"ا ب ي",
        "meanings":"refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant.",
        "sentence":"The word أَبَى comes from the root ا ب ي and is associated with the meanings: refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant."
    }]}