{"data":[
    {
        "indexid":2466,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2466,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2466,
        "wordid":13183,
        "word":"تَجُوعَ",
        "rootid":1348,
        "rootword":"ج و ع",
        "meanings":"To be hungry, empty in the belly, hunger or long for a thing, to desire and long (as though hungering) for a thing.",
        "sentence":"The word تَجُوعَ comes from the root ج و ع and is associated with the meanings: To be hungry, empty in the belly, hunger or long for a thing, to desire and long (as though hungering) for a thing."
    },

    {
        "indexid":2466,
        "wordid":13184,
        "word":"تَعْرَى",
        "rootid":1769,
        "rootword":"ع ر ي",
        "meanings":"to become naked, denude of (garments). ara - bare desert or place, open field, waste land, shore.",
        "sentence":"The word تَعْرَى comes from the root ع ر ي and is associated with the meanings: to become naked, denude of (garments). ara - bare desert or place, open field, waste land, shore."
    }]}