{"data":[
    {
        "indexid":2467,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2467,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":2467,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2467,
        "wordid":13186,
        "word":"تَظْمَؤُا",
        "rootid":646,
        "rootword":"ظ م ا",
        "meanings":"to be thirsty, desire a thing, alter a thing (heat), jade.",
        "sentence":"The word تَظْمَؤُا comes from the root ظ م ا and is associated with the meanings: to be thirsty, desire a thing, alter a thing (heat), jade."
    },

    {
        "indexid":2467,
        "wordid":13187,
        "word":"تَضْحَى",
        "rootid":117,
        "rootword":"ض ح و",
        "meanings":"to be smitten by sunbeams, suffer from the heat of the sun, become uncovered, be revealed, appear conspicuously.Can also means those hours of the morning which follow shortly after sunrise, full brightness of the sun, sunshine, part of the forenoon when the sun is already high, bright part pf the day when the sun shines fully, early afternoon, high noon, daytime\/daylight.",
        "sentence":"The word تَضْحَى comes from the root ض ح و and is associated with the meanings: to be smitten by sunbeams, suffer from the heat of the sun, become uncovered, be revealed, appear conspicuously.Can also means those hours of the morning which follow shortly after sunrise, full brightness of the sun, sunshine, part of the forenoon when the sun is already high, bright part pf the day when the sun shines fully, early afternoon, high noon, daytime\/daylight."
    }]}