{"data":[
    {
        "indexid":252,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":252,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":252,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":252,
        "wordid":2295,
        "word":"تُرْجَعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word تُرْجَعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":252,
        "wordid":4114,
        "word":"ذَا",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَا comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":252,
        "wordid":4115,
        "word":"يُقْرِضُ",
        "rootid":484,
        "rootword":"ق ر ض",
        "meanings":"to cut, turn away from, severe, do good deed.",
        "sentence":"The word يُقْرِضُ comes from the root ق ر ض and is associated with the meanings: to cut, turn away from, severe, do good deed."
    },

    {
        "indexid":252,
        "wordid":4116,
        "word":"قَرْضًا",
        "rootid":484,
        "rootword":"ق ر ض",
        "meanings":"to cut, turn away from, severe, do good deed.",
        "sentence":"The word قَرْضًا comes from the root ق ر ض and is associated with the meanings: to cut, turn away from, severe, do good deed."
    },

    {
        "indexid":252,
        "wordid":4117,
        "word":"حَسَنًا",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حَسَنًا comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":252,
        "wordid":4118,
        "word":"فَيُضَاعِفَهُ",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word فَيُضَاعِفَهُ comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":252,
        "wordid":4119,
        "word":"أَضْعَافًا",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word أَضْعَافًا comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":252,
        "wordid":4120,
        "word":"كَثِيرَةً",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرَةً comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":252,
        "wordid":4121,
        "word":"يَقْبِضُ",
        "rootid":1053,
        "rootword":"ق ب ض",
        "meanings":"take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace.",
        "sentence":"The word يَقْبِضُ comes from the root ق ب ض and is associated with the meanings: take with hand by actual touch\/feel, close, grasp, clutch, seize, contract\/draw\/collect together, take posession, with reference to birds = contract their wings, quick in flight\/pace."
    },

    {
        "indexid":252,
        "wordid":4122,
        "word":"وَيَبْصُطُ",
        "rootid":368,
        "rootword":"ب س ط",
        "meanings":"Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)",
        "sentence":"The word وَيَبْصُطُ comes from the root ب س ط and is associated with the meanings: Spreading, spreading out or forth, expanding, making wide or ample, stretching forth, extending and\/or dilatingConversing or acting without shyness, boldly, in a free and easy manner and\/or cheerfullyGoing forth or journeyingRejoicing, joyous and\/or cheerfulEmboldened, presumptuous, forward and\/or arrogantCarpets, seller ofSimple or uncompoundedGod who amplifies, enlarges or makes plentiful the means of subsistence, one who diffuses (e.g. souls in the bodies)"
    },

    {
        "indexid":252,
        "wordid":4123,
        "word":"وَإِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    }]}