{"data":[
    {
        "indexid":2525,
        "wordid":2002,
        "word":"الرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2525,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2525,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2525,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2525,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2525,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2525,
        "wordid":2789,
        "word":"مُعْرِضُونَ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word مُعْرِضُونَ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":2525,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":2525,
        "wordid":3402,
        "word":"وَالنَّهَارِ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word وَالنَّهَارِ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":2525,
        "wordid":4415,
        "word":"بِاللَّيْلِ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word بِاللَّيْلِ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2525,
        "wordid":7040,
        "word":"ذِكْرِ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرِ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":2525,
        "wordid":13315,
        "word":"يَكْلَؤُكُمْ",
        "rootid":1396,
        "rootword":"ك ل ا",
        "meanings":"To protect, keep guard, keep safe.",
        "sentence":"The word يَكْلَؤُكُمْ comes from the root ك ل ا and is associated with the meanings: To protect, keep guard, keep safe."
    }]}