{"data":[
    {
        "indexid":2536,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2536,
        "wordid":3453,
        "word":"ءَابَاءَنَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَاءَنَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":2536,
        "wordid":7100,
        "word":"وَجَدْنَا",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word وَجَدْنَا comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":2536,
        "wordid":13343,
        "word":"عَابِدِينَ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَابِدِينَ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    }]}