{"data":[
    {
        "indexid":2555,
        "wordid":3130,
        "word":"جَعَلْنَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلْنَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2555,
        "wordid":6216,
        "word":"وَكُلًّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلًّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2555,
        "wordid":7558,
        "word":"وَوَهَبْنَا",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word وَوَهَبْنَا comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    },

    {
        "indexid":2555,
        "wordid":7559,
        "word":"إِسْحَاقَ",
        "rootid":974,
        "rootword":"س ح ق",
        "meanings":"to be distant, far removed (from good), sahiq - far off place, distant and remote place, deep place. sahaqa - to pound\/crush, sweep (the earth), wind, wear out, destroy. suhqan - be far away, be cursed. Ishaq - Abraham's son.",
        "sentence":"The word إِسْحَاقَ comes from the root س ح ق and is associated with the meanings: to be distant, far removed (from good), sahiq - far off place, distant and remote place, deep place. sahaqa - to pound\/crush, sweep (the earth), wind, wear out, destroy. suhqan - be far away, be cursed. Ishaq - Abraham's son."
    },

    {
        "indexid":2555,
        "wordid":10455,
        "word":"صَالِحِينَ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word صَالِحِينَ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":2555,
        "wordid":12050,
        "word":"نَافِلَةً",
        "rootid":977,
        "rootword":"ن ف ل",
        "meanings":"give spoil, gift, voluntary gift, accession\/addition, something that exceeds the original, a deed beyond what is obligatory.",
        "sentence":"The word نَافِلَةً comes from the root ن ف ل and is associated with the meanings: give spoil, gift, voluntary gift, accession\/addition, something that exceeds the original, a deed beyond what is obligatory."
    }]}