{"data":[
    {
        "indexid":2563,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2563,
        "wordid":2796,
        "word":"أَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word أَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":2563,
        "wordid":7042,
        "word":"فَهَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word فَهَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":2563,
        "wordid":12444,
        "word":"وَعَلَّمْنَاهُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَعَلَّمْنَاهُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2563,
        "wordid":13394,
        "word":"صَنْعَةَ",
        "rootid":1550,
        "rootword":"ص ن ع",
        "meanings":"to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making.",
        "sentence":"The word صَنْعَةَ comes from the root ص ن ع and is associated with the meanings: to make\/do\/create\/build, work a thing, nourish, bring up. sun'un - an act, that which is done. masna'un (pl. masani) - cistern, palace, citadel, fine building, fortress. san'atun - making, art of making."
    },

    {
        "indexid":2563,
        "wordid":13395,
        "word":"لَبُوسٍ",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word لَبُوسٍ comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    },

    {
        "indexid":2563,
        "wordid":13396,
        "word":"لِتُحْصِنَكُمْ",
        "rootid":923,
        "rootword":"ح ص ن",
        "meanings":"To be guarded, be inaccessible, be chaste, be strongly fortified, be preserved, be protected.",
        "sentence":"The word لِتُحْصِنَكُمْ comes from the root ح ص ن and is associated with the meanings: To be guarded, be inaccessible, be chaste, be strongly fortified, be preserved, be protected."
    },

    {
        "indexid":2563,
        "wordid":13397,
        "word":"بَأْسِكُمْ",
        "rootid":214,
        "rootword":"ب ا س",
        "meanings":"mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess.",
        "sentence":"The word بَأْسِكُمْ comes from the root ب ا س and is associated with the meanings: mighty\/strong, distress\/misfortune\/calamity, state of poverty, evil\/bad, very evil, feigned lowliness\/submissiveness, punishment, state of trial\/affliction, courage\/valour\/prowess."
    },

    {
        "indexid":2563,
        "wordid":13398,
        "word":"شَاكِرُونَ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word شَاكِرُونَ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    }]}