{"data":[
    {
        "indexid":2574,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2574,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2574,
        "wordid":5037,
        "word":"لِلْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word لِلْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2574,
        "wordid":13425,
        "word":"أَحْصَنَتْ",
        "rootid":923,
        "rootword":"ح ص ن",
        "meanings":"To be guarded, be inaccessible, be chaste, be strongly fortified, be preserved, be protected.",
        "sentence":"The word أَحْصَنَتْ comes from the root ح ص ن and is associated with the meanings: To be guarded, be inaccessible, be chaste, be strongly fortified, be preserved, be protected."
    },

    {
        "indexid":2574,
        "wordid":13426,
        "word":"فَرْجَهَا",
        "rootid":1258,
        "rootword":"ف ر ج",
        "meanings":"To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs.",
        "sentence":"The word فَرْجَهَا comes from the root ف ر ج and is associated with the meanings: To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs."
    },

    {
        "indexid":2574,
        "wordid":13427,
        "word":"فَنَفَخْنَا",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word فَنَفَخْنَا comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":2574,
        "wordid":13428,
        "word":"رُوحِنَا",
        "rootid":1710,
        "rootword":"ر و ح",
        "meanings":"Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man].",
        "sentence":"The word رُوحِنَا comes from the root ر و ح and is associated with the meanings: Raha - To go or do a thing at evening. Violently windy; good or pleasant wind. Become cool or pleasant [by means of the wind]. Become brisk, lively sprightly, active, agile, or quick [as though one felt the wind and was refreshed by it].Rawahun - he went, journeyed, worked, or did a thing in the evening [or any time of the night or day], or in the afternoon (declining of the sun from its meridian until night).Ruhun - Soul, spirit, vital principle, breath which a man breathes and pervades his whole body. Inspiration or divine revelation [since it is like the vital principle is to the body and quickens man]."
    },

    {
        "indexid":2574,
        "wordid":13429,
        "word":"وَجَعَلْنَاهَا",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلْنَاهَا comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2574,
        "wordid":13430,
        "word":"وَابْنَهَا",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word وَابْنَهَا comes from the root ب ن و and is associated with the meanings: "
    }]}