{"data":[
    {
        "indexid":2600,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2600,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2600,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2600,
        "wordid":2113,
        "word":"النَّاسُ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسُ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":2600,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":2600,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2600,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2600,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2600,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":2600,
        "wordid":2197,
        "word":"الْأَرْضَ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضَ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2600,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2600,
        "wordid":2215,
        "word":"رَيْبٍ",
        "rootid":1347,
        "rootword":"ر ي ب",
        "meanings":"to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge.",
        "sentence":"The word رَيْبٍ comes from the root ر ي ب and is associated with the meanings: to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge."
    },

    {
        "indexid":2600,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2600,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":2600,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2600,
        "wordid":2925,
        "word":"أَنْزَلْنَا",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أَنْزَلْنَا comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2600,
        "wordid":4458,
        "word":"أَجَلٍ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلٍ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":2600,
        "wordid":4459,
        "word":"مُسَمًّى",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word مُسَمًّى comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":2600,
        "wordid":4561,
        "word":"الْأَرْحَامِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الْأَرْحَامِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2600,
        "wordid":4879,
        "word":"تُرَابٍ",
        "rootid":943,
        "rootword":"ت ر ب",
        "meanings":"To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs.",
        "sentence":"The word تُرَابٍ comes from the root ت ر ب and is associated with the meanings: To have much earth, have dust in the hands, dusty, be destitute, poverty, neediness, misery, suffering loss. Poor man intimately acquainted with his mother earth. He sank from the wealth.Soil\/earth\/dust. Cemetery, burial-place, grave.Contemporary friend, companion, match\/fellow\/equal, suiting the age and matching in all other aspects, peer, one having similar tastes\/habits\/views.Breast, breast bones, chest, ribs."
    },

    {
        "indexid":2600,
        "wordid":5296,
        "word":"وَمِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2600,
        "wordid":5309,
        "word":"لِكَيْلَا",
        "rootid":1783,
        "rootword":"ك ي",
        "meanings":"",
        "sentence":"The word لِكَيْلَا comes from the root ك ي and is associated with the meanings: "
    },

    {
        "indexid":2600,
        "wordid":5728,
        "word":"زَوْجٍ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word زَوْجٍ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":2600,
        "wordid":6471,
        "word":"عِلْمٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2600,
        "wordid":6922,
        "word":"وَتَرَى",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word وَتَرَى comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":2600,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":2600,
        "wordid":7614,
        "word":"خَلَقْنَاكُمْ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقْنَاكُمْ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2600,
        "wordid":7905,
        "word":"يُرَدُّ",
        "rootid":1636,
        "rootword":"ر د د",
        "meanings":"to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro.",
        "sentence":"The word يُرَدُّ comes from the root ر د د and is associated with the meanings: to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro."
    },

    {
        "indexid":2600,
        "wordid":8217,
        "word":"الْمَاءَ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word الْمَاءَ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":2600,
        "wordid":11454,
        "word":"نُطْفَةٍ",
        "rootid":1629,
        "rootword":"ن ط ف",
        "meanings":"to flow gently, extrude, ooze, exude, drop, pour, trickle.",
        "sentence":"The word نُطْفَةٍ comes from the root ن ط ف and is associated with the meanings: to flow gently, extrude, ooze, exude, drop, pour, trickle."
    },

    {
        "indexid":2600,
        "wordid":11613,
        "word":"أَرْذَلِ",
        "rootid":825,
        "rootword":"ر ذ ل",
        "meanings":"to be base, mean, corrupt, vile, ignoble.",
        "sentence":"The word أَرْذَلِ comes from the root ر ذ ل and is associated with the meanings: to be base, mean, corrupt, vile, ignoble."
    },

    {
        "indexid":2600,
        "wordid":11614,
        "word":"الْعُمُرِ",
        "rootid":507,
        "rootword":"ع م ر",
        "meanings":"to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age.",
        "sentence":"The word الْعُمُرِ comes from the root ع م ر and is associated with the meanings: to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age."
    },

    {
        "indexid":2600,
        "wordid":11616,
        "word":"يَعْلَمَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2600,
        "wordid":12998,
        "word":"نُخْرِجُكُمْ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word نُخْرِجُكُمْ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":2600,
        "wordid":13484,
        "word":"الْبَعْثِ",
        "rootid":248,
        "rootword":"ب ع ث",
        "meanings":"Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled.",
        "sentence":"The word الْبَعْثِ comes from the root ب ع ث and is associated with the meanings: Removal of that which restrains one from free actionAnything that is sentRousing, exciting, putting in motion or motionIncited, urged, instigated or awokeRaising\/rousing (e.g. of the dead to life)Sleepless or wakefulHastening, quick, swift in going, impelled or propelled."
    },

    {
        "indexid":2600,
        "wordid":13485,
        "word":"عَلَقَةٍ",
        "rootid":1761,
        "rootword":"ع ل ق",
        "meanings":"to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection.",
        "sentence":"The word عَلَقَةٍ comes from the root ع ل ق and is associated with the meanings: to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection."
    },

    {
        "indexid":2600,
        "wordid":13486,
        "word":"مُضْغَةٍ",
        "rootid":956,
        "rootword":"م ض غ",
        "meanings":"A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh.",
        "sentence":"The word مُضْغَةٍ comes from the root م ض غ and is associated with the meanings: A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh."
    },

    {
        "indexid":2600,
        "wordid":13487,
        "word":"مُخَلَّقَةٍ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word مُخَلَّقَةٍ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2600,
        "wordid":13488,
        "word":"وَغَيْرِ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word وَغَيْرِ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":2600,
        "wordid":13489,
        "word":"لِنُبَيِّنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word لِنُبَيِّنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":2600,
        "wordid":13490,
        "word":"وَنُقِرُّ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word وَنُقِرُّ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":2600,
        "wordid":13491,
        "word":"طِفْلًا",
        "rootid":687,
        "rootword":"ط ف ل",
        "meanings":"baby\/infant\/child, to be of tenderage, young one, tiny baby, tender\/soft.The sun rose\/set (red\/orange sky).",
        "sentence":"The word طِفْلًا comes from the root ط ف ل and is associated with the meanings: baby\/infant\/child, to be of tenderage, young one, tiny baby, tender\/soft.The sun rose\/set (red\/orange sky)."
    },

    {
        "indexid":2600,
        "wordid":13492,
        "word":"لِتَبْلُغُوا",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word لِتَبْلُغُوا comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    },

    {
        "indexid":2600,
        "wordid":13493,
        "word":"أَشُدَّكُمْ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word أَشُدَّكُمْ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":2600,
        "wordid":13494,
        "word":"يُتَوَفَّى",
        "rootid":1392,
        "rootword":"و ف ي",
        "meanings":"to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death.",
        "sentence":"The word يُتَوَفَّى comes from the root و ف ي and is associated with the meanings: to reach the end, keep ones promise, fulfil ones engagement, pay a debt, perform a promise. tawaffa - to die. wafaat - death."
    },

    {
        "indexid":2600,
        "wordid":13495,
        "word":"هَامِدَةً",
        "rootid":588,
        "rootword":"ه م د",
        "meanings":"to be lifeless, barren.",
        "sentence":"The word هَامِدَةً comes from the root ه م د and is associated with the meanings: to be lifeless, barren."
    },

    {
        "indexid":2600,
        "wordid":13496,
        "word":"اهْتَزَّتْ",
        "rootid":587,
        "rootword":"ه ز ز",
        "meanings":"to shake, brandish wave, thrill, stir, throb, shift, wrangle.",
        "sentence":"The word اهْتَزَّتْ comes from the root ه ز ز and is associated with the meanings: to shake, brandish wave, thrill, stir, throb, shift, wrangle."
    },

    {
        "indexid":2600,
        "wordid":13497,
        "word":"وَرَبَتْ",
        "rootid":413,
        "rootword":"ر ب و",
        "meanings":"it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased.",
        "sentence":"The word وَرَبَتْ comes from the root ر ب و and is associated with the meanings: it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased."
    },

    {
        "indexid":2600,
        "wordid":13498,
        "word":"وَأَنْبَتَتْ",
        "rootid":664,
        "rootword":"ن ب ت",
        "meanings":"to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle.",
        "sentence":"The word وَأَنْبَتَتْ comes from the root ن ب ت and is associated with the meanings: to produce (tree), germinate, grow, sprout (plant), grow up (child). nawaabit - offspring of human beings or cattle."
    },

    {
        "indexid":2600,
        "wordid":13499,
        "word":"بَهِيجٍ",
        "rootid":105,
        "rootword":"ب ه ج",
        "meanings":"beautiful\/bright\/splendid, joyful\/glad\/happy, goodly, loveliness.",
        "sentence":"The word بَهِيجٍ comes from the root ب ه ج and is associated with the meanings: beautiful\/bright\/splendid, joyful\/glad\/happy, goodly, loveliness."
    }]}