{"data":[
    {
        "indexid":2614,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2614,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2614,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":2614,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2614,
        "wordid":8021,
        "word":"نَارٍ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارٍ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":2614,
        "wordid":11058,
        "word":"قُطِّعَتْ",
        "rootid":395,
        "rootword":"ق ط ع",
        "meanings":"to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion.",
        "sentence":"The word قُطِّعَتْ comes from the root ق ط ع and is associated with the meanings: to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion."
    },

    {
        "indexid":2614,
        "wordid":11193,
        "word":"فَوْقِ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقِ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":2614,
        "wordid":13533,
        "word":"خَصْمَانِ",
        "rootid":57,
        "rootword":"خ ص م",
        "meanings":"Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something.",
        "sentence":"The word خَصْمَانِ comes from the root خ ص م and is associated with the meanings: Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something."
    },

    {
        "indexid":2614,
        "wordid":13534,
        "word":"اخْتَصَمُوا",
        "rootid":57,
        "rootword":"خ ص م",
        "meanings":"Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something.",
        "sentence":"The word اخْتَصَمُوا comes from the root خ ص م and is associated with the meanings: Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something."
    },

    {
        "indexid":2614,
        "wordid":13535,
        "word":"ثِيَابٌ",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word ثِيَابٌ comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    },

    {
        "indexid":2614,
        "wordid":13536,
        "word":"يُصَبُّ",
        "rootid":1091,
        "rootword":"ص ب ب",
        "meanings":"to pour out, be poured out. sabbun - the act of pouring. sabban - the act of pouring heavily.",
        "sentence":"The word يُصَبُّ comes from the root ص ب ب and is associated with the meanings: to pour out, be poured out. sabbun - the act of pouring. sabban - the act of pouring heavily."
    },

    {
        "indexid":2614,
        "wordid":13537,
        "word":"رُءُوسِهِمُ",
        "rootid":1298,
        "rootword":"ر ا س",
        "meanings":"head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people.",
        "sentence":"The word رُءُوسِهِمُ comes from the root ر ا س and is associated with the meanings: head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people."
    },

    {
        "indexid":2614,
        "wordid":13538,
        "word":"الْحَمِيمُ",
        "rootid":1004,
        "rootword":"ح م م",
        "meanings":"To heat, become hot or very hot, melt. Boiling water. Loyal\/close friend\/relative. Black smoke.",
        "sentence":"The word الْحَمِيمُ comes from the root ح م م and is associated with the meanings: To heat, become hot or very hot, melt. Boiling water. Loyal\/close friend\/relative. Black smoke."
    }]}