{"data":[
    {
        "indexid":2636,
        "wordid":2037,
        "word":"الصَّلَوةَ",
        "rootid":565,
        "rootword":"ص ل و",
        "meanings":"prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump.",
        "sentence":"The word الصَّلَوةَ comes from the root ص ل و and is associated with the meanings: prayer, supplication, petition, oration, eulogy, benediction, commendation, blessing, honour, magnify, bring forth, follow closely, walk\/follow behind closely, to remain attached.. In a horse race when the second horse follows the first one so closely that its head always overlaps the first horse’s body that horse is called AL-MUSSALLI (i.e. the one who follows closely \/ remains attached).. Central portion of the back, portion from where the tail of an animal comes out, the rump."
    },

    {
        "indexid":2636,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2636,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2636,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2636,
        "wordid":2439,
        "word":"الزَّكَوةَ",
        "rootid":467,
        "rootword":"ز ك و",
        "meanings":"it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due",
        "sentence":"The word الزَّكَوةَ comes from the root ز ك و and is associated with the meanings: it increased\/augmented, it throve\/grew well\/flourished\/prospered and produced fruit, it was\/became pure, purification, goodness\/righteousness, lead\/enjoy a plentiful\/easy\/soft\/delicate life, put into a good\/right state\/condition, alms, poor-rate\/due"
    },

    {
        "indexid":2636,
        "wordid":3065,
        "word":"وَلِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَلِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2636,
        "wordid":3527,
        "word":"بِالْمَعْرُوفِ",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word بِالْمَعْرُوفِ comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    },

    {
        "indexid":2636,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2636,
        "wordid":4438,
        "word":"وَءَاتَوُا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word وَءَاتَوُا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":2636,
        "wordid":5073,
        "word":"الْمُنْكَرِ",
        "rootid":1601,
        "rootword":"ن ك ر",
        "meanings":"to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge.",
        "sentence":"The word الْمُنْكَرِ comes from the root ن ك ر and is associated with the meanings: to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge."
    },

    {
        "indexid":2636,
        "wordid":5220,
        "word":"عَاقِبَةُ",
        "rootid":1507,
        "rootword":"ع ق ب",
        "meanings":"to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged.",
        "sentence":"The word عَاقِبَةُ comes from the root ع ق ب and is associated with the meanings: to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged."
    },

    {
        "indexid":2636,
        "wordid":5494,
        "word":"الْأُمُورِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word الْأُمُورِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2636,
        "wordid":6949,
        "word":"أَقَامُوا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word أَقَامُوا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":2636,
        "wordid":7221,
        "word":"مَكَّنَّاهُمْ",
        "rootid":968,
        "rootword":"م ك ن",
        "meanings":"To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing.",
        "sentence":"The word مَكَّنَّاهُمْ comes from the root م ك ن and is associated with the meanings: To give or assign someone a place, to establish or settle in an abode, to enable or empower someone to do a thing."
    },

    {
        "indexid":2636,
        "wordid":13629,
        "word":"وَأَمَرُوا",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word وَأَمَرُوا comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2636,
        "wordid":13630,
        "word":"وَنَهَوْا",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word وَنَهَوْا comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    }]}