{"data":[
    {
        "indexid":2639,
        "wordid":2236,
        "word":"لِلْكَافِرِينَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word لِلْكَافِرِينَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":2639,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2639,
        "wordid":4668,
        "word":"فَكَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word فَكَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":2639,
        "wordid":11066,
        "word":"فَأَمْلَيْتُ",
        "rootid":637,
        "rootword":"م ل و",
        "meanings":"To live long, enjoy a thing.",
        "sentence":"The word فَأَمْلَيْتُ comes from the root م ل و and is associated with the meanings: To live long, enjoy a thing."
    },

    {
        "indexid":2639,
        "wordid":11067,
        "word":"أَخَذْتُهُمْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word أَخَذْتُهُمْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":2639,
        "wordid":13636,
        "word":"وَأَصْحَابُ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word وَأَصْحَابُ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":2639,
        "wordid":13637,
        "word":"وَكُذِّبَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word وَكُذِّبَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":2639,
        "wordid":13638,
        "word":"نَكِيرِ",
        "rootid":1601,
        "rootword":"ن ك ر",
        "meanings":"to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge.",
        "sentence":"The word نَكِيرِ comes from the root ن ك ر and is associated with the meanings: to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge."
    }]}