{"data":[
    {
        "indexid":2665,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2665,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2665,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2665,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2665,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":2665,
        "wordid":2345,
        "word":"أَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":2665,
        "wordid":2349,
        "word":"وَالْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word وَالْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2665,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2665,
        "wordid":2998,
        "word":"تَعْلَمْ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمْ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2665,
        "wordid":4983,
        "word":"كِتَابٍ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابٍ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":2665,
        "wordid":10748,
        "word":"يَسِيرٌ",
        "rootid":706,
        "rootword":"ي س ر",
        "meanings":"become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling.",
        "sentence":"The word يَسِيرٌ comes from the root ي س ر and is associated with the meanings: become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling."
    }]}