{"data":[
    {
        "indexid":2672,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":2672,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":2672,
        "wordid":3650,
        "word":"تُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word تُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":2672,
        "wordid":5863,
        "word":"وَاعْبُدُوا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word وَاعْبُدُوا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":2672,
        "wordid":8202,
        "word":"رَبَّكُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2672,
        "wordid":13705,
        "word":"ارْكَعُوا",
        "rootid":971,
        "rootword":"ر ك ع",
        "meanings":"bowed, bent, incline, humility, humble yourself, lower the head.",
        "sentence":"The word ارْكَعُوا comes from the root ر ك ع and is associated with the meanings: bowed, bent, incline, humility, humble yourself, lower the head."
    },

    {
        "indexid":2672,
        "wordid":13706,
        "word":"وَاسْجُدُوا",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word وَاسْجُدُوا comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":2672,
        "wordid":13707,
        "word":"وَافْعَلُوا",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word وَافْعَلُوا comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":2672,
        "wordid":13708,
        "word":"الْخَيْرَ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word الْخَيْرَ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    }]}