{"data":[
    {
        "indexid":2687,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":2687,
        "wordid":3239,
        "word":"أَحْسَنُ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word أَحْسَنُ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":2687,
        "wordid":4292,
        "word":"لَحْمًا",
        "rootid":144,
        "rootword":"ل ح م",
        "meanings":"flesh\/meat, to feed with flesh, skin\/hide\/cloth.",
        "sentence":"The word لَحْمًا comes from the root ل ح م and is associated with the meanings: flesh\/meat, to feed with flesh, skin\/hide\/cloth."
    },

    {
        "indexid":2687,
        "wordid":8747,
        "word":"خَلَقْنَا",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقْنَا comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2687,
        "wordid":11440,
        "word":"ءَاخَرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word ءَاخَرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":2687,
        "wordid":11947,
        "word":"عِظَامًا",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عِظَامًا comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":2687,
        "wordid":11950,
        "word":"خَلْقًا",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلْقًا comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2687,
        "wordid":13731,
        "word":"النُّطْفَةَ",
        "rootid":1629,
        "rootword":"ن ط ف",
        "meanings":"to flow gently, extrude, ooze, exude, drop, pour, trickle.",
        "sentence":"The word النُّطْفَةَ comes from the root ن ط ف and is associated with the meanings: to flow gently, extrude, ooze, exude, drop, pour, trickle."
    },

    {
        "indexid":2687,
        "wordid":13732,
        "word":"عَلَقَةً",
        "rootid":1761,
        "rootword":"ع ل ق",
        "meanings":"to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection.",
        "sentence":"The word عَلَقَةً comes from the root ع ل ق and is associated with the meanings: to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection."
    },

    {
        "indexid":2687,
        "wordid":13733,
        "word":"فَخَلَقْنَا",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word فَخَلَقْنَا comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":2687,
        "wordid":13734,
        "word":"الْعَلَقَةَ",
        "rootid":1761,
        "rootword":"ع ل ق",
        "meanings":"to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection.",
        "sentence":"The word الْعَلَقَةَ comes from the root ع ل ق and is associated with the meanings: to adhere to, hang, love, leech, have an attachment, cling, hold fast, pertain, catch, concern, become attached by love, suspend, fasten a thing, cleave, clot of blood, germ-cell, fertilised female ovum. alqun\/ilqun - precious thing. alaqatun - true love, attachment. ilaqatun - love, affection."
    },

    {
        "indexid":2687,
        "wordid":13735,
        "word":"مُضْغَةً",
        "rootid":956,
        "rootword":"م ض غ",
        "meanings":"A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh.",
        "sentence":"The word مُضْغَةً comes from the root م ض غ and is associated with the meanings: A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh."
    },

    {
        "indexid":2687,
        "wordid":13736,
        "word":"الْمُضْغَةَ",
        "rootid":956,
        "rootword":"م ض غ",
        "meanings":"A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh.",
        "sentence":"The word الْمُضْغَةَ comes from the root م ض غ and is associated with the meanings: A piece or bit of flesh, a morsel or gobbet of flesh; heart and tongue of a person; a foetus when it becomes like a lump of flesh."
    },

    {
        "indexid":2687,
        "wordid":13737,
        "word":"فَكَسَوْنَا",
        "rootid":1445,
        "rootword":"ك س و",
        "meanings":"To dress, clothe.",
        "sentence":"The word فَكَسَوْنَا comes from the root ك س و and is associated with the meanings: To dress, clothe."
    },

    {
        "indexid":2687,
        "wordid":13738,
        "word":"الْعِظَامَ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word الْعِظَامَ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":2687,
        "wordid":13739,
        "word":"أَنْشَأْنَاهُ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word أَنْشَأْنَاهُ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    },

    {
        "indexid":2687,
        "wordid":13740,
        "word":"فَتَبَارَكَ",
        "rootid":1480,
        "rootword":"ب ر ك",
        "meanings":"Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty.",
        "sentence":"The word فَتَبَارَكَ comes from the root ب ر ك and is associated with the meanings: Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty."
    },

    {
        "indexid":2687,
        "wordid":13741,
        "word":"الْخَالِقِينَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word الْخَالِقِينَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    }]}