{"data":[
    {
        "indexid":2726,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":2726,
        "wordid":3051,
        "word":"بَيْنَهُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَهُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":2726,
        "wordid":4794,
        "word":"لَدَيْهِمْ",
        "rootid":1077,
        "rootword":"ل د ي",
        "meanings":"",
        "sentence":"The word لَدَيْهِمْ comes from the root ل د ي and is associated with the meanings: "
    },

    {
        "indexid":2726,
        "wordid":9337,
        "word":"فَرِحُونَ",
        "rootid":778,
        "rootword":"ف ر ح",
        "meanings":"to be glad\/happy\/delighted\/cheerful\/pleased, rejoice, exult, who exults, lively.",
        "sentence":"The word فَرِحُونَ comes from the root ف ر ح and is associated with the meanings: to be glad\/happy\/delighted\/cheerful\/pleased, rejoice, exult, who exults, lively."
    },

    {
        "indexid":2726,
        "wordid":10893,
        "word":"أَمْرَهُمْ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمْرَهُمْ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":2726,
        "wordid":13807,
        "word":"فَتَقَطَّعُوا",
        "rootid":395,
        "rootword":"ق ط ع",
        "meanings":"to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion.",
        "sentence":"The word فَتَقَطَّعُوا comes from the root ق ط ع and is associated with the meanings: to cut\/sever\/disunite\/separate\/detach, to disable in prosecuting, unable to proceed in, withdrew, break down, perish\/cease\/finish\/fail, cut short \/ stop, intercepted\/interrupted, put an end\/stop to, a piece\/bit\/part\/portion cut off from a whole, herd, distinct portion."
    },

    {
        "indexid":2726,
        "wordid":13808,
        "word":"زُبُرًا",
        "rootid":351,
        "rootword":"ز ب ر",
        "meanings":"case the well, wall internally, construction of one part above another, check\/restrain\/forbade, prevented\/hindered\/witheld, write well\/skillfully\/firmly, read\/recite, become large\/courageous\/brave (man), came forth, stones, understanding\/restraint\/intellect, a thing written, psalms, Book of David, books of Moses\/David\/Muhammad together, piece of iron, anvil, upper part of the back, strong\/bulky, black mud.",
        "sentence":"The word زُبُرًا comes from the root ز ب ر and is associated with the meanings: case the well, wall internally, construction of one part above another, check\/restrain\/forbade, prevented\/hindered\/witheld, write well\/skillfully\/firmly, read\/recite, become large\/courageous\/brave (man), came forth, stones, understanding\/restraint\/intellect, a thing written, psalms, Book of David, books of Moses\/David\/Muhammad together, piece of iron, anvil, upper part of the back, strong\/bulky, black mud."
    },

    {
        "indexid":2726,
        "wordid":13809,
        "word":"حِزْبٍ",
        "rootid":1267,
        "rootword":"ح ز ب",
        "meanings":"To befall and distress, divide.",
        "sentence":"The word حِزْبٍ comes from the root ح ز ب and is associated with the meanings: To befall and distress, divide."
    }]}