{"data":[
    {
        "indexid":2748,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2748,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2748,
        "wordid":2128,
        "word":"يَعْمَهُونَ",
        "rootid":906,
        "rootword":"ع م ه",
        "meanings":"to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness.",
        "sentence":"The word يَعْمَهُونَ comes from the root ع م ه and is associated with the meanings: to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness."
    },

    {
        "indexid":2748,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":2748,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":2748,
        "wordid":9720,
        "word":"ضُرٍّ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word ضُرٍّ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":2748,
        "wordid":13841,
        "word":"رَحِمْنَاهُمْ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِمْنَاهُمْ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2748,
        "wordid":13842,
        "word":"وَكَشَفْنَا",
        "rootid":268,
        "rootword":"ك ش ف",
        "meanings":"To pull away, remove, take off, open up, lay open lay base, uncover.",
        "sentence":"The word وَكَشَفْنَا comes from the root ك ش ف and is associated with the meanings: To pull away, remove, take off, open up, lay open lay base, uncover."
    },

    {
        "indexid":2748,
        "wordid":13843,
        "word":"لَلَجُّوا",
        "rootid":158,
        "rootword":"ل ج ج",
        "meanings":"To exceed the limit, persist obstinately, persevere, insist upon a thing, be querulous, continue in opposition\/contention\/litigation\/wrangling.Main sea or body of water, fathomless deep sea, great expanse of sea of which the limits cannot be seen, great & confused.Fluctuating, come and go repeatedly, stammer\/stutter in speech, confused noise\/voices.The side of a valley\/shore\/sea, mirror\/silver, sword, rugged part of a mountain.",
        "sentence":"The word لَلَجُّوا comes from the root ل ج ج and is associated with the meanings: To exceed the limit, persist obstinately, persevere, insist upon a thing, be querulous, continue in opposition\/contention\/litigation\/wrangling.Main sea or body of water, fathomless deep sea, great expanse of sea of which the limits cannot be seen, great & confused.Fluctuating, come and go repeatedly, stammer\/stutter in speech, confused noise\/voices.The side of a valley\/shore\/sea, mirror\/silver, sword, rugged part of a mountain."
    }]}