{"data":[
    {
        "indexid":2771,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2771,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":2771,
        "wordid":13860,
        "word":"وَأَعُوذُ",
        "rootid":1751,
        "rootword":"ع و ذ",
        "meanings":"to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge.",
        "sentence":"The word وَأَعُوذُ comes from the root ع و ذ and is associated with the meanings: to seek or take protection, refuge, be next, the bone (flesh). Ma'aadh - a refuge, Ma'aadh Allaah - I seek refuge with Allaah, God forbid, Allaah be my refuge.. . 'Udhtu (prf. 1st. sing.): I sought refuge\/protection.. A'uudhu (imp. 1st. sing.): I seek refuge.. Ya'uudhuuna (imp. 3rd. m. pl.): they seek refuge.. U'iidh (imp. 1st. sing. vb. IV): I seek refuge for, do commend (to your) protection.. Ista'idh (prt. m. sing. vb. 10): seek refuge!. Ma'aadhun (pis. pic.): refuge."
    },

    {
        "indexid":2771,
        "wordid":13861,
        "word":"يَحْضُرُونِ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word يَحْضُرُونِ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    }]}