{"data":[
    {
        "indexid":2776,
        "wordid":2088,
        "word":"أَنْفُسَهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسَهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":2776,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2776,
        "wordid":2257,
        "word":"خَالِدُونَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word خَالِدُونَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    },

    {
        "indexid":2776,
        "wordid":2776,
        "word":"فَأُولَئِكَ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word فَأُولَئِكَ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":2776,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":2776,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":2776,
        "wordid":7248,
        "word":"خَسِرُوا",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word خَسِرُوا comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    },

    {
        "indexid":2776,
        "wordid":8011,
        "word":"مَوَازِينُهُ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word مَوَازِينُهُ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    },

    {
        "indexid":2776,
        "wordid":8012,
        "word":"خَفَّتْ",
        "rootid":726,
        "rootword":"خ ف ف",
        "meanings":"To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable.",
        "sentence":"The word خَفَّتْ comes from the root خ ف ف and is associated with the meanings: To be light of weight (in body or material substance), light in estimation or of little account, to be lively\/active\/agile\/prompt and quick, obedient and submissive in work\/servitude, to hasten, depart or journey quickly, to be light in conduct or behaviour, acute\/sharp\/clever\/ingenious in hearing and understanding, to be agitated or excited by reason of fear and anger, acceptable in company or conversation, light-hearted\/cheerful, to be few in number, to be deficient\/slight\/inconsiderable."
    }]}