{"data":[
    {
        "indexid":2777,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":2777,
        "wordid":2761,
        "word":"النَّارُ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارُ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":2777,
        "wordid":11282,
        "word":"وُجُوهَهُمُ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وُجُوهَهُمُ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":2777,
        "wordid":13869,
        "word":"تَلْفَحُ",
        "rootid":36,
        "rootword":"ل ف ح",
        "meanings":"To burn\/scorch\/hurt\/smite\/strike.",
        "sentence":"The word تَلْفَحُ comes from the root ل ف ح and is associated with the meanings: To burn\/scorch\/hurt\/smite\/strike."
    },

    {
        "indexid":2777,
        "wordid":13870,
        "word":"كَالِحُونَ",
        "rootid":1655,
        "rootword":"ك ل ح",
        "meanings":"To put on a sour, austere, harsh, astringent, stern, grave look; look with frown, wear a grin of pain and anguish, express foolish satisfaction, endure pain, show disappointment, grin with lips, make contracted face and its surrounding parts; stern, severe, forbidding look.",
        "sentence":"The word كَالِحُونَ comes from the root ك ل ح and is associated with the meanings: To put on a sour, austere, harsh, astringent, stern, grave look; look with frown, wear a grin of pain and anguish, express foolish satisfaction, endure pain, show disappointment, grin with lips, make contracted face and its surrounding parts; stern, severe, forbidding look."
    }]}