{"data":[
    {
        "indexid":280,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":280,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":280,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":280,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":280,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":280,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":280,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":280,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":280,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":280,
        "wordid":2444,
        "word":"النَّاسَ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسَ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":280,
        "wordid":2986,
        "word":"خَيْرٍ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرٍ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":280,
        "wordid":3345,
        "word":"سَبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word سَبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":280,
        "wordid":4397,
        "word":"تُنْفِقُوا",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word تُنْفِقُوا comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":280,
        "wordid":4403,
        "word":"لِلْفُقَرَاءِ",
        "rootid":1045,
        "rootword":"ف ق ر",
        "meanings":"to be poor\/destitute\/needy, in want of, poverty. faqira \/ faqara - to overwhelm with back breaking calamity, feel a pain in the vertebrae.",
        "sentence":"The word لِلْفُقَرَاءِ comes from the root ف ق ر and is associated with the meanings: to be poor\/destitute\/needy, in want of, poverty. faqira \/ faqara - to overwhelm with back breaking calamity, feel a pain in the vertebrae."
    },

    {
        "indexid":280,
        "wordid":4404,
        "word":"أُحْصِرُوا",
        "rootid":724,
        "rootword":"ح ص ر",
        "meanings":"To be strait, restricted, hindered.",
        "sentence":"The word أُحْصِرُوا comes from the root ح ص ر and is associated with the meanings: To be strait, restricted, hindered."
    },

    {
        "indexid":280,
        "wordid":4405,
        "word":"يَسْتَطِيعُونَ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word يَسْتَطِيعُونَ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":280,
        "wordid":4406,
        "word":"ضَرْبًا",
        "rootid":722,
        "rootword":"ض ر ب",
        "meanings":"to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet.",
        "sentence":"The word ضَرْبًا comes from the root ض ر ب and is associated with the meanings: to heal, strike, propound as an example, put forth a parable, go, make a journey, travel, mix, avoid, take away, put a cover, shut, mention\/declare\/state, propound, set forth, compare, liken, seek a way, march on, set, impose, prevent, fight, traffic with anyone's property for a share in the profit, he made or caused to be or constituted, leave\/forsake, take away thing (with 'an).. Depressed ground, hard ground in a plain, sandy valley, commissioner as he has to travel much.. Kind manner, lean, thin, similar, alike, the act of striking, a blow, going from place to place, vicissitude of life, affliction especially that which relates to one's person, as disease, death, degradation is common and general suffering.. . beat, struck, smote, hit, the making a thing fall upon another thing, discipline\/train, to cast forth, threw or flung it, seal\/stamp, veil\/curtain\/cover\/barrier, to point or make a sign, prohibit\/hinder\/prevent\/withheld\/restrain, collision, corrupted\/disordered\/disturbance\/unsettled\/confused, turn away, avoid, shun, fashion\/mould\/adapt, mention or set forth (e.g. a parable\/example), explain, make a way, multiplying, go\/travel, went away, it was or became long, excite\/incite\/urge\/instigate, contend, dispose\/accommodate, retract\/digression\/transition, to silence, tremble\/shiver, share\/portion.. Location where something is struck, wool or goat's hair separated or plucked or beaten with a mallet, sword, tent-peg, mallet."
    },

    {
        "indexid":280,
        "wordid":4407,
        "word":"يَحْسَبُهُمُ",
        "rootid":1063,
        "rootword":"ح س ب",
        "meanings":"To think, consider, suppose, imagine, be of opinion.",
        "sentence":"The word يَحْسَبُهُمُ comes from the root ح س ب and is associated with the meanings: To think, consider, suppose, imagine, be of opinion."
    },

    {
        "indexid":280,
        "wordid":4408,
        "word":"الْجَاهِلُ",
        "rootid":443,
        "rootword":"ج ه ل",
        "meanings":"To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan.",
        "sentence":"The word الْجَاهِلُ comes from the root ج ه ل and is associated with the meanings: To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan."
    },

    {
        "indexid":280,
        "wordid":4409,
        "word":"أَغْنِيَاءَ",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word أَغْنِيَاءَ comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":280,
        "wordid":4410,
        "word":"التَّعَفُّفِ",
        "rootid":581,
        "rootword":"ع ف ف",
        "meanings":"to abstain from what is unlawful, be abstinent, restrain. (The verb is of the assimilated type. In genitive cases shadda is removed and cluster is pronounced separelt as in 4:6 ta'affuf - modest\/abstinence)",
        "sentence":"The word التَّعَفُّفِ comes from the root ع ف ف and is associated with the meanings: to abstain from what is unlawful, be abstinent, restrain. (The verb is of the assimilated type. In genitive cases shadda is removed and cluster is pronounced separelt as in 4:6 ta'affuf - modest\/abstinence)"
    },

    {
        "indexid":280,
        "wordid":4411,
        "word":"تَعْرِفُهُمْ",
        "rootid":915,
        "rootword":"ع ر ف",
        "meanings":"he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness.",
        "sentence":"The word تَعْرِفُهُمْ comes from the root ع ر ف and is associated with the meanings: he knew it, had cognition of it, to discern, became acquainted with it, perceiving a thing by reflection and by consideration of the effect, he requited, to acknowledge a part, manager\/orderer\/overseer, become submissive\/tractable\/pleasant, the making to know, fragrant, to inform oneself, learn\/discover, seek\/desire knowledge, benefaction\/goodness, mane (of a horse) waves (of the sea), elevated place\/portion, higher\/highest, first\/foremost, a question or questioning respecting a subject of information in order to know it, commonly received\/known, to confess\/acknowledge\/indicate, high mountain, Mount Arafat.. The difference between arafa & alima is that the former refers to distinct and specific knowledge, while the latter is more general. Opposite to arafa is ankara (to deny) and opposite ot alima is jahila (to be ignorant).. al araf - the elevated place, high dignity, distinguished position, place of discernment or acknowledgement, highest or most elevated faculties of discernment or ma'rifah (knowledge of right and wrong).. ma'ruf - honourable, known, recognised, good, befitting, fairness, kindness, custom of society, usage.. . 'arafaat (pl. of 'arafat, masculine 'araf, being a version of 'aarif, the active form of 'arafa and\/or 'arfun, the informational noun of 'arafa) means 'familiarizations, approbations, recognitions.'. . 'Arafa (prf. 3rd. m. sing.): He recognized, acknowledged.. 'Arafuu (prf. 3rd. m. plu.): They recognized.. 'Arafta (prf. 2nd. m. sing.): Thou knew.. Ta'rifu (imp. 2nd. m. sing.): Thou recognize.. Ya'rifuuna (imp. 3rd. m. plu.): They recognize.. Ya'rifuu (imp. 3rd. m. plu. juss. Nun at the end dropped).. Ta'rifanna (imp. 2nd. m. sing, imp.): Thou should surely recognize.. Ta'rifuuna (imp. 2nd. m. plu.): You shall recognize.. Yu'rafu (pip. 3rd. m. sing.): He is recognized.. Yu'rafna (pip. 3rd. f. plu.): They (f) are\/will be recognized.. 'Arrafa (prf. 2nd. m. sing. II): Made known.. Ta'aarafuu (prf. 3rd. m. plu.): You know each other, recognize each other, do good to each other.. Yata'aarafuuna (imp. 3rd. m. plu.): They will recognize one another.. I'tarafuu (prf. 3rd. m. pl. vb. VIII): they have confessed.. I'tarafnaa (prf. 1st. m. pl.): we have confessed.. mar'uufun (pct. pic.): known or recognized thing that which is good as an universally accepted fact, reputable, fairness, kindness, equity, according to usage, custom of the society, courteous, right.. ma'ruufatun (pct. pic. f. sing.): recognized.. 'urfun (n.): seemliness, good.. 'urfan (n. acc.): beneficence, goodness, kindness."
    },

    {
        "indexid":280,
        "wordid":4412,
        "word":"بِسِيمَاهُمْ",
        "rootid":782,
        "rootword":"س و م",
        "meanings":"to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture.",
        "sentence":"The word بِسِيمَاهُمْ comes from the root س و م and is associated with the meanings: to go to pasture, afflict, impose a hard task or punishment upon. Swooping, sweeping, making a terrific onslaught. sima - sign\/mark.seema means an identifiable feature\/sign\/mark. muawussim one who makes a mark of distinction, person of mark or distinction, marked with a simatun or brand.asama vb. (IV) - to turn out to graze, to pasture."
    },

    {
        "indexid":280,
        "wordid":4413,
        "word":"يَسْءَلُونَ",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word يَسْءَلُونَ comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":280,
        "wordid":4414,
        "word":"إِلْحَافًا",
        "rootid":1406,
        "rootword":"ل ح ف",
        "meanings":"To cover with a cloak or a sheet, wrap in a garment, single lining garment (i.e. not doubled or stuffed), to be importune, demand with importunity, persist.",
        "sentence":"The word إِلْحَافًا comes from the root ل ح ف and is associated with the meanings: To cover with a cloak or a sheet, wrap in a garment, single lining garment (i.e. not doubled or stuffed), to be importune, demand with importunity, persist."
    }]}