{"data":[
    {
        "indexid":287,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":287,
        "wordid":2212,
        "word":"تَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":287,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":287,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":287,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":287,
        "wordid":2520,
        "word":"خَيْرٌ",
        "rootid":1426,
        "rootword":"خ ي ر",
        "meanings":"Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition.",
        "sentence":"The word خَيْرٌ comes from the root خ ي ر and is associated with the meanings: Be possessed of good, to do good, give one a choice or option (and also be given a choice or option), prefer one thing or person over another thing or person, preferred\/pronounced\/chosen, strive to surpass one in goodness, excellent in beauty and disposition, to be ideal (show actual or potential usefulness or benefit), be desired in all circumstances and by every person, exalted in rank or quality or reputation, to be better than another person or thing, be the best of things or people, to be generous (possess and show generosity), possess nobility or eminence, be elevated in state or condition."
    },

    {
        "indexid":287,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":287,
        "wordid":2989,
        "word":"ذُو",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذُو comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":287,
        "wordid":3449,
        "word":"وَأَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَأَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":287,
        "wordid":4450,
        "word":"عُسْرَةٍ",
        "rootid":1611,
        "rootword":"ع س ر",
        "meanings":"to be difficult\/hard, be hard to one another, hardship.",
        "sentence":"The word عُسْرَةٍ comes from the root ع س ر and is associated with the meanings: to be difficult\/hard, be hard to one another, hardship."
    },

    {
        "indexid":287,
        "wordid":4451,
        "word":"فَنَظِرَةٌ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَنَظِرَةٌ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":287,
        "wordid":4452,
        "word":"مَيْسَرَةٍ",
        "rootid":706,
        "rootword":"ي س ر",
        "meanings":"become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling.",
        "sentence":"The word مَيْسَرَةٍ comes from the root ي س ر and is associated with the meanings: become gentle\/tractable\/manageable\/easy\/submissive\/liberal, become little in quantity\/paltry \/ no weight or worth, come from left, divide into parts\/portions, make easy\/smooth, adapt\/accommodate, play with gaming arrows (al maysiri), a game for stakes\/wagers involving risk.. . For those who always wanted to know what \"arrows of chance \/ gaming arrows\" were. Lane gives quite a detailed description of what was involved. I'll explain my take on it: a group of 10 (or however many there are) buys an animal on credit (e.g. camel), they slaughter the animal and divide it into 10 portions (equaling the number of people in the group). They assign a number to each portion of meat, e.g. portion 1 is marked 1, portion 2 is marked 2, portion 3 is marked 3 etc up to 10. They take 10 arrow heads (no feathers) and mark each arrow head with a number, arrow head 1 marked 1 (this corresponds to meat portion 1), arrow head 2 marked 2 (this corresponds to meat portion 2) etc up to 7, arrows 8, 9 and 10 are left with no mark. They assign a person to shuffle the arrow heads and distribute them to the 10 players. If someone gets arrow 1 they take meat portion 1, if someone gets arrow 2 they take meat portion 2 and so on. Whoever gets the unmarked arrows (3 people in this example) have to pay the entire value of the slaughtered animal, that was initially bought on credit.. . Yassara (prf. 3rd. p. m. sing. II.): Made easy.. Yassarnaa (prf. 1st. p. plu II.): We made easy.. Noyassiru (imp. 1st. p. plu. II.): We shall ease.. Tayassara (prf. 3rd. p. m. sing V.): Became easy.. Istaisara (X.) Got easily.. Yusr (v. n.): Ease.. Yasiirun\/Yasiiran (acc.\/act. pic. 2nd. m. sing.): Easy to bear; Light; Small.. Yusraa (elative, but used as adj.): Ease. Maisuuran (pact. plc. m. sing. acc.): Gentle; Easy.. Maisaratun (n. place and time): Easiness.. Maisir (n.): Gambling."
    },

    {
        "indexid":287,
        "wordid":4453,
        "word":"تَصَدَّقُوا",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word تَصَدَّقُوا comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    }]}