{"data":[
    {
        "indexid":2887,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":2887,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2887,
        "wordid":3569,
        "word":"الْقُرْءَانُ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانُ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":2887,
        "wordid":3819,
        "word":"وَاحِدَةً",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةً comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":2887,
        "wordid":7346,
        "word":"نُزِّلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word نُزِّلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":2887,
        "wordid":10412,
        "word":"فُؤَادَكَ",
        "rootid":960,
        "rootword":"ف ا د",
        "meanings":"to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind.",
        "sentence":"The word فُؤَادَكَ comes from the root ف ا د and is associated with the meanings: to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind."
    },

    {
        "indexid":2887,
        "wordid":14234,
        "word":"جُمْلَةً",
        "rootid":310,
        "rootword":"ج م ل",
        "meanings":"To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope.",
        "sentence":"The word جُمْلَةً comes from the root ج م ل and is associated with the meanings: To collect a thing or things, to be beautiful, comely in person, good in action\/behaviour\/moral character, to be moderate, to be pleasing\/kind, handsome, decorous\/honourable\/gracious, to be elegant, to aggregate or make something complete, [Jaml] male camel; ship; palm tree; large sea fish or whale; twisted rope."
    },

    {
        "indexid":2887,
        "wordid":14235,
        "word":"لِنُثَبِّتَ",
        "rootid":68,
        "rootword":"ث ب ت",
        "meanings":"to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed).",
        "sentence":"The word لِنُثَبِّتَ comes from the root ث ب ت and is associated with the meanings: to be firm\/steadfast\/constant\/established, remain in (a place), preserve in doing. thabbata - to strengthen\/fasten\/consolidate. thubuut - steadfastness, stability, firmly planted. thaabit - remaining firmly fixed, firm, steadfast. thabbata - to confirm\/establish, steadfast. tathbiit - confirmation, establishment. athbataa - to confirm, keep in bonds, confine, restrain (from doing a deed)."
    },

    {
        "indexid":2887,
        "wordid":14236,
        "word":"وَرَتَّلْنَاهُ",
        "rootid":1058,
        "rootword":"ر ت ل",
        "meanings":"to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant.",
        "sentence":"The word وَرَتَّلْنَاهُ comes from the root ر ت ل and is associated with the meanings: to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant."
    },

    {
        "indexid":2887,
        "wordid":14237,
        "word":"تَرْتِيلًا",
        "rootid":1058,
        "rootword":"ر ت ل",
        "meanings":"to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant.",
        "sentence":"The word تَرْتِيلًا comes from the root ر ت ل and is associated with the meanings: to set in order, make even, well arranged\/set together, make distinct, correct\/right state of arrangement (primary usage is in relation to nice teeth), read\/recite in a leisurely manner, read correctly, chant."
    }]}