{"data":[
    {
        "indexid":289,
        "wordid":4459,
        "word":"مُسَمًّى",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word مُسَمًّى comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":289,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":289,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":289,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":289,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":289,
        "wordid":4470,
        "word":"رَبَّهُ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":289,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":289,
        "wordid":3334,
        "word":"وَيُعَلِّمُكُمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَيُعَلِّمُكُمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":289,
        "wordid":4466,
        "word":"عَلَّمَهُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلَّمَهُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":289,
        "wordid":4456,
        "word":"تَدَايَنْتُمْ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word تَدَايَنْتُمْ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":289,
        "wordid":4457,
        "word":"بِدَيْنٍ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word بِدَيْنٍ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":289,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":289,
        "wordid":4499,
        "word":"وَأَقْوَمُ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word وَأَقْوَمُ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":289,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":4487,
        "word":"تَضِلَّ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word تَضِلَّ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":289,
        "wordid":4460,
        "word":"فَاكْتُبُوهُ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word فَاكْتُبُوهُ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4461,
        "word":"وَلْيَكْتُبْ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word وَلْيَكْتُبْ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4462,
        "word":"كَاتِبٌ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كَاتِبٌ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4465,
        "word":"يَكْتُبَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word يَكْتُبَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4467,
        "word":"فَلْيَكْتُبْ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word فَلْيَكْتُبْ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4494,
        "word":"تَكْتُبُوهُ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word تَكْتُبُوهُ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4506,
        "word":"تَكْتُبُوهَا",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word تَكْتُبُوهَا comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":289,
        "wordid":4502,
        "word":"تَرْتَابُوا",
        "rootid":1347,
        "rootword":"ر ي ب",
        "meanings":"to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge.",
        "sentence":"The word تَرْتَابُوا comes from the root ر ي ب and is associated with the meanings: to make uncertain, cast one into doubt, calamity, suspicion, disturb, cause doubt, cause uneasiness of mind, cause affliction, create evil opinion, make false charge."
    },

    {
        "indexid":289,
        "wordid":2465,
        "word":"وَاتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word وَاتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":289,
        "wordid":4469,
        "word":"وَلْيَتَّقِ",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word وَلْيَتَّقِ comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":289,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":289,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":289,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":289,
        "wordid":2571,
        "word":"مِنْهُ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":289,
        "wordid":3056,
        "word":"مِمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِمَّنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":289,
        "wordid":4490,
        "word":"الْأُخْرَى",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْأُخْرَى comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":289,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":289,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":289,
        "wordid":3669,
        "word":"تَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":289,
        "wordid":4481,
        "word":"يَكُونَا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونَا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":289,
        "wordid":4472,
        "word":"سَفِيهًا",
        "rootid":1018,
        "rootword":"س ف ه",
        "meanings":"to be foolish\/stupid\/silly\/fickle\/ignorant\/imprudent, want of judgement, folly, light or witted, to become unwise, lose the mind, deem anyone foolish, destroy, deny miserably, levity, one who is foolish.",
        "sentence":"The word سَفِيهًا comes from the root س ف ه and is associated with the meanings: to be foolish\/stupid\/silly\/fickle\/ignorant\/imprudent, want of judgement, folly, light or witted, to become unwise, lose the mind, deem anyone foolish, destroy, deny miserably, levity, one who is foolish."
    },

    {
        "indexid":289,
        "wordid":4503,
        "word":"تِجَارَةً",
        "rootid":202,
        "rootword":"ت ج ر",
        "meanings":"to traffic\/trade, be in business, commerce, merchandise, dealt, sold & bought, employed property for the purpose of gain.",
        "sentence":"The word تِجَارَةً comes from the root ت ج ر and is associated with the meanings: to traffic\/trade, be in business, commerce, merchandise, dealt, sold & bought, employed property for the purpose of gain."
    },

    {
        "indexid":289,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":289,
        "wordid":2304,
        "word":"بِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word بِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":289,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":289,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":289,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":289,
        "wordid":4492,
        "word":"دُعُوا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دُعُوا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":289,
        "wordid":4478,
        "word":"وَاسْتَشْهِدُوا",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word وَاسْتَشْهِدُوا comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4479,
        "word":"شَهِيدَيْنِ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شَهِيدَيْنِ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4486,
        "word":"الشُّهَدَاءِ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word الشُّهَدَاءِ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4491,
        "word":"الشُّهَدَاءُ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word الشُّهَدَاءُ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4500,
        "word":"لِلشَّهَادَةِ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word لِلشَّهَادَةِ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4507,
        "word":"وَأَشْهِدُوا",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word وَأَشْهِدُوا comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":4510,
        "word":"شَهِيدٌ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word شَهِيدٌ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":289,
        "wordid":2228,
        "word":"تَفْعَلُوا",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word تَفْعَلُوا comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":289,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":289,
        "wordid":4511,
        "word":"فُسُوقٌ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word فُسُوقٌ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":289,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":289,
        "wordid":4464,
        "word":"يَأْبَ",
        "rootid":1575,
        "rootword":"ا ب ي",
        "meanings":"refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant.",
        "sentence":"The word يَأْبَ comes from the root ا ب ي and is associated with the meanings: refuse\/refrain\/abstain voluntarily, held back, disagree\/reject\/dislike\/disapprove\/hate, incompliant\/unyielding\/resistant."
    },

    {
        "indexid":289,
        "wordid":4496,
        "word":"كَبِيرًا",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرًا comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":289,
        "wordid":4489,
        "word":"فَتُذَكِّرَ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word فَتُذَكِّرَ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":289,
        "wordid":4463,
        "word":"بِالْعَدْلِ",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word بِالْعَدْلِ comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":289,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":289,
        "wordid":4501,
        "word":"وَأَدْنَى",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word وَأَدْنَى comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":289,
        "wordid":4477,
        "word":"وَلِيُّهُ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word وَلِيُّهُ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":289,
        "wordid":3630,
        "word":"بَيْنَكُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَكُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":289,
        "wordid":4505,
        "word":"تُدِيرُونَهَا",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word تُدِيرُونَهَا comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":289,
        "wordid":4488,
        "word":"إِحْدَاهُمَا",
        "rootid":876,
        "rootword":"ا ح د",
        "meanings":"make\/call it one, unity, anyone\/anything.ahada ashara (eleven).",
        "sentence":"The word إِحْدَاهُمَا comes from the root ا ح د and is associated with the meanings: make\/call it one, unity, anyone\/anything.ahada ashara (eleven)."
    },

    {
        "indexid":289,
        "wordid":4484,
        "word":"وَامْرَأَتَانِ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word وَامْرَأَتَانِ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":289,
        "wordid":4509,
        "word":"يُضَارَّ",
        "rootid":753,
        "rootword":"ض ر ر",
        "meanings":"to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity.",
        "sentence":"The word يُضَارَّ comes from the root ض ر ر and is associated with the meanings: to harm\/hurt\/injure\/afflict, make inconvenient, annoy, evil adversity, famine, vicissitude of time, disease\/death, loss\/tribulation\/hardship, to compel, drive forcibly, driven by necessity."
    },

    {
        "indexid":289,
        "wordid":4169,
        "word":"فَلَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word فَلَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":289,
        "wordid":4485,
        "word":"تَرْضَوْنَ",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word تَرْضَوْنَ comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":289,
        "wordid":4468,
        "word":"وَلْيُمْلِلِ",
        "rootid":997,
        "rootword":"م ل ل",
        "meanings":"to dictate, embrace a religion, creed\/faith.",
        "sentence":"The word وَلْيُمْلِلِ comes from the root م ل ل and is associated with the meanings: to dictate, embrace a religion, creed\/faith."
    },

    {
        "indexid":289,
        "wordid":4475,
        "word":"يُمِلَّ",
        "rootid":997,
        "rootword":"م ل ل",
        "meanings":"to dictate, embrace a religion, creed\/faith.",
        "sentence":"The word يُمِلَّ comes from the root م ل ل and is associated with the meanings: to dictate, embrace a religion, creed\/faith."
    },

    {
        "indexid":289,
        "wordid":4476,
        "word":"فَلْيُمْلِلْ",
        "rootid":997,
        "rootword":"م ل ل",
        "meanings":"to dictate, embrace a religion, creed\/faith.",
        "sentence":"The word فَلْيُمْلِلْ comes from the root م ل ل and is associated with the meanings: to dictate, embrace a religion, creed\/faith."
    },

    {
        "indexid":289,
        "wordid":4504,
        "word":"حَاضِرَةً",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word حَاضِرَةً comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    },

    {
        "indexid":289,
        "wordid":3731,
        "word":"جُنَاحٌ",
        "rootid":1378,
        "rootword":"ج ن ح",
        "meanings":"to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame.",
        "sentence":"The word جُنَاحٌ comes from the root ج ن ح and is associated with the meanings: to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame."
    },

    {
        "indexid":289,
        "wordid":4474,
        "word":"يَسْتَطِيعُ",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word يَسْتَطِيعُ comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":289,
        "wordid":4480,
        "word":"رِجَالِكُمْ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رِجَالِكُمْ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":289,
        "wordid":4482,
        "word":"رَجُلَيْنِ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word رَجُلَيْنِ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":289,
        "wordid":4483,
        "word":"فَرَجُلٌ",
        "rootid":1362,
        "rootword":"ر ج ل",
        "meanings":"to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet.",
        "sentence":"The word فَرَجُلٌ comes from the root ر ج ل and is associated with the meanings: to go on foot, urge with foot, walk, tie by the feet, let (a female) suckle her young, be curly (hair), set free with his mother. rajjala - to comfort anyone, comb the hair, grant a respite. tarajjala - to go down without rope. rijlatun - vigour in walking. rijlun - foot, soldiers, good walker, tramp. arajil - hunters, pedestrian. rajulun - male human being, man, a person with heir. rajilun - foot, footmen (slow walkers). rijlain - two feet. arjul (pl.) - feet."
    },

    {
        "indexid":289,
        "wordid":4458,
        "word":"أَجَلٍ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلٍ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":289,
        "wordid":4497,
        "word":"أَجَلِهِ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلِهِ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":289,
        "wordid":4473,
        "word":"ضَعِيفًا",
        "rootid":75,
        "rootword":"ض ع ف",
        "meanings":"to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again.",
        "sentence":"The word ضَعِيفًا comes from the root ض ع ف and is associated with the meanings: to be weak\/feeble\/infirm. To think repute, esteem, treat or hold a person weak. To exceed, twofold, manyfold, double, triple, multiple words. Like, an equal portion or as much again."
    },

    {
        "indexid":289,
        "wordid":4508,
        "word":"تَبَايَعْتُمْ",
        "rootid":18,
        "rootword":"ب ي ع",
        "meanings":"Selling or buyingExchanging or exchange of propertyGaining mastery over someone, superceding or occupying their place also by superior power or forceMaking a covenant, an engagement, a contract (e.g. promising allegiance, swearing, oaths)Hire or hiring of landSealing the deal, also striking together hand of two contracting parties in token of the ratification of saleManner of selling\/buyingAn article of merchandise",
        "sentence":"The word تَبَايَعْتُمْ comes from the root ب ي ع and is associated with the meanings: Selling or buyingExchanging or exchange of propertyGaining mastery over someone, superceding or occupying their place also by superior power or forceMaking a covenant, an engagement, a contract (e.g. promising allegiance, swearing, oaths)Hire or hiring of landSealing the deal, also striking together hand of two contracting parties in token of the ratification of saleManner of selling\/buyingAn article of merchandise"
    },

    {
        "indexid":289,
        "wordid":4471,
        "word":"يَبْخَسْ",
        "rootid":60,
        "rootword":"ب خ س",
        "meanings":"diminish\/lessen it, made it deficient\/defective\/faulty, deprive\/defraud, act wrongfully\/unjustly.",
        "sentence":"The word يَبْخَسْ comes from the root ب خ س and is associated with the meanings: diminish\/lessen it, made it deficient\/defective\/faulty, deprive\/defraud, act wrongfully\/unjustly."
    },

    {
        "indexid":289,
        "wordid":4493,
        "word":"تَسْءَمُوا",
        "rootid":1418,
        "rootword":"س ا م",
        "meanings":"turn away in disgust, be averse, disgusted\/loathed\/nauseated it, have little patience, to feel disclaim\/dislike\/scorn, weary\/tire.",
        "sentence":"The word تَسْءَمُوا comes from the root س ا م and is associated with the meanings: turn away in disgust, be averse, disgusted\/loathed\/nauseated it, have little patience, to feel disclaim\/dislike\/scorn, weary\/tire."
    },

    {
        "indexid":289,
        "wordid":4495,
        "word":"صَغِيرًا",
        "rootid":992,
        "rootword":"ص غ ر",
        "meanings":"to be small\/little. saaghirun - one who is small\/little\/subdued\/abject or in a state of subjection. saghiir - small. asghar - smaller. saghaar - vileness, contempt, humiliation.",
        "sentence":"The word صَغِيرًا comes from the root ص غ ر and is associated with the meanings: to be small\/little. saaghirun - one who is small\/little\/subdued\/abject or in a state of subjection. saghiir - small. asghar - smaller. saghaar - vileness, contempt, humiliation."
    },

    {
        "indexid":289,
        "wordid":4498,
        "word":"أَقْسَطُ",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word أَقْسَطُ comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    }]}