{"data":[
    {
        "indexid":2902,
        "wordid":2195,
        "word":"جَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word جَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2902,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":2902,
        "wordid":4682,
        "word":"اللَّيْلَ",
        "rootid":102,
        "rootword":"ل ي ل",
        "meanings":"night, evening. layl n.m. (f. laylah, pl. layali)",
        "sentence":"The word اللَّيْلَ comes from the root ل ي ل and is associated with the meanings: night, evening. layl n.m. (f. laylah, pl. layali)"
    },

    {
        "indexid":2902,
        "wordid":4685,
        "word":"النَّهَارَ",
        "rootid":321,
        "rootword":"ن ه ر",
        "meanings":"to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk).",
        "sentence":"The word النَّهَارَ comes from the root ن ه ر and is associated with the meanings: to cause stream to flow, repulse, reproach, flow abundantly, drive back, brow beat, chide, do in the day time, day, daytime, daylight hours (from dawn to dusk)."
    },

    {
        "indexid":2902,
        "wordid":6913,
        "word":"وَجَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":2902,
        "wordid":8081,
        "word":"لِبَاسًا",
        "rootid":1623,
        "rootword":"ل ب س",
        "meanings":"To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb.",
        "sentence":"The word لِبَاسًا comes from the root ل ب س and is associated with the meanings: To wear\/cover, put on a garment, be clothed in, envelop, conceal, conformed, Obscure\/confuse\/confound, mystify, render a thing obscure and confused to another.Employed\/busied\/occupied himself with\/within a thing, become involved\/entangled\/complicated, to mix\/mingle\/accompany a thing. labasa vb."
    },

    {
        "indexid":2902,
        "wordid":14178,
        "word":"نُشُورًا",
        "rootid":993,
        "rootword":"ن ش ر",
        "meanings":"to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad.",
        "sentence":"The word نُشُورًا comes from the root ن ش ر and is associated with the meanings: to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad."
    },

    {
        "indexid":2902,
        "wordid":14264,
        "word":"وَالنَّوْمَ",
        "rootid":1421,
        "rootword":"ن و م",
        "meanings":"to sleep, slumber, become calm, abate, dull, be numbed, dose.",
        "sentence":"The word وَالنَّوْمَ comes from the root ن و م and is associated with the meanings: to sleep, slumber, become calm, abate, dull, be numbed, dose."
    },

    {
        "indexid":2902,
        "wordid":14265,
        "word":"سُبَاتًا",
        "rootid":627,
        "rootword":"س ب ت",
        "meanings":"to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless.",
        "sentence":"The word سُبَاتًا comes from the root س ب ت and is associated with the meanings: to take rest, cease from work, repose, keep the Sabbath, be confused\/perplexed\/confounded, cut, stop, sleep, unfold, Sabbath-day, week, addicted to sleep, rest\/lethargic\/motionless."
    }]}