{"data":[
    {
        "indexid":2918,
        "wordid":2002,
        "word":"الرَّحْمَنِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الرَّحْمَنِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":2918,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":2918,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2918,
        "wordid":8803,
        "word":"يَمْشُونَ",
        "rootid":466,
        "rootword":"م ش ي",
        "meanings":"To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about.",
        "sentence":"The word يَمْشُونَ comes from the root م ش ي and is associated with the meanings: To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about."
    },

    {
        "indexid":2918,
        "wordid":10238,
        "word":"سَلَامًا",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word سَلَامًا comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":2918,
        "wordid":14297,
        "word":"وَعِبَادُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word وَعِبَادُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":2918,
        "wordid":14298,
        "word":"هَوْنًا",
        "rootid":470,
        "rootword":"ه و ن",
        "meanings":"to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn.",
        "sentence":"The word هَوْنًا comes from the root ه و ن and is associated with the meanings: to be light, vile, owe, despicable, quiet, become weak, gentle, contemptible, base. hawwana - to facilitate, despise, condemn. ahaana - to despise, scorn."
    },

    {
        "indexid":2918,
        "wordid":14299,
        "word":"خَاطَبَهُمُ",
        "rootid":598,
        "rootword":"خ ط ب",
        "meanings":"To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration.",
        "sentence":"The word خَاطَبَهُمُ comes from the root خ ط ب and is associated with the meanings: To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration."
    },

    {
        "indexid":2918,
        "wordid":14300,
        "word":"الْجَاهِلُونَ",
        "rootid":443,
        "rootword":"ج ه ل",
        "meanings":"To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan.",
        "sentence":"The word الْجَاهِلُونَ comes from the root ج ه ل and is associated with the meanings: To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan."
    }]}