{"data":[
    {
        "indexid":2920,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":2920,
        "wordid":2752,
        "word":"يَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":2920,
        "wordid":3160,
        "word":"رَبَّنَا",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّنَا comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":2920,
        "wordid":3753,
        "word":"عَذَابَ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابَ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":2920,
        "wordid":4549,
        "word":"عَنَّا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنَّا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":2920,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":2920,
        "wordid":14303,
        "word":"اصْرِفْ",
        "rootid":903,
        "rootword":"ص ر ف",
        "meanings":"to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside.",
        "sentence":"The word اصْرِفْ comes from the root ص ر ف and is associated with the meanings: to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside."
    },

    {
        "indexid":2920,
        "wordid":14304,
        "word":"عَذَابَهَا",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابَهَا comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":2920,
        "wordid":14305,
        "word":"غَرَامًا",
        "rootid":141,
        "rootword":"غ ر م",
        "meanings":"paid, discharged, gave against will, taking upon oneself that which is not obligatory upon him; damage or loss that befalls a man in his property; lasting evil, perdition; shacked or burdened or captived",
        "sentence":"The word غَرَامًا comes from the root غ ر م and is associated with the meanings: paid, discharged, gave against will, taking upon oneself that which is not obligatory upon him; damage or loss that befalls a man in his property; lasting evil, perdition; shacked or burdened or captived"
    }]}