{"data":[
    {
        "indexid":2964,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":2964,
        "wordid":3446,
        "word":"مُبِينٌ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٌ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":2964,
        "wordid":8391,
        "word":"فَأَلْقَى",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَأَلْقَى comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":2964,
        "wordid":8392,
        "word":"عَصَاهُ",
        "rootid":774,
        "rootword":"ع ص و",
        "meanings":"to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people.",
        "sentence":"The word عَصَاهُ comes from the root ع ص و and is associated with the meanings: to strike with a stick. asiya\/ya'sa - to take a stick, come together, collection, accumulation, amazing, gathering, assemblage, congregation. asa - staff, stick, rod, supports, nation, mastery, people, party, tongue, skin, bone. idrib bi asaka al hajer - strike with your staff on the rock, go forth with your people."
    },

    {
        "indexid":2964,
        "wordid":8393,
        "word":"ثُعْبَانٌ",
        "rootid":1327,
        "rootword":"ث ع ب",
        "meanings":"to cause to flow, give bent to.",
        "sentence":"The word ثُعْبَانٌ comes from the root ث ع ب and is associated with the meanings: to cause to flow, give bent to."
    }]}