{"data":[
    {
        "indexid":2970,
        "wordid":4280,
        "word":"يَوْمٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":2970,
        "wordid":8410,
        "word":"السَّحَرَةُ",
        "rootid":1083,
        "rootword":"س ح ر",
        "meanings":"To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding.",
        "sentence":"The word السَّحَرَةُ comes from the root س ح ر and is associated with the meanings: To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding."
    },

    {
        "indexid":2970,
        "wordid":11327,
        "word":"مَعْلُومٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word مَعْلُومٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":2970,
        "wordid":14378,
        "word":"فَجُمِعَ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word فَجُمِعَ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":2970,
        "wordid":14379,
        "word":"لِمِيقَاتِ",
        "rootid":1516,
        "rootword":"و ق ت",
        "meanings":"to fix, defined\/determined\/limited a thing as to time, appoint\/declare\/assign a time, measure of time (e.g. season).",
        "sentence":"The word لِمِيقَاتِ comes from the root و ق ت and is associated with the meanings: to fix, defined\/determined\/limited a thing as to time, appoint\/declare\/assign a time, measure of time (e.g. season)."
    }]}