{"data":[
    {
        "indexid":299,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":299,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":299,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":299,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":299,
        "wordid":2340,
        "word":"الْحَكِيمُ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word الْحَكِيمُ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":299,
        "wordid":2868,
        "word":"يَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word يَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":299,
        "wordid":3180,
        "word":"الْعَزِيزُ",
        "rootid":1786,
        "rootword":"ع ز ز",
        "meanings":"mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun.",
        "sentence":"The word الْعَزِيزُ comes from the root ع ز ز and is associated with the meanings: mighty\/potent\/powerful\/strong, noble\/honourable\/glorious, resisted\/withstood, invincible, overcome (e.g. in argument), exalt, prevail, highly esteemed, precious, glory, vanity, excellent, proud and hard manner, stern.. uzza - name of an idol of the pagan Arabs regarded by them as God's daughter.. . 'Azza (prf. 3rd. m. sing. asim. V): Prevailed.. 'Azzaznaa (prf. 1st. pl. II): We strengthened.. Tu'izzu (impf. 2nd. m. pl. II): thou honour, confer honour and dignity.. 'Izzan (v. n.): source of strength.. 'Izzatun (v. n.): vain pride, false prestige or sense of self respect, might honour, power.. Al-Aziizun (act. pic. m. sing.): All-Mighty, One of the names of Allah, Unassailable, invincible, powerful in evidences and arguments, strong, mighty, heavy (with 'alaa: tell hard upon).. A'azzu (elative): more powerful, that occupies stronger and more respectable position.. A'izzatan (n. pl.): most respectable and powerful, its sing. is 'Aziiyun."
    },

    {
        "indexid":299,
        "wordid":3397,
        "word":"إِلَهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word إِلَهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":299,
        "wordid":4560,
        "word":"يُصَوِّرُكُمْ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word يُصَوِّرُكُمْ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":299,
        "wordid":4561,
        "word":"الْأَرْحَامِ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word الْأَرْحَامِ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    }]}