{"data":[
    {
        "indexid":3015,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3015,
        "wordid":4758,
        "word":"هَبْ",
        "rootid":838,
        "rootword":"و ه ب",
        "meanings":"to give\/grant\/bestow, dedicate, offer as a present\/gift.",
        "sentence":"The word هَبْ comes from the root و ه ب and is associated with the meanings: to give\/grant\/bestow, dedicate, offer as a present\/gift."
    },

    {
        "indexid":3015,
        "wordid":6865,
        "word":"حُكْمًا",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حُكْمًا comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":3015,
        "wordid":10890,
        "word":"وَأَلْحِقْنِي",
        "rootid":591,
        "rootword":"ل ح ق",
        "meanings":"To overtake, reach, attain, catch up, cleave, join, become or made himself on a par, ensue, affiliate, coherent with. lahiqa vb.",
        "sentence":"The word وَأَلْحِقْنِي comes from the root ل ح ق and is associated with the meanings: To overtake, reach, attain, catch up, cleave, join, become or made himself on a par, ensue, affiliate, coherent with. lahiqa vb."
    },

    {
        "indexid":3015,
        "wordid":10891,
        "word":"بِالصَّالِحِينَ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word بِالصَّالِحِينَ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    }]}