{"data":[
    {
        "indexid":3028,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3028,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3028,
        "wordid":4799,
        "word":"يَخْتَصِمُونَ",
        "rootid":57,
        "rootword":"خ ص م",
        "meanings":"Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something.",
        "sentence":"The word يَخْتَصِمُونَ comes from the root خ ص م and is associated with the meanings: Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something."
    }]}