{"data":[
    {
        "indexid":3138,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3138,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3138,
        "wordid":2854,
        "word":"جَاءَهُمْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَهُمْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":3138,
        "wordid":12815,
        "word":"يُوعَدُونَ",
        "rootid":732,
        "rootword":"و ع د",
        "meanings":"to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise.",
        "sentence":"The word يُوعَدُونَ comes from the root و ع د and is associated with the meanings: to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise."
    }]}