{"data":[
    {
        "indexid":3165,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3165,
        "wordid":6109,
        "word":"الْقُرْءَانَ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانَ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":3165,
        "wordid":8408,
        "word":"عَلِيمٍ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٍ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3165,
        "wordid":10011,
        "word":"لَدُنْ",
        "rootid":1731,
        "rootword":"ل د ن",
        "meanings":"At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same.",
        "sentence":"The word لَدُنْ comes from the root ل د ن and is associated with the meanings: At; near; with; from; presence; in the presence of; for. Ladun: Particle of a place or preposition.Ladai\/Lida = At; near; with; from; presence; in the presence of; for. A particle of place or preposition. The meanings of Ladun and Ladai and Lida are the same."
    },

    {
        "indexid":3165,
        "wordid":10012,
        "word":"حَكِيمٍ",
        "rootid":459,
        "rootword":"ح ك م",
        "meanings":"To restrain from, exercise authority, command, give judgment, judge, be wise.",
        "sentence":"The word حَكِيمٍ comes from the root ح ك م and is associated with the meanings: To restrain from, exercise authority, command, give judgment, judge, be wise."
    },

    {
        "indexid":3165,
        "wordid":14556,
        "word":"لَتُلَقَّى",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word لَتُلَقَّى comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}