{"data":[
    {
        "indexid":3229,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3229,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3229,
        "wordid":4880,
        "word":"تَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3229,
        "wordid":7766,
        "word":"يَمْكُرُونَ",
        "rootid":1090,
        "rootword":"م ك ر",
        "meanings":"To practice deceit or guile or circumvention, practice evasion or elusion, to plot, to excercise art or craft or cunning, act with policy, practice strategem.",
        "sentence":"The word يَمْكُرُونَ comes from the root م ك ر and is associated with the meanings: To practice deceit or guile or circumvention, practice evasion or elusion, to plot, to excercise art or craft or cunning, act with policy, practice strategem."
    },

    {
        "indexid":3229,
        "wordid":9284,
        "word":"تَحْزَنْ",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word تَحْزَنْ comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":3229,
        "wordid":11770,
        "word":"ضَيْقٍ",
        "rootid":686,
        "rootword":"ض ي ق",
        "meanings":"Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition.",
        "sentence":"The word ضَيْقٍ comes from the root ض ي ق and is associated with the meanings: Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition."
    }]}