{"data":[
    {
        "indexid":326,
        "wordid":2007,
        "word":"الْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":326,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":326,
        "wordid":3198,
        "word":"اصْطَفَى",
        "rootid":206,
        "rootword":"ص ف و",
        "meanings":"it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh.",
        "sentence":"The word اصْطَفَى comes from the root ص ف و and is associated with the meanings: it became clear\/limpid\/pure (often said of a drink), opposite of Kaf-Dal-Ra, free from turbidness\/thickness\/muddiness, free from admixture, became cloudless (said of air\/atmosphere, but also said of love\/life\/mind\/heart), clear\/pure\/best\/choice\/favoured part\/potion, clear\/clarify, true\/sincere, distinguish particularly\/specially, select\/elect\/prefer, serenity of life, comfort, reciprocal sincerity\/purity.. take the best of, to choose in preference to, grant to another a preference in the choice of anything.. abound with milk (said of a she-camel\/ewe\/goat\/sheep), palm-tree heavy with fruit,. reached stone (said of a digger).. the portion of the spoil, which the chief\/commander chooses for himself before the division.. become destitute\/devoid.. stone, smooth stone\/rock, stone that doesn't give growth to anything, hard broad stone, a certain place in Mekkeh."
    },

    {
        "indexid":326,
        "wordid":4718,
        "word":"وَنُوحًا",
        "rootid":194,
        "rootword":"ن و ح",
        "meanings":"Noah\/Nuh. To lament, wail, coo.",
        "sentence":"The word وَنُوحًا comes from the root ن و ح and is associated with the meanings: Noah\/Nuh. To lament, wail, coo."
    },

    {
        "indexid":326,
        "wordid":4719,
        "word":"وَءَالَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word وَءَالَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":326,
        "wordid":4720,
        "word":"عِمْرَانَ",
        "rootid":507,
        "rootword":"ع م ر",
        "meanings":"to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age.",
        "sentence":"The word عِمْرَانَ comes from the root ع م ر and is associated with the meanings: to inhabit, dwell, mend, repair\/revive, tend, build, promote, cultivate, make habitable, to make better, to develop, populate, to serve\/uphold\/observe\/regard, to visit, to colonize, aimed at it, frequently visit, a visit in which is the cultivation of love\/affection, repairing to an inhabited place.perform a sacred visitation, minor pilgrimmage, pilgrimmage with fewer rites.to remain alive (save life), to live, life, age, long-life, old-age."
    }]}