{"data":[
    {
        "indexid":3261,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3261,
        "wordid":2089,
        "word":"يَشْعُرُونَ",
        "rootid":1335,
        "rootword":"ش ع ر",
        "meanings":"to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to.",
        "sentence":"The word يَشْعُرُونَ comes from the root ش ع ر and is associated with the meanings: to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to."
    },

    {
        "indexid":3261,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":3261,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3261,
        "wordid":2479,
        "word":"فِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":3261,
        "wordid":3042,
        "word":"وَقَالَتِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَتِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3261,
        "wordid":3074,
        "word":"وَلَدًا",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word وَلَدًا comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":3261,
        "wordid":4724,
        "word":"امْرَأَتُ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word امْرَأَتُ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":3261,
        "wordid":10518,
        "word":"يَنْفَعَنَا",
        "rootid":744,
        "rootword":"ن ف ع",
        "meanings":"to profit, do good, be useful, beneficial.",
        "sentence":"The word يَنْفَعَنَا comes from the root ن ف ع and is associated with the meanings: to profit, do good, be useful, beneficial."
    },

    {
        "indexid":3261,
        "wordid":10519,
        "word":"نَتَّخِذَهُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word نَتَّخِذَهُ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":3261,
        "wordid":12528,
        "word":"عَيْنٍ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عَيْنٍ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":3261,
        "wordid":14786,
        "word":"قُرَّتُ",
        "rootid":190,
        "rootword":"ق ر ر",
        "meanings":"to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals.",
        "sentence":"The word قُرَّتُ comes from the root ق ر ر and is associated with the meanings: to be or become cool, remain quiet, be steadfast, be firm, refresh, be stable, be firm, receive satisfy, affirm, agree, settle, last. qarar - stability, a fixed or secure place, depository, place ahead. qurratun - coolness, delight. aqarra (vb. 4) - to confirm, cause to rest or remain. istaqarra (vb. 10) - to remain firm. mustaqirrun - that which remains firmly fixed or confirmed, in hiding, is lasting, which certainly comes to pass, which is settled in its being\/goal\/purpose. mustaqar - firmly fixed\/established, sojourn, abode. qurratun - coolness, refreshment, source of joy and comfort. qawarir (pl. of qaruratun) - glasses, crystals."
    },

    {
        "indexid":3261,
        "wordid":14788,
        "word":"تَقْتُلُوهُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word تَقْتُلُوهُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    }]}