{"data":[
    {
        "indexid":3262,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3262,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3262,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3262,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3262,
        "wordid":9965,
        "word":"لِتَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word لِتَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3262,
        "wordid":14777,
        "word":"أُمِّ",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word أُمِّ comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    },

    {
        "indexid":3262,
        "wordid":14789,
        "word":"وَأَصْبَحَ",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word وَأَصْبَحَ comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    },

    {
        "indexid":3262,
        "wordid":14790,
        "word":"فُؤَادُ",
        "rootid":960,
        "rootword":"ف ا د",
        "meanings":"to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind.",
        "sentence":"The word فُؤَادُ comes from the root ف ا د and is associated with the meanings: to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind."
    },

    {
        "indexid":3262,
        "wordid":14791,
        "word":"فَارِغًا",
        "rootid":714,
        "rootword":"ف ر غ",
        "meanings":"to be empty, vacant, to finish a thing, cease from, be unoccupied, be free from (other things)",
        "sentence":"The word فَارِغًا comes from the root ف ر غ and is associated with the meanings: to be empty, vacant, to finish a thing, cease from, be unoccupied, be free from (other things)"
    },

    {
        "indexid":3262,
        "wordid":14792,
        "word":"كَادَتْ",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word كَادَتْ comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":3262,
        "wordid":14793,
        "word":"لَتُبْدِي",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word لَتُبْدِي comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    },

    {
        "indexid":3262,
        "wordid":14794,
        "word":"رَبَطْنَا",
        "rootid":292,
        "rootword":"ر ب ط",
        "meanings":"to tie\/fasten\/bind\/conform\/strengthen, lay (anchor), be firm, stationed on (e.g. the enemy's frontier), keep post, keep\/apply yourself preseveringly to something, remain on or at something, army, equip, fortify, brace, be ever ready, make ready for an impact. ribat - body of horse, strungs.",
        "sentence":"The word رَبَطْنَا comes from the root ر ب ط and is associated with the meanings: to tie\/fasten\/bind\/conform\/strengthen, lay (anchor), be firm, stationed on (e.g. the enemy's frontier), keep post, keep\/apply yourself preseveringly to something, remain on or at something, army, equip, fortify, brace, be ever ready, make ready for an impact. ribat - body of horse, strungs."
    },

    {
        "indexid":3262,
        "wordid":14795,
        "word":"قَلْبِهَا",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قَلْبِهَا comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    }]}