{"data":[
    {
        "indexid":3275,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3275,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3275,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":3275,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3275,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3275,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3275,
        "wordid":3167,
        "word":"أُمَّةً",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word أُمَّةً comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    },

    {
        "indexid":3275,
        "wordid":3855,
        "word":"كَبِيرٌ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرٌ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":3275,
        "wordid":4752,
        "word":"وَجَدَ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word وَجَدَ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":3275,
        "wordid":12530,
        "word":"وَوَجَدَ",
        "rootid":1338,
        "rootword":"و ج د",
        "meanings":"to find what was lost, perceive, obtain, find any one or anything (such and such).",
        "sentence":"The word وَوَجَدَ comes from the root و ج د and is associated with the meanings: to find what was lost, perceive, obtain, find any one or anything (such and such)."
    },

    {
        "indexid":3275,
        "wordid":14836,
        "word":"وَرَدَ",
        "rootid":1446,
        "rootword":"و ر د",
        "meanings":"to be present, arrive at (any water to drink), go down into, draw near to (a place).",
        "sentence":"The word وَرَدَ comes from the root و ر د and is associated with the meanings: to be present, arrive at (any water to drink), go down into, draw near to (a place)."
    },

    {
        "indexid":3275,
        "wordid":14837,
        "word":"مَاءَ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءَ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":3275,
        "wordid":14838,
        "word":"يَسْقُونَ",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word يَسْقُونَ comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":3275,
        "wordid":14839,
        "word":"دُونِهِمُ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِهِمُ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":3275,
        "wordid":14840,
        "word":"امْرَأَتَيْنِ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word امْرَأَتَيْنِ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":3275,
        "wordid":14841,
        "word":"تَذُودَانِ",
        "rootid":674,
        "rootword":"ذ و د",
        "meanings":"hold\/keep back, drive away, dispel, repel, prevent.",
        "sentence":"The word تَذُودَانِ comes from the root ذ و د and is associated with the meanings: hold\/keep back, drive away, dispel, repel, prevent."
    },

    {
        "indexid":3275,
        "wordid":14842,
        "word":"خَطْبُكُمَا",
        "rootid":598,
        "rootword":"خ ط ب",
        "meanings":"To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration.",
        "sentence":"The word خَطْبُكُمَا comes from the root خ ط ب and is associated with the meanings: To recite\/deliver an exhortation or admonition to the people, ask or demand a woman in marriage, talk\/speak\/converse or discourse with one, address one face-to-face, accost one with speech or words, consult with one, decide a case\/pass sentence\/judge with evident demonstration or proof or testimony confirmed by oath, have something within one's reach or power, hold a dialogue, seek or desire to do a thing, give a sermon\/speech\/oration."
    },

    {
        "indexid":3275,
        "wordid":14843,
        "word":"قَالَتَا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتَا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3275,
        "wordid":14844,
        "word":"نَسْقِي",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word نَسْقِي comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":3275,
        "wordid":14845,
        "word":"يُصْدِرَ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word يُصْدِرَ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    },

    {
        "indexid":3275,
        "wordid":14846,
        "word":"الرِّعَاءُ",
        "rootid":811,
        "rootword":"ر ع ي",
        "meanings":"to pasture\/feed\/graze, observe aright, keep (an order), rule, have regard to, tend, mindful, watch, pay attention. One who feeds flocks, shepherd. ri'ayatun - right observance. mar'an - pasture. ra'a (vb. 3) - to observe\/respect, look at, listen, give ear, hearken. ra'ina - listen to us (a phrase used also for showing disrespect for the person addressed).",
        "sentence":"The word الرِّعَاءُ comes from the root ر ع ي and is associated with the meanings: to pasture\/feed\/graze, observe aright, keep (an order), rule, have regard to, tend, mindful, watch, pay attention. One who feeds flocks, shepherd. ri'ayatun - right observance. mar'an - pasture. ra'a (vb. 3) - to observe\/respect, look at, listen, give ear, hearken. ra'ina - listen to us (a phrase used also for showing disrespect for the person addressed)."
    },

    {
        "indexid":3275,
        "wordid":14847,
        "word":"وَأَبُونَا",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word وَأَبُونَا comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":3275,
        "wordid":14848,
        "word":"شَيْخٌ",
        "rootid":412,
        "rootword":"ش ي خ",
        "meanings":"to be old, old\/aged man.",
        "sentence":"The word شَيْخٌ comes from the root ش ي خ and is associated with the meanings: to be old, old\/aged man."
    }]}