{"data":[
    {
        "indexid":3346,
        "wordid":2007,
        "word":"الْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3346,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3346,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3346,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":3346,
        "wordid":10006,
        "word":"لِنَفْسِهِ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word لِنَفْسِهِ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":3346,
        "wordid":11117,
        "word":"لَغَنِيٌّ",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word لَغَنِيٌّ comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":3346,
        "wordid":15007,
        "word":"جَاهَدَ",
        "rootid":398,
        "rootword":"ج ه د",
        "meanings":"To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties.",
        "sentence":"The word جَاهَدَ comes from the root ج ه د and is associated with the meanings: To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties."
    },

    {
        "indexid":3346,
        "wordid":15008,
        "word":"يُجَاهِدُ",
        "rootid":398,
        "rootword":"ج ه د",
        "meanings":"To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties.",
        "sentence":"The word يُجَاهِدُ comes from the root ج ه د and is associated with the meanings: To strive or labour or toil, exert oneself or his power or efforts, employ oneself vigorously or diligently or studiously, take extra pains, put oneself to trouble or fatigue, examine someone or something, to burden or weaken or fatigue beyond one's power, churn and extract from a thing, very eagerly desire or long for something, lay upon or compress, become manifest, to fight for a cause, be in a state of extreme difficulty or trouble, meditate upon something, to overload (such as a camel or cattle), strive after, struggle against difficulties."
    }]}