{"data":[
    {
        "indexid":336,
        "wordid":2441,
        "word":"مَعَ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":336,
        "wordid":2442,
        "word":"الرَّاكِعِينَ",
        "rootid":971,
        "rootword":"ر ك ع",
        "meanings":"bowed, bent, incline, humility, humble yourself, lower the head.",
        "sentence":"The word الرَّاكِعِينَ comes from the root ر ك ع and is associated with the meanings: bowed, bent, incline, humility, humble yourself, lower the head."
    },

    {
        "indexid":336,
        "wordid":4754,
        "word":"يَامَرْيَمُ",
        "rootid":1302,
        "rootword":"م ر ي م",
        "meanings":"Mariam, Mary",
        "sentence":"The word يَامَرْيَمُ comes from the root م ر ي م and is associated with the meanings: Mariam, Mary"
    },

    {
        "indexid":336,
        "wordid":4787,
        "word":"اقْنُتِي",
        "rootid":583,
        "rootword":"ق ن ت",
        "meanings":"to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient.",
        "sentence":"The word اقْنُتِي comes from the root ق ن ت and is associated with the meanings: to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient."
    },

    {
        "indexid":336,
        "wordid":4788,
        "word":"لِرَبِّكِ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word لِرَبِّكِ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":336,
        "wordid":4789,
        "word":"وَاسْجُدِي",
        "rootid":1596,
        "rootword":"س ج د",
        "meanings":"lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done.",
        "sentence":"The word وَاسْجُدِي comes from the root س ج د and is associated with the meanings: lowly, humble, submissive, worship, adore, prostrate, make obeisance, lower\/bend oneself down towards the ground, lower the head, to salute\/honour\/magnify, to pay respect, to stand up, to look continuedly and tranquily.MSJD - parts of a man that are the places of SJD, e.g. forehead\/nose\/hands\/knees\/feet etc. Any mode\/place\/practice in which the act of SJD is done."
    },

    {
        "indexid":336,
        "wordid":4790,
        "word":"وَارْكَعِي",
        "rootid":971,
        "rootword":"ر ك ع",
        "meanings":"bowed, bent, incline, humility, humble yourself, lower the head.",
        "sentence":"The word وَارْكَعِي comes from the root ر ك ع and is associated with the meanings: bowed, bent, incline, humility, humble yourself, lower the head."
    }]}