{"data":[
    {
        "indexid":3360,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3360,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3360,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3360,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":3360,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3360,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3360,
        "wordid":2187,
        "word":"قَدِيرٌ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word قَدِيرٌ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":3360,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":3360,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3360,
        "wordid":5219,
        "word":"فَانْظُرُوا",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَانْظُرُوا comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":3360,
        "wordid":5297,
        "word":"الْءَاخِرَةَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":3360,
        "wordid":7245,
        "word":"سِيرُوا",
        "rootid":1176,
        "rootword":"س ي ر",
        "meanings":"to go, travel, be current, move, journey. sairun - the act of giving, journey. siratun - state\/condition, make\/form. sayyaratun - company of travellers, caravan",
        "sentence":"The word سِيرُوا comes from the root س ي ر and is associated with the meanings: to go, travel, be current, move, journey. sairun - the act of giving, journey. siratun - state\/condition, make\/form. sayyaratun - company of travellers, caravan"
    },

    {
        "indexid":3360,
        "wordid":9691,
        "word":"الْخَلْقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word الْخَلْقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":3360,
        "wordid":15041,
        "word":"بَدَأَ",
        "rootid":361,
        "rootword":"ب د ا",
        "meanings":"Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs.",
        "sentence":"The word بَدَأَ comes from the root ب د ا and is associated with the meanings: Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs."
    },

    {
        "indexid":3360,
        "wordid":15042,
        "word":"يُنْشِئُ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word يُنْشِئُ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    },

    {
        "indexid":3360,
        "wordid":15043,
        "word":"النَّشْأَةَ",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word النَّشْأَةَ comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    }]}