{"data":[
    {
        "indexid":3373,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3373,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3373,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3373,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3373,
        "wordid":2759,
        "word":"وَقَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3373,
        "wordid":2887,
        "word":"كَانَتْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَتْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3373,
        "wordid":6766,
        "word":"رُسُلُنَا",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word رُسُلُنَا comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":3373,
        "wordid":7703,
        "word":"جَاءَتْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَتْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":3373,
        "wordid":8317,
        "word":"الْغَابِرِينَ",
        "rootid":1613,
        "rootword":"غ ب ر",
        "meanings":"remained, lasted, continued, tarried, stayed, waited, passed\/went away, recrudescent, dust-colored",
        "sentence":"The word الْغَابِرِينَ comes from the root غ ب ر and is associated with the meanings: remained, lasted, continued, tarried, stayed, waited, passed\/went away, recrudescent, dust-colored"
    },

    {
        "indexid":3373,
        "wordid":9284,
        "word":"تَحْزَنْ",
        "rootid":1105,
        "rootword":"ح ز ن",
        "meanings":"To grieve.",
        "sentence":"The word تَحْزَنْ comes from the root ح ز ن and is associated with the meanings: To grieve."
    },

    {
        "indexid":3373,
        "wordid":10134,
        "word":"وَأَهْلَكَ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word وَأَهْلَكَ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":3373,
        "wordid":10246,
        "word":"تَخَفْ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word تَخَفْ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":3373,
        "wordid":10273,
        "word":"لُوطًا",
        "rootid":7,
        "rootword":"ل و ط",
        "meanings":"Also see Lam-Tay Lut",
        "sentence":"The word لُوطًا comes from the root ل و ط and is associated with the meanings: Also see Lam-Tay Lut"
    },

    {
        "indexid":3373,
        "wordid":10274,
        "word":"سِيءَ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سِيءَ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":3373,
        "wordid":10275,
        "word":"وَضَاقَ",
        "rootid":686,
        "rootword":"ض ي ق",
        "meanings":"Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition.",
        "sentence":"The word وَضَاقَ comes from the root ض ي ق and is associated with the meanings: Became narrow or strait. Became choked, surcharged, or overfilled with something.Treated or behave towards someone with hardness or harshness.Means of living became straitened, property went away, poor.An evil state of condition."
    },

    {
        "indexid":3373,
        "wordid":10276,
        "word":"ذَرْعًا",
        "rootid":1154,
        "rootword":"ذ ر ع",
        "meanings":"to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride.",
        "sentence":"The word ذَرْعًا comes from the root ذ ر ع and is associated with the meanings: to measure by the cubit, stretch the forefeet in walk, lower (a camel) for riding, overcome, strangle from behind, raise and stretch forth the arm (in swimming), stretching forth of the hand, spread widely, strength\/power, measure, length, forearm, forefoot, cubit, rod of cubit of 22 3\/4 inches, length of the arm to the elbow to the extremity of the middle finger.Fall short of the affair, prevent, withold, felt helpless, means, ability, limit.Talk\/walk much, long stride."
    },

    {
        "indexid":3373,
        "wordid":10297,
        "word":"امْرَأَتَكَ",
        "rootid":1214,
        "rootword":"م ر ا",
        "meanings":"It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying).",
        "sentence":"The word امْرَأَتَكَ comes from the root م ر ا and is associated with the meanings: It (food) was wholesome or approved in its result, easy to swallow, not attended by trouble, quick in digesting, light to the stomach, to descend well, to be salubrious in its air (land), in the habit of doing what is approved and shunning what is held base, preserve the soul from filthy actions, to be possessed of manly perfection or manly virtue or moral goodness, give food (on the occasion of building a house or marrying)."
    },

    {
        "indexid":3373,
        "wordid":15065,
        "word":"مُنَجُّوكَ",
        "rootid":171,
        "rootword":"ن ج و",
        "meanings":"to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide.",
        "sentence":"The word مُنَجُّوكَ comes from the root ن ج و and is associated with the meanings: to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide."
    }]}