{"data":[
    {
        "indexid":3378,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3378,
        "wordid":2617,
        "word":"وَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3378,
        "wordid":2727,
        "word":"وَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":3378,
        "wordid":3013,
        "word":"السَّبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word السَّبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":3378,
        "wordid":3021,
        "word":"تَبَيَّنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word تَبَيَّنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3378,
        "wordid":3438,
        "word":"أَعْمَالَهُمْ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالَهُمْ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":3378,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":3378,
        "wordid":7371,
        "word":"وَزَيَّنَ",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word وَزَيَّنَ comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":3378,
        "wordid":13208,
        "word":"مَسَاكِنِهِمْ",
        "rootid":14,
        "rootword":"س ك ن",
        "meanings":"to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering.",
        "sentence":"The word مَسَاكِنِهِمْ comes from the root س ك ن and is associated with the meanings: to be quiet, rest\/repose\/dwell\/lodge, inhabit, stop\/still, subside. Tranquillity, security, mercy, blessing. masakin - poor\/destitute\/weak\/penniless, humble\/submissive, one who is in a state of lowliness\/humiliation\/abasement\/submissiveness, one who cannot move to earn his livelihood because of his physical\/mental\/financial disability. sikkin - knife, as it is cause of making still after slaughtering."
    },

    {
        "indexid":3378,
        "wordid":14245,
        "word":"وَعَادًا",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word وَعَادًا comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":3378,
        "wordid":14626,
        "word":"فَصَدَّهُمْ",
        "rootid":1069,
        "rootword":"ص د د",
        "meanings":"to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water.",
        "sentence":"The word فَصَدَّهُمْ comes from the root ص د د and is associated with the meanings: to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water."
    },

    {
        "indexid":3378,
        "wordid":15071,
        "word":"مُسْتَبْصِرِينَ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word مُسْتَبْصِرِينَ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    }]}