{"data":[
    {
        "indexid":3405,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3405,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3405,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3405,
        "wordid":3199,
        "word":"الدِّينَ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word الدِّينَ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":3405,
        "wordid":7074,
        "word":"الْبَرِّ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word الْبَرِّ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":3405,
        "wordid":8099,
        "word":"مُخْلِصِينَ",
        "rootid":1228,
        "rootword":"خ ل ص",
        "meanings":"To be pure\/genuine\/unmixed\/clear, to be safe\/secure\/free from embarrassment or difficulty or destruction, to withdraw\/retire\/part from the company of people, to come\/approach\/reach, make a thing clear or pure, explain\/expound\/interpret, act with reciprocal purity towards someone, to be pure and sincere, to appropriate a thing or person purely to oneself, to purely or sincerely believe (free of hypocrisy).",
        "sentence":"The word مُخْلِصِينَ comes from the root خ ل ص and is associated with the meanings: To be pure\/genuine\/unmixed\/clear, to be safe\/secure\/free from embarrassment or difficulty or destruction, to withdraw\/retire\/part from the company of people, to come\/approach\/reach, make a thing clear or pure, explain\/expound\/interpret, act with reciprocal purity towards someone, to be pure and sincere, to appropriate a thing or person purely to oneself, to purely or sincerely believe (free of hypocrisy)."
    },

    {
        "indexid":3405,
        "wordid":8241,
        "word":"الْفُلْكِ",
        "rootid":362,
        "rootword":"ف ل ك",
        "meanings":"become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round.",
        "sentence":"The word الْفُلْكِ comes from the root ف ل ك and is associated with the meanings: become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round."
    },

    {
        "indexid":3405,
        "wordid":8790,
        "word":"يُشْرِكُونَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word يُشْرِكُونَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":3405,
        "wordid":9759,
        "word":"دَعَوُا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دَعَوُا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":3405,
        "wordid":15112,
        "word":"رَكِبُوا",
        "rootid":491,
        "rootword":"ر ك ب",
        "meanings":"to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend.",
        "sentence":"The word رَكِبُوا comes from the root ر ك ب and is associated with the meanings: to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend."
    },

    {
        "indexid":3405,
        "wordid":15113,
        "word":"نَجَّاهُمْ",
        "rootid":171,
        "rootword":"ن ج و",
        "meanings":"to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide.",
        "sentence":"The word نَجَّاهُمْ comes from the root ن ج و and is associated with the meanings: to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide."
    }]}