{"data":[
    {
        "indexid":3461,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3461,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3461,
        "wordid":2704,
        "word":"الْمَوْتَى",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتَى comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":3461,
        "wordid":9202,
        "word":"مُدْبِرِينَ",
        "rootid":595,
        "rootword":"د ب ر",
        "meanings":"to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting.",
        "sentence":"The word مُدْبِرِينَ comes from the root د ب ر and is associated with the meanings: to turn the back, flee, follow after, be behind, become old, take a thing away, veer to the west wind, elapse (day, night), follow with respect.Back, hinder part, the last, extremity, that which comes after, at the end of, extreme, last remnant, uttermost part.To dispose, manage, govern, consider, the issues or results of the affairs or the case, perform or execute the affair with thought or consideration, devise or plan the affair with thought or consideration, devise or plan the affair, regulate.Consequence, result.idbar = retreat, withdrawal, setting."
    },

    {
        "indexid":3461,
        "wordid":9833,
        "word":"تُسْمِعُ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word تُسْمِعُ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":3461,
        "wordid":9834,
        "word":"الصُّمَّ",
        "rootid":605,
        "rootword":"ص م م",
        "meanings":"to be deaf, cork (a bottle), stop (a flask), be obstructed (ear-hole).",
        "sentence":"The word الصُّمَّ comes from the root ص م م and is associated with the meanings: to be deaf, cork (a bottle), stop (a flask), be obstructed (ear-hole)."
    },

    {
        "indexid":3461,
        "wordid":11942,
        "word":"وَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word وَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":3461,
        "wordid":13325,
        "word":"الدُّعَاءَ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word الدُّعَاءَ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    }]}