{"data":[
    {
        "indexid":3488,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3488,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3488,
        "wordid":15248,
        "word":"وَاقْصِدْ",
        "rootid":1687,
        "rootword":"ق ص د",
        "meanings":"to intend, be moderate, steer a middle course, go or proceed straight away, aim at, intend, repair, purpose, act moderately. qasdun - the right way, middle path, right direction, leading the right path, aim, intention, straight and right road, just. qasidun - easy or moderate (journey). muqtasidun - one who keeps to the right and moderate path, who falls between the two extremes or upper limit and lower limit, of good intentions.",
        "sentence":"The word وَاقْصِدْ comes from the root ق ص د and is associated with the meanings: to intend, be moderate, steer a middle course, go or proceed straight away, aim at, intend, repair, purpose, act moderately. qasdun - the right way, middle path, right direction, leading the right path, aim, intention, straight and right road, just. qasidun - easy or moderate (journey). muqtasidun - one who keeps to the right and moderate path, who falls between the two extremes or upper limit and lower limit, of good intentions."
    },

    {
        "indexid":3488,
        "wordid":15249,
        "word":"مَشْيِكَ",
        "rootid":466,
        "rootword":"م ش ي",
        "meanings":"To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about.",
        "sentence":"The word مَشْيِكَ comes from the root م ش ي and is associated with the meanings: To walk, to go or go along, to go afoot\/on foot, move from place to place, march\/travel\/trod\/pace\/step, to go on or continue in a course of action, to pass, to be current, move\/be in motion, walk about."
    },

    {
        "indexid":3488,
        "wordid":15250,
        "word":"وَاغْضُضْ",
        "rootid":1048,
        "rootword":"غ ض ض",
        "meanings":"lowered, contracted, lessened",
        "sentence":"The word وَاغْضُضْ comes from the root غ ض ض and is associated with the meanings: lowered, contracted, lessened"
    },

    {
        "indexid":3488,
        "wordid":15251,
        "word":"صَوْتِكَ",
        "rootid":79,
        "rootword":"ص و ت",
        "meanings":"to emit a sound, utter a cry. saut (pl. aswat) - voice, sound.",
        "sentence":"The word صَوْتِكَ comes from the root ص و ت and is associated with the meanings: to emit a sound, utter a cry. saut (pl. aswat) - voice, sound."
    },

    {
        "indexid":3488,
        "wordid":15252,
        "word":"أَنْكَرَ",
        "rootid":1601,
        "rootword":"ن ك ر",
        "meanings":"to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge.",
        "sentence":"The word أَنْكَرَ comes from the root ن ك ر and is associated with the meanings: to dislike, be unacquainted with, disown, disapprove with tongue or punishment, be hard, difficult, feel a repugnance towards, make charge."
    },

    {
        "indexid":3488,
        "wordid":15253,
        "word":"الْأَصْوَاتِ",
        "rootid":79,
        "rootword":"ص و ت",
        "meanings":"to emit a sound, utter a cry. saut (pl. aswat) - voice, sound.",
        "sentence":"The word الْأَصْوَاتِ comes from the root ص و ت and is associated with the meanings: to emit a sound, utter a cry. saut (pl. aswat) - voice, sound."
    },

    {
        "indexid":3488,
        "wordid":15254,
        "word":"لَصَوْتُ",
        "rootid":79,
        "rootword":"ص و ت",
        "meanings":"to emit a sound, utter a cry. saut (pl. aswat) - voice, sound.",
        "sentence":"The word لَصَوْتُ comes from the root ص و ت and is associated with the meanings: to emit a sound, utter a cry. saut (pl. aswat) - voice, sound."
    },

    {
        "indexid":3488,
        "wordid":15255,
        "word":"الْحَمِيرِ",
        "rootid":407,
        "rootword":"ح م ر",
        "meanings":"To excoriate, pare a thong of leather, flay (sheep), strip off superficial part (e.g. peel, bark, etc..)",
        "sentence":"The word الْحَمِيرِ comes from the root ح م ر and is associated with the meanings: To excoriate, pare a thong of leather, flay (sheep), strip off superficial part (e.g. peel, bark, etc..)"
    }]}