{"data":[
    {
        "indexid":3501,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3501,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3501,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3501,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3501,
        "wordid":3199,
        "word":"الدِّينَ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word الدِّينَ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":3501,
        "wordid":4215,
        "word":"فَمِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3501,
        "wordid":7074,
        "word":"الْبَرِّ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word الْبَرِّ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":3501,
        "wordid":8099,
        "word":"مُخْلِصِينَ",
        "rootid":1228,
        "rootword":"خ ل ص",
        "meanings":"To be pure\/genuine\/unmixed\/clear, to be safe\/secure\/free from embarrassment or difficulty or destruction, to withdraw\/retire\/part from the company of people, to come\/approach\/reach, make a thing clear or pure, explain\/expound\/interpret, act with reciprocal purity towards someone, to be pure and sincere, to appropriate a thing or person purely to oneself, to purely or sincerely believe (free of hypocrisy).",
        "sentence":"The word مُخْلِصِينَ comes from the root خ ل ص and is associated with the meanings: To be pure\/genuine\/unmixed\/clear, to be safe\/secure\/free from embarrassment or difficulty or destruction, to withdraw\/retire\/part from the company of people, to come\/approach\/reach, make a thing clear or pure, explain\/expound\/interpret, act with reciprocal purity towards someone, to be pure and sincere, to appropriate a thing or person purely to oneself, to purely or sincerely believe (free of hypocrisy)."
    },

    {
        "indexid":3501,
        "wordid":9759,
        "word":"دَعَوُا",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word دَعَوُا comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":3501,
        "wordid":13614,
        "word":"كَفُورٍ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفُورٍ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3501,
        "wordid":14073,
        "word":"مَوْجٌ",
        "rootid":1599,
        "rootword":"م و ج",
        "meanings":"To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side.",
        "sentence":"The word مَوْجٌ comes from the root م و ج and is associated with the meanings: To be in a state of commotion, to be agitated, tumultuous, conflict or dash, to be in a confused and disturbed state, perplexed or amazed, move backwards and forwards, move from side to side."
    },

    {
        "indexid":3501,
        "wordid":15093,
        "word":"يَجْحَدُ",
        "rootid":735,
        "rootword":"ج ح د",
        "meanings":"To deny or disacknowledge a thing, to be niggardly or avaricious, poor or possess little good, dissipated or dispersed, little in quantity, scanty.",
        "sentence":"The word يَجْحَدُ comes from the root ج ح د and is associated with the meanings: To deny or disacknowledge a thing, to be niggardly or avaricious, poor or possess little good, dissipated or dispersed, little in quantity, scanty."
    },

    {
        "indexid":3501,
        "wordid":15113,
        "word":"نَجَّاهُمْ",
        "rootid":171,
        "rootword":"ن ج و",
        "meanings":"to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide.",
        "sentence":"The word نَجَّاهُمْ comes from the root ن ج و and is associated with the meanings: to be saved, delivered, rescued, escape, go free. najaa\/najwan - to whisper (a secret), confide."
    },

    {
        "indexid":3501,
        "wordid":15276,
        "word":"كَالظُّلَلِ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word كَالظُّلَلِ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    },

    {
        "indexid":3501,
        "wordid":15277,
        "word":"مُقْتَصِدٌ",
        "rootid":1687,
        "rootword":"ق ص د",
        "meanings":"to intend, be moderate, steer a middle course, go or proceed straight away, aim at, intend, repair, purpose, act moderately. qasdun - the right way, middle path, right direction, leading the right path, aim, intention, straight and right road, just. qasidun - easy or moderate (journey). muqtasidun - one who keeps to the right and moderate path, who falls between the two extremes or upper limit and lower limit, of good intentions.",
        "sentence":"The word مُقْتَصِدٌ comes from the root ق ص د and is associated with the meanings: to intend, be moderate, steer a middle course, go or proceed straight away, aim at, intend, repair, purpose, act moderately. qasdun - the right way, middle path, right direction, leading the right path, aim, intention, straight and right road, just. qasidun - easy or moderate (journey). muqtasidun - one who keeps to the right and moderate path, who falls between the two extremes or upper limit and lower limit, of good intentions."
    },

    {
        "indexid":3501,
        "wordid":15278,
        "word":"خَتَّارٍ",
        "rootid":1186,
        "rootword":"خ ت ر",
        "meanings":"Be agitated by a tendency to vomit (the soul or stomach) and thus be in a corrupt or disordered state, act or behave towards another with treachery\/perfidy\/unfaithfulness (or with deceit, guile or circumvention), behave towards one in a bad or corrupt manner, corrupt or disorder one's soul or stomach and render him relaxed (said of wine or beverage), to be languid and relaxed\/heavy\/sluggish\/fevered, languid in body in consequence of disease.",
        "sentence":"The word خَتَّارٍ comes from the root خ ت ر and is associated with the meanings: Be agitated by a tendency to vomit (the soul or stomach) and thus be in a corrupt or disordered state, act or behave towards another with treachery\/perfidy\/unfaithfulness (or with deceit, guile or circumvention), behave towards one in a bad or corrupt manner, corrupt or disorder one's soul or stomach and render him relaxed (said of wine or beverage), to be languid and relaxed\/heavy\/sluggish\/fevered, languid in body in consequence of disease."
    }]}