{"data":[
    {
        "indexid":3510,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3510,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3510,
        "wordid":4434,
        "word":"كُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3510,
        "wordid":4878,
        "word":"خَلَقَهُ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَهُ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":3510,
        "wordid":6332,
        "word":"خَلْقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلْقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":3510,
        "wordid":7205,
        "word":"طِينٍ",
        "rootid":671,
        "rootword":"ط ي ن",
        "meanings":"to plaster with clay or mud, clay\/mud.",
        "sentence":"The word طِينٍ comes from the root ط ي ن and is associated with the meanings: to plaster with clay or mud, clay\/mud."
    },

    {
        "indexid":3510,
        "wordid":7946,
        "word":"أَحْسَنَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word أَحْسَنَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":3510,
        "wordid":12065,
        "word":"الْإِنْسَانِ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانِ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":3510,
        "wordid":15295,
        "word":"وَبَدَأَ",
        "rootid":361,
        "rootword":"ب د ا",
        "meanings":"Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs.",
        "sentence":"The word وَبَدَأَ comes from the root ب د ا and is associated with the meanings: Be first, have precedenceBegan, made beginnings of (something\/thought\/opinion\/idea\/military expedition)Made\/produced\/created for the first time\/originallyCommence\/started\/originated\/brought into existenceGoing forth from a land to another\/sick person (afflicted with disease)A new thing\/unknown before, invent, Strange and wonderful\/unexpected\/surprisingDoing it again from the beginning\/returning from where you cameChief\/Lord (occupying first place in leadership\/chieftainship\/lordshipAn intelligent youth whose opinion\/judgment is goodShare\/portion of an animal, or the best share thereofMan continuing to war\/plunder, experienced in affairs."
    }]}