{"data":[
    {
        "indexid":354,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":354,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":354,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":354,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":354,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":354,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":354,
        "wordid":2400,
        "word":"فَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":354,
        "wordid":3111,
        "word":"جَاءَكَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَكَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":354,
        "wordid":3112,
        "word":"الْعِلْمِ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعِلْمِ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":354,
        "wordid":4646,
        "word":"فَقُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word فَقُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":354,
        "wordid":4881,
        "word":"حَاجَّكَ",
        "rootid":374,
        "rootword":"ح ج ج",
        "meanings":"to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain.",
        "sentence":"The word حَاجَّكَ comes from the root ح ج ج and is associated with the meanings: to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain."
    },

    {
        "indexid":354,
        "wordid":4882,
        "word":"تَعَالَوْا",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word تَعَالَوْا comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":354,
        "wordid":4883,
        "word":"نَدْعُ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word نَدْعُ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":354,
        "wordid":4884,
        "word":"أَبْنَاءَنَا",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word أَبْنَاءَنَا comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":354,
        "wordid":4885,
        "word":"وَأَبْنَاءَكُمْ",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word وَأَبْنَاءَكُمْ comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":354,
        "wordid":4886,
        "word":"وَنِسَاءَنَا",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word وَنِسَاءَنَا comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":354,
        "wordid":4887,
        "word":"وَنِسَاءَكُمْ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word وَنِسَاءَكُمْ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":354,
        "wordid":4888,
        "word":"وَأَنْفُسَنَا",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word وَأَنْفُسَنَا comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":354,
        "wordid":4889,
        "word":"وَأَنْفُسَكُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word وَأَنْفُسَكُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":354,
        "wordid":4890,
        "word":"نَبْتَهِلْ",
        "rootid":1251,
        "rootword":"ب ه ل",
        "meanings":"left to his own will\/wish\/opinion\/judgment, humbled\/abased himself, addressed himself with earnest\/energetic supplication, strive, sincere without hypocrisy, act of cursing.",
        "sentence":"The word نَبْتَهِلْ comes from the root ب ه ل and is associated with the meanings: left to his own will\/wish\/opinion\/judgment, humbled\/abased himself, addressed himself with earnest\/energetic supplication, strive, sincere without hypocrisy, act of cursing."
    },

    {
        "indexid":354,
        "wordid":4891,
        "word":"فَنَجْعَلْ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word فَنَجْعَلْ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":354,
        "wordid":4892,
        "word":"لَعْنَتَ",
        "rootid":84,
        "rootword":"ل ع ن",
        "meanings":"To drive away, execrate, deprive one of mercy and blessings, condemn, curse.The base or lower part of a palm-tree.",
        "sentence":"The word لَعْنَتَ comes from the root ل ع ن and is associated with the meanings: To drive away, execrate, deprive one of mercy and blessings, condemn, curse.The base or lower part of a palm-tree."
    },

    {
        "indexid":354,
        "wordid":4893,
        "word":"الْكَاذِبِينَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word الْكَاذِبِينَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    }]}