{"data":[
    {
        "indexid":3545,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3545,
        "wordid":2066,
        "word":"قُلُوبِهِمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبِهِمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":3545,
        "wordid":2077,
        "word":"يَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3545,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3545,
        "wordid":2091,
        "word":"مَرَضٌ",
        "rootid":1602,
        "rootword":"م ر ض",
        "meanings":"To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion).",
        "sentence":"The word مَرَضٌ comes from the root م ر ض and is associated with the meanings: To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion)."
    },

    {
        "indexid":3545,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3545,
        "wordid":6338,
        "word":"غُرُورًا",
        "rootid":1092,
        "rootword":"غ ر ر",
        "meanings":"deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities",
        "sentence":"The word غُرُورًا comes from the root غ ر ر and is associated with the meanings: deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities"
    },

    {
        "indexid":3545,
        "wordid":6896,
        "word":"وَرَسُولُهُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَرَسُولُهُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":3545,
        "wordid":8152,
        "word":"وَعَدَنَا",
        "rootid":732,
        "rootword":"و ع د",
        "meanings":"to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise.",
        "sentence":"The word وَعَدَنَا comes from the root و ع د and is associated with the meanings: to promise, give one's word, threaten, promise good, threaten (depending on context).. . Wa'ada act (pr.f 3rd. p. m. sing.): He promised.. Wa'adta (prf. 2nd. p. m. sing.): Thou promised.. Wa'adtu (prf. 1st. p. m. sing.): I promised.. Wa'aduu (prf. 3rd. p. plu.): They promised.. Wa'adna  (prf. 1st. p. m.): We promise.. Ya'idu (imp. 3rd. p. m. sing.): He promises, threatens.. 'Id (prt. m. sing.): promise.. Wu'ida (pp. 3rd. p. sing.): Has been promised.. Yuu'aduuna (pip. 3rd. p. plu.): They were threatened.. Tu'aduuna  (pip. 2nd. p. plu.) You are promised, are threatened.. Mau'uud (pic. pact. n. sing.): Promised.. Tuu'aduuna  (imp. 2nd. p. m. plu. II.): (Punishment which) you are promised.. Waa'adna (imp. 1st. p. plu. III.): We made an appointment, a promise.. Tawaa'dtum (prf. 2nd. p. m. plu.): Ye have mutually appointed.. Laa Tawaa'duu  (prt. neg. m.plu.): Do not appoint mutually; Make no agreement or promises.. Wa'iid (act. 2nd. pic. m. sing.): Threatening; Threat; Warning.. Mau'idan (n. place): Time; Place or time of the fulfilment of a prediction; Promise or warning; Appointment for meeting a promise.. Mii'aad  (for Miu'aad; n. place): Time; Time or place of the promise."
    },

    {
        "indexid":3545,
        "wordid":9012,
        "word":"الْمُنَافِقُونَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word الْمُنَافِقُونَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    }]}