{"data":[
    {
        "indexid":3568,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3568,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3568,
        "wordid":2274,
        "word":"كَثِيرًا",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرًا comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":3568,
        "wordid":3507,
        "word":"وَالصَّابِرِينَ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word وَالصَّابِرِينَ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":3568,
        "wordid":4377,
        "word":"مَغْفِرَةً",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word مَغْفِرَةً comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":3568,
        "wordid":4634,
        "word":"وَالصَّادِقِينَ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word وَالصَّادِقِينَ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":3568,
        "wordid":4635,
        "word":"وَالْقَانِتِينَ",
        "rootid":583,
        "rootword":"ق ن ت",
        "meanings":"to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient.",
        "sentence":"The word وَالْقَانِتِينَ comes from the root ق ن ت and is associated with the meanings: to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient."
    },

    {
        "indexid":3568,
        "wordid":5808,
        "word":"عَظِيمًا",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عَظِيمًا comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":3568,
        "wordid":6269,
        "word":"أَعَدَّ",
        "rootid":247,
        "rootword":"ع د د",
        "meanings":"to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number.",
        "sentence":"The word أَعَدَّ comes from the root ع د د and is associated with the meanings: to count, number, reckon, make the census of. addun - number, computation, determined number. adadun - number. iddatun - a number, prescribed term, counting, to count, legal waiting period for a woman after she is divorced or becomes a widow before she may marry again. a'dd - to prepare, make ready. addina - those who count. ma'dudun - counted one.. . 'Adda (prf. 3rd. m. sing. assim.): Counted; Numbered.. Ta'udduuna (imp. 2nd. m. plu. assim.): You count.. Ta'udduu (imp. 2nd. m. plu. juss.): You count.. Na'uddu (imp. 1st. pl.): We count.. 'Addada (prf. 3rd. m. sing. assim. II.): Counted.. A'adda (prf. 3rd. m. sing. assim. II): He prepared, made ready.. A'adduu (prf. 3rd. m. plu. assim, IV): They prepared.. U'iddat (pp. 3rd. f. sing. assim. IV): It is prepared.. A'idduu (prt. m. plu. assim. IV): You prepare.. Ta'daduuna (imp. 2nd. m, plu.): You count.. 'Adduuna (act. pic. m. plu. assim): Those who count.. Ma'duudun (pic. p. m. sing.): Counted one.. Ma'duudaatun (pic. p. f. plu.): Counted ones. Its sing. is Ma'duudatun.. 'Adadun (n.): Number; Counting.. 'Iddatun (v. n.): Counting number; To make up the prescribed number."
    },

    {
        "indexid":3568,
        "wordid":7981,
        "word":"الْمُسْلِمِينَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word الْمُسْلِمِينَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":3568,
        "wordid":9431,
        "word":"وَالْمُؤْمِنَاتِ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word وَالْمُؤْمِنَاتِ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3568,
        "wordid":13978,
        "word":"فُرُوجَهُمْ",
        "rootid":1258,
        "rootword":"ف ر ج",
        "meanings":"To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs.",
        "sentence":"The word فُرُوجَهُمْ comes from the root ف ر ج and is associated with the meanings: To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs."
    },

    {
        "indexid":3568,
        "wordid":15451,
        "word":"وَالْمُسْلِمَاتِ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word وَالْمُسْلِمَاتِ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":3568,
        "wordid":15452,
        "word":"وَالْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word وَالْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":3568,
        "wordid":15453,
        "word":"وَالْقَانِتَاتِ",
        "rootid":583,
        "rootword":"ق ن ت",
        "meanings":"to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient.",
        "sentence":"The word وَالْقَانِتَاتِ comes from the root ق ن ت and is associated with the meanings: to be devout, obedient, fully and wholeheartedly in all humility to stand long in prayer. qanitun - one who is fully, wholehearted and in all humility devout and obedient."
    },

    {
        "indexid":3568,
        "wordid":15454,
        "word":"وَالصَّادِقَاتِ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word وَالصَّادِقَاتِ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":3568,
        "wordid":15455,
        "word":"وَالصَّابِرَاتِ",
        "rootid":996,
        "rootword":"ص ب ر",
        "meanings":"to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient.",
        "sentence":"The word وَالصَّابِرَاتِ comes from the root ص ب ر and is associated with the meanings: to bind, be patient or constant, endure patiently, steadily adhere to reason and command, restrain from what reason and law forbid, restrain from manifesting grief, agitation and impatience. The word being the contrary of jaz'a (manifestation of grief and agitation).. . Sabar (prf. 3rd. p.m. sing.): He bore with patience.. Sabaruu (prf. 3rd. p.m. plu.): They bore patiently, patiently preserved.. Sabartum (prf. 2nd. p.m. plu.): You patiently preserved.. Sabarnaa (imp. 1st. p.m. plu.): We patiently preserved.. Yasbir (imp. 3rd. p.m. sing. fuss.): He patiently preserves.. Tasbiru (imp. 2nd. p.m. sing. fuss.): You have patience.. Tasbiruuna\/Tasbiruu (acc. \/imp. 2nd. p.m. plu. juss.): You will patiently preserve.. . Nasbira imp. neg. 1st. p. plu. ): We will not at all remain content.. Nasbiranna (imp. 1st. p. plu.): We will surely endure patiently.. Isbir (prt. m. sing.): Preserve thou (in doing good); Bear patiently; Wait thou patiently.. Isbiruu (prt. in. plu.): Be patiently preserving.. Saabiruu (prt. m. plu. III): Strive to excel in being patiently preserving.. Istabir (prt. in. plu. sing.): Be steadfast.. Sabrun\/Sabran (acc.\/ v. n.): Patience.. Saabiruun\/ Saabiriin (acc. \/act. pic. plu.): Those who are calm and steadfast.. Saabiratun (act. plc. f sing.): Preserving one f.. Saabiraat (act. plc. f. plu.): Preserving women.. Asbara (elative.) : How very enduring.. Sabaar (ints. sing.): Patiently preserving.. Saabiran (act. pic. m. sing. acc.): Patient."
    },

    {
        "indexid":3568,
        "wordid":15456,
        "word":"وَالْخَاشِعِينَ",
        "rootid":1458,
        "rootword":"خ ش ع",
        "meanings":"Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful.",
        "sentence":"The word وَالْخَاشِعِينَ comes from the root خ ش ع and is associated with the meanings: Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful."
    },

    {
        "indexid":3568,
        "wordid":15457,
        "word":"وَالْخَاشِعَاتِ",
        "rootid":1458,
        "rootword":"خ ش ع",
        "meanings":"Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful.",
        "sentence":"The word وَالْخَاشِعَاتِ comes from the root خ ش ع and is associated with the meanings: Lowly\/humble\/submissive, still and low, to lower the eyes or voice, sink\/nearly disappear in a setting place, be eclipsed\/go away, become lean, whither\/dry up, feign lowliness\/humility in demeanour or voice or eyes, eject a thing, bow or bend down the head and body, be fearful."
    },

    {
        "indexid":3568,
        "wordid":15458,
        "word":"وَالْمُتَصَدِّقِينَ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word وَالْمُتَصَدِّقِينَ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":3568,
        "wordid":15459,
        "word":"وَالْمُتَصَدِّقَاتِ",
        "rootid":47,
        "rootword":"ص د ق",
        "meanings":"to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true.",
        "sentence":"The word وَالْمُتَصَدِّقَاتِ comes from the root ص د ق and is associated with the meanings: to be truthful, true, sincere, speak the truth, establish or confirm the truth of what another has said, verify, keep faith, observe a promise faithfully, fulfill, speak veraciously, hold anyone as trustworthy. sadaqa fi al-qitaali - to fight gallantly. tsaddaqa - to give alms. sidqun - truth, veracity, sincerity, soundness, excellence in a variety of different objects, salubrious and agreeable, favourable entrance, praise. saadiqun - one who is true and sincere, one who speaks the truth. saadiqah - perfect woman. sadaqat (pl. saduqaat) - dowry. siddiiq - person who is trustworthy, sincere. saddaqa - to confirm, verify, fulfil. asdaqu - more true."
    },

    {
        "indexid":3568,
        "wordid":15460,
        "word":"وَالصَّائِمِينَ",
        "rootid":792,
        "rootword":"ص و م",
        "meanings":"to fast\/abstain.",
        "sentence":"The word وَالصَّائِمِينَ comes from the root ص و م and is associated with the meanings: to fast\/abstain."
    },

    {
        "indexid":3568,
        "wordid":15461,
        "word":"وَالصَّائِمَاتِ",
        "rootid":792,
        "rootword":"ص و م",
        "meanings":"to fast\/abstain.",
        "sentence":"The word وَالصَّائِمَاتِ comes from the root ص و م and is associated with the meanings: to fast\/abstain."
    },

    {
        "indexid":3568,
        "wordid":15462,
        "word":"وَالْحَافِظِينَ",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word وَالْحَافِظِينَ comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":3568,
        "wordid":15463,
        "word":"وَالْحَافِظَاتِ",
        "rootid":883,
        "rootword":"ح ف ظ",
        "meanings":"To guard, protect, take care of, watch, put in store, preserve, learn by heart.",
        "sentence":"The word وَالْحَافِظَاتِ comes from the root ح ف ظ and is associated with the meanings: To guard, protect, take care of, watch, put in store, preserve, learn by heart."
    },

    {
        "indexid":3568,
        "wordid":15464,
        "word":"وَالذَّاكِرِينَ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word وَالذَّاكِرِينَ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":3568,
        "wordid":15465,
        "word":"وَالذَّاكِرَاتِ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word وَالذَّاكِرَاتِ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":3568,
        "wordid":15466,
        "word":"وَأَجْرًا",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word وَأَجْرًا comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    }]}