{"data":[
    {
        "indexid":359,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":359,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":359,
        "wordid":2211,
        "word":"وَأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word وَأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":359,
        "wordid":2212,
        "word":"تَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":359,
        "wordid":2332,
        "word":"هَؤُلَاءِ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word هَؤُلَاءِ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":359,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":359,
        "wordid":2877,
        "word":"فَلِمَ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word فَلِمَ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":359,
        "wordid":3053,
        "word":"فِيمَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيمَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":359,
        "wordid":3489,
        "word":"لَيْسَ",
        "rootid":17,
        "rootword":"ل ي س",
        "meanings":"It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times.",
        "sentence":"The word لَيْسَ comes from the root ل ي س and is associated with the meanings: It was not; is not. It is one of the verbs of the class of kana which govern the attribute in the accusative. This verb has occurred about 89 times."
    },

    {
        "indexid":359,
        "wordid":4911,
        "word":"تُحَاجُّونَ",
        "rootid":374,
        "rootword":"ح ج ج",
        "meanings":"to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain.",
        "sentence":"The word تُحَاجُّونَ comes from the root ح ج ج and is associated with the meanings: to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain."
    },

    {
        "indexid":359,
        "wordid":4915,
        "word":"هَاأَنْتُمْ",
        "rootid":103,
        "rootword":"ا ن ت م",
        "meanings":"you (plural)",
        "sentence":"The word هَاأَنْتُمْ comes from the root ا ن ت م and is associated with the meanings: you (plural)"
    },

    {
        "indexid":359,
        "wordid":4916,
        "word":"حَاجَجْتُمْ",
        "rootid":374,
        "rootword":"ح ج ج",
        "meanings":"to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain.",
        "sentence":"The word حَاجَجْتُمْ comes from the root ح ج ج and is associated with the meanings: to intend to a certain target, aim at, repair, undertake, repaired\/betook himself to or towards a person \/ place \/ object of veneration\/respect\/honour, went\/visit frequently\/repeatedly, pilgrimage.Overcome another by\/in argument\/evidences\/proofs\/testimonies, plead, contend\/argue\/dispute.Refrain\/abstain."
    },

    {
        "indexid":359,
        "wordid":4917,
        "word":"عِلْمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عِلْمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    }]}