{"data":[
    {
        "indexid":3593,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3593,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":3593,
        "wordid":2066,
        "word":"قُلُوبِهِمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبِهِمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":3593,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3593,
        "wordid":2091,
        "word":"مَرَضٌ",
        "rootid":1602,
        "rootword":"م ر ض",
        "meanings":"To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion).",
        "sentence":"The word مَرَضٌ comes from the root م ر ض and is associated with the meanings: To be diseased\/disordered, distempered, to be ill or sick, languid or weak or feeble, deficient in strength, defective or deficient, to be right or nearly right (in judgement or opinion)."
    },

    {
        "indexid":3593,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3593,
        "wordid":2431,
        "word":"قَلِيلًا",
        "rootid":837,
        "rootword":"ق ل ل",
        "meanings":"to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few.",
        "sentence":"The word قَلِيلًا comes from the root ق ل ل and is associated with the meanings: to be few in number, small in quantity, rare. qalilun - few, little, small, rare, seldom. aqall - fewer, poorer. qallala - to appear as few."
    },

    {
        "indexid":3593,
        "wordid":8440,
        "word":"الْمَدِينَةِ",
        "rootid":1559,
        "rootword":"م د ن",
        "meanings":"city",
        "sentence":"The word الْمَدِينَةِ comes from the root م د ن and is associated with the meanings: city"
    },

    {
        "indexid":3593,
        "wordid":9012,
        "word":"الْمُنَافِقُونَ",
        "rootid":304,
        "rootword":"ن ف ق",
        "meanings":"to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend",
        "sentence":"The word الْمُنَافِقُونَ comes from the root ن ف ق and is associated with the meanings: to be saleable, to come out of a hole, be exhausted (store), consumed, spent, expenditure. To enter into another hole where there is another outlet, so is a hypocrite who professes to believe first one thing and then another, thus entering faith through one door and leaving it through another.nafaqan (n.acc.) hole with another outlet, tunnel.nafaqatun (n.) worthy to be spent, expenditure.nafaqu (prt. 3rd p. m. plu. III) practised hypocrisy.nafaqa (v.) to profess hypocrisy, believe in one thing and then another.munafiqun (m. plu. III acc.) those who are hypocrite.munafiqin (m. plu. III acc.) those who are hypocrite.munafiqat (f. plu. III) hypocrite womennifaq (v. n. III) hypocrisynifaqan (v. n. III acc.) hypocrisyanfaqa (perf. 3rd p. m. sing. IV) he had spentanfaqta (perf. 2nd p. m. sing. IV) thou hath spent.anfaqu (perf. 3rd p. m. plu. IV) they have spentanfaqtum (perf. 2nd p. m. plu. IV) Ye have spentyunfiqu (imp. 3rd p. m. sing. IV) spendstunfiquna (imp. 3rd p. m. plu. IV) Ye spendtunfiqu (imp. 2nd p. m. plu. IV acc.) Ye spendanfiqu prt. m. plu. IV) spendinfaq (v. n. ) spendingmunfiqina (m. plu.) those who spend"
    },

    {
        "indexid":3593,
        "wordid":15558,
        "word":"يَنْتَهِ",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word يَنْتَهِ comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":3593,
        "wordid":15559,
        "word":"وَالْمُرْجِفُونَ",
        "rootid":663,
        "rootword":"ر ج ف",
        "meanings":"to quake\/tremble, be in violent motion, shake violently, ramble, prepare for war, be restless, stir, spread alarming\/false news, engage, make commotion. rajfatun - earthquake, mighty blast. murjifun - scandal-mongers, one who makes a commotion, one who spreads false alarming news.",
        "sentence":"The word وَالْمُرْجِفُونَ comes from the root ر ج ف and is associated with the meanings: to quake\/tremble, be in violent motion, shake violently, ramble, prepare for war, be restless, stir, spread alarming\/false news, engage, make commotion. rajfatun - earthquake, mighty blast. murjifun - scandal-mongers, one who makes a commotion, one who spreads false alarming news."
    },

    {
        "indexid":3593,
        "wordid":15560,
        "word":"لَنُغْرِيَنَّكَ",
        "rootid":610,
        "rootword":"غ ر و",
        "meanings":"glued, made adhere with, attached, fond, desirious, wondered; a certain red dye",
        "sentence":"The word لَنُغْرِيَنَّكَ comes from the root غ ر و and is associated with the meanings: glued, made adhere with, attached, fond, desirious, wondered; a certain red dye"
    },

    {
        "indexid":3593,
        "wordid":15561,
        "word":"يُجَاوِرُونَكَ",
        "rootid":62,
        "rootword":"ج و ر",
        "meanings":"To decline or deviate, act wrongfully or unjustly, to live near or close (to another), to protect, save or rescue, grant refuge.",
        "sentence":"The word يُجَاوِرُونَكَ comes from the root ج و ر and is associated with the meanings: To decline or deviate, act wrongfully or unjustly, to live near or close (to another), to protect, save or rescue, grant refuge."
    }]}