{"data":[
    {
        "indexid":3695,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3695,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3695,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3695,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3695,
        "wordid":2867,
        "word":"فَضْلِهِ",
        "rootid":1434,
        "rootword":"ف ض ل",
        "meanings":"excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace",
        "sentence":"The word فَضْلِهِ comes from the root ف ض ل and is associated with the meanings: excel, distinguish, surpass, superior, gain\/gift, bestow benefit\/bounty\/favour\/grace"
    },

    {
        "indexid":3695,
        "wordid":8555,
        "word":"دَارَ",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word دَارَ comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":3695,
        "wordid":9643,
        "word":"نَصَبٌ",
        "rootid":296,
        "rootword":"ن ص ب",
        "meanings":"to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant.",
        "sentence":"The word نَصَبٌ comes from the root ن ص ب and is associated with the meanings: to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant."
    },

    {
        "indexid":3695,
        "wordid":15800,
        "word":"أَحَلَّنَا",
        "rootid":1297,
        "rootword":"ح ل ل",
        "meanings":"To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve.",
        "sentence":"The word أَحَلَّنَا comes from the root ح ل ل and is associated with the meanings: To untie (a knot), remit (sin), solve (a difficulty), unbind, absolve."
    },

    {
        "indexid":3695,
        "wordid":15801,
        "word":"الْمُقَامَةِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْمُقَامَةِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":3695,
        "wordid":15802,
        "word":"يَمَسُّنَا",
        "rootid":797,
        "rootword":"م س س",
        "meanings":"To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment.",
        "sentence":"The word يَمَسُّنَا comes from the root م س س and is associated with the meanings: To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment."
    },

    {
        "indexid":3695,
        "wordid":15803,
        "word":"لُغُوبٌ",
        "rootid":629,
        "rootword":"ل غ ب",
        "meanings":"To be fatigued, weary, weak, tired, spoiled\/marred. laghaba vb.",
        "sentence":"The word لُغُوبٌ comes from the root ل غ ب and is associated with the meanings: To be fatigued, weary, weak, tired, spoiled\/marred. laghaba vb."
    }]}