{"data":[
    {
        "indexid":3705,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3705,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3705,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":3705,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":3705,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3705,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3705,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":3705,
        "wordid":2444,
        "word":"النَّاسَ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسَ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":3705,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3705,
        "wordid":3410,
        "word":"دَابَّةٍ",
        "rootid":1326,
        "rootword":"د ب ب",
        "meanings":"(or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main.",
        "sentence":"The word دَابَّةٍ comes from the root د ب ب and is associated with the meanings: (or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main."
    },

    {
        "indexid":3705,
        "wordid":3537,
        "word":"تَرَكَ",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word تَرَكَ comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    },

    {
        "indexid":3705,
        "wordid":3755,
        "word":"كَسَبُوا",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word كَسَبُوا comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":3705,
        "wordid":4458,
        "word":"أَجَلٍ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلٍ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":3705,
        "wordid":4459,
        "word":"مُسَمًّى",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word مُسَمًّى comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":3705,
        "wordid":5906,
        "word":"جَاءَ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":3705,
        "wordid":5982,
        "word":"بَصِيرًا",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word بَصِيرًا comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":3705,
        "wordid":8113,
        "word":"أَجَلُهُمْ",
        "rootid":1093,
        "rootword":"ا ج ل",
        "meanings":"assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time.",
        "sentence":"The word أَجَلُهُمْ comes from the root ا ج ل and is associated with the meanings: assigned\/appointed\/specified\/decreed term, period, day of resurrection, period between creation and death, period between death and resurrection, period remaining in the world, delay\/postponed\/deferral of time."
    },

    {
        "indexid":3705,
        "wordid":11247,
        "word":"يُؤَخِّرُهُمْ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word يُؤَخِّرُهُمْ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":3705,
        "wordid":11582,
        "word":"يُؤَاخِذُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word يُؤَاخِذُ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":3705,
        "wordid":11893,
        "word":"بِعِبَادِهِ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word بِعِبَادِهِ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":3705,
        "wordid":15832,
        "word":"ظَهْرِهَا",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظَهْرِهَا comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    }]}