{"data":[
    {
        "indexid":3711,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3711,
        "wordid":3455,
        "word":"ءَابَاؤُهُمْ",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word ءَابَاؤُهُمْ comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":3711,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":3711,
        "wordid":7810,
        "word":"غَافِلُونَ",
        "rootid":921,
        "rootword":"غ ف ل",
        "meanings":"unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away",
        "sentence":"The word غَافِلُونَ comes from the root غ ف ل and is associated with the meanings: unmindful, forgetful, neglectful, heedless, intentionally neglecting or leaving or turning away"
    },

    {
        "indexid":3711,
        "wordid":7995,
        "word":"لِتُنْذِرَ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word لِتُنْذِرَ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":3711,
        "wordid":15835,
        "word":"أُنْذِرَ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word أُنْذِرَ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    }]}