{"data":[
    {
        "indexid":3717,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3717,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":3717,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3717,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3717,
        "wordid":2704,
        "word":"الْمَوْتَى",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتَى comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":3717,
        "wordid":5380,
        "word":"مُبِينٍ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٍ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3717,
        "wordid":11332,
        "word":"نُحْيِي",
        "rootid":1282,
        "rootword":"ح ي ي",
        "meanings":"(a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest",
        "sentence":"The word نُحْيِي comes from the root ح ي ي and is associated with the meanings: (a doubly imperfect verb) To live, be alive, be ashamed, spend (the night) awake, fertilize the earth, keep anyone alive; spare any one, let anyone alive, remove prudency, modesty and shamefulness, make immodest"
    },

    {
        "indexid":3717,
        "wordid":11821,
        "word":"وَكُلَّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word وَكُلَّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":3717,
        "wordid":15845,
        "word":"وَنَكْتُبُ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word وَنَكْتُبُ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":3717,
        "wordid":15846,
        "word":"قَدَّمُوا",
        "rootid":100,
        "rootword":"ق د م",
        "meanings":"to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost.",
        "sentence":"The word قَدَّمُوا comes from the root ق د م and is associated with the meanings: to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost."
    },

    {
        "indexid":3717,
        "wordid":15847,
        "word":"وَءَاثَارَهُمْ",
        "rootid":156,
        "rootword":"ا ث ر",
        "meanings":"to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity.",
        "sentence":"The word وَءَاثَارَهُمْ comes from the root ا ث ر and is associated with the meanings: to relate, narrate, recite, choose, propose, transmit, raise, prefer, effect, excite.. To stir up, to trump up.. Determined\/resolved\/decided upon a thing.. Origin, time\/period of life.. Dearth, scarcity, drought or sterility.. An iron instrument with which the bottom of a camel's foot is marked, or a camel with such a mark.. A generous quality\/action (e.g. passed down from generation to generation).. athar means after, footstep\/trace\/mark\/track\/remnant\/tradition\/teaching, impression\/influence, stamp\/scar, remains, relics of knowledge transmitted, sunnah, vestige, print, memorial of antiquity."
    },

    {
        "indexid":3717,
        "wordid":15848,
        "word":"أَحْصَيْنَاهُ",
        "rootid":1147,
        "rootword":"ح ص ي",
        "meanings":"Calculate, to count\/number. To strike with a pebble.",
        "sentence":"The word أَحْصَيْنَاهُ comes from the root ح ص ي and is associated with the meanings: Calculate, to count\/number. To strike with a pebble."
    },

    {
        "indexid":3717,
        "wordid":15849,
        "word":"إِمَامٍ",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word إِمَامٍ comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    }]}