{"data":[
    {
        "indexid":3734,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3734,
        "wordid":2887,
        "word":"كَانَتْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَتْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3734,
        "wordid":3819,
        "word":"وَاحِدَةً",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةً comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":3734,
        "wordid":15871,
        "word":"صَيْحَةً",
        "rootid":408,
        "rootword":"ص ي ح",
        "meanings":"to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise.",
        "sentence":"The word صَيْحَةً comes from the root ص ي ح and is associated with the meanings: to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise."
    },

    {
        "indexid":3734,
        "wordid":15872,
        "word":"خَامِدُونَ",
        "rootid":1137,
        "rootword":"خ م د",
        "meanings":"To subside, be utterly extinguished (a fire); it's flaming or blazing ceasing, faint or swoon, be allayed (fever or vehemence of a fever), be still\/motionless and silent (Al-Qamoos & Tajul-Arus), dispose and submit oneself to an affair or event, be silent and dead, become like extinguished ashes.",
        "sentence":"The word خَامِدُونَ comes from the root خ م د and is associated with the meanings: To subside, be utterly extinguished (a fire); it's flaming or blazing ceasing, faint or swoon, be allayed (fever or vehemence of a fever), be still\/motionless and silent (Al-Qamoos & Tajul-Arus), dispose and submit oneself to an affair or event, be silent and dead, become like extinguished ashes."
    }]}