{"data":[
    {
        "indexid":3744,
        "wordid":4431,
        "word":"عَادَ",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word عَادَ comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":3744,
        "wordid":7632,
        "word":"وَالْقَمَرَ",
        "rootid":659,
        "rootword":"ق م ر",
        "meanings":"to be white. qamarun - moon (especially from the 3rd to 26th night).",
        "sentence":"The word وَالْقَمَرَ comes from the root ق م ر and is associated with the meanings: to be white. qamarun - moon (especially from the 3rd to 26th night)."
    },

    {
        "indexid":3744,
        "wordid":9696,
        "word":"مَنَازِلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word مَنَازِلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":3744,
        "wordid":10868,
        "word":"الْقَدِيمِ",
        "rootid":100,
        "rootword":"ق د م",
        "meanings":"to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost.",
        "sentence":"The word الْقَدِيمِ comes from the root ق د م and is associated with the meanings: to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost."
    },

    {
        "indexid":3744,
        "wordid":15887,
        "word":"قَدَّرْنَاهُ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word قَدَّرْنَاهُ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    }]}