{"data":[
    {
        "indexid":3746,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3746,
        "wordid":8241,
        "word":"الْفُلْكِ",
        "rootid":362,
        "rootword":"ف ل ك",
        "meanings":"become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round.",
        "sentence":"The word الْفُلْكِ comes from the root ف ل ك and is associated with the meanings: become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round."
    },

    {
        "indexid":3746,
        "wordid":8708,
        "word":"ذُرِّيَّتَهُمْ",
        "rootid":1536,
        "rootword":"ذ ر ر",
        "meanings":"to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children.",
        "sentence":"The word ذُرِّيَّتَهُمْ comes from the root ذ ر ر and is associated with the meanings: to scatter, strew, sprinkle, rise.Least degree.Atom, small ant, smallest kind of an ant resembling in weight and shape to an atom, smallest seed of grain, grub, small particle thats sprinkled.Progeny, offspring, children, race, raising children."
    },

    {
        "indexid":3746,
        "wordid":11781,
        "word":"حَمَلْنَا",
        "rootid":1019,
        "rootword":"ح م ل",
        "meanings":"bore it, carried it, took it up, carried it, convey, show\/manifest, conceive.",
        "sentence":"The word حَمَلْنَا comes from the root ح م ل and is associated with the meanings: bore it, carried it, took it up, carried it, convey, show\/manifest, conceive."
    },

    {
        "indexid":3746,
        "wordid":14464,
        "word":"الْمَشْحُونِ",
        "rootid":945,
        "rootword":"ش ح ن",
        "meanings":"to fill\/load\/furnish.",
        "sentence":"The word الْمَشْحُونِ comes from the root ش ح ن and is associated with the meanings: to fill\/load\/furnish."
    }]}