{"data":[
    {
        "indexid":3754,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3754,
        "wordid":3795,
        "word":"يَنْظُرُونَ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word يَنْظُرُونَ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":3754,
        "wordid":3819,
        "word":"وَاحِدَةً",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةً comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":3754,
        "wordid":15871,
        "word":"صَيْحَةً",
        "rootid":408,
        "rootword":"ص ي ح",
        "meanings":"to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise.",
        "sentence":"The word صَيْحَةً comes from the root ص ي ح and is associated with the meanings: to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise."
    },

    {
        "indexid":3754,
        "wordid":15900,
        "word":"تَأْخُذُهُمْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word تَأْخُذُهُمْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":3754,
        "wordid":15901,
        "word":"يَخِصِّمُونَ",
        "rootid":57,
        "rootword":"خ ص م",
        "meanings":"Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something.",
        "sentence":"The word يَخِصِّمُونَ comes from the root خ ص م and is associated with the meanings: Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something."
    }]}