{"data":[
    {
        "indexid":3756,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":3756,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3756,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3756,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3756,
        "wordid":7508,
        "word":"الصُّورِ",
        "rootid":829,
        "rootword":"ص و ر",
        "meanings":"to shape\/form, fashion mark, picture, adorn, prepare, make.",
        "sentence":"The word الصُّورِ comes from the root ص و ر and is associated with the meanings: to shape\/form, fashion mark, picture, adorn, prepare, make."
    },

    {
        "indexid":3756,
        "wordid":12573,
        "word":"وَنُفِخَ",
        "rootid":1023,
        "rootword":"ن ف خ",
        "meanings":"to blow with the mouth, breathe.",
        "sentence":"The word وَنُفِخَ comes from the root ن ف خ and is associated with the meanings: to blow with the mouth, breathe."
    },

    {
        "indexid":3756,
        "wordid":13441,
        "word":"يَنْسِلُونَ",
        "rootid":785,
        "rootword":"ن س ل",
        "meanings":"to beget, be fruitful in progeny. nasila - to hasten, crash.",
        "sentence":"The word يَنْسِلُونَ comes from the root ن س ل and is associated with the meanings: to beget, be fruitful in progeny. nasila - to hasten, crash."
    },

    {
        "indexid":3756,
        "wordid":15903,
        "word":"الْأَجْدَاثِ",
        "rootid":340,
        "rootword":"ج د ث",
        "meanings":"Make for oneself a grave or sepulchre; a grave or sepulchre.",
        "sentence":"The word الْأَجْدَاثِ comes from the root ج د ث and is associated with the meanings: Make for oneself a grave or sepulchre; a grave or sepulchre."
    }]}