{"data":[
    {
        "indexid":3761,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3761,
        "wordid":12294,
        "word":"الْأَرَائِكِ",
        "rootid":341,
        "rootword":"ا ر ك",
        "meanings":"camels feeding\/eating on a certain tree termed (Alif-Ra-Alif-Kaf) or camels remained, or continued, among trees of that kind; to persist or preserver; He compelled him or constrained him, to do the thing, or affair; or made him to keep, or cleave, to it; herbage in which the camels remain or continue, couch.",
        "sentence":"The word الْأَرَائِكِ comes from the root ا ر ك and is associated with the meanings: camels feeding\/eating on a certain tree termed (Alif-Ra-Alif-Kaf) or camels remained, or continued, among trees of that kind; to persist or preserver; He compelled him or constrained him, to do the thing, or affair; or made him to keep, or cleave, to it; herbage in which the camels remain or continue, couch."
    },

    {
        "indexid":3761,
        "wordid":15908,
        "word":"وَأَزْوَاجُهُمْ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word وَأَزْوَاجُهُمْ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":3761,
        "wordid":15909,
        "word":"ظِلَالٍ",
        "rootid":1583,
        "rootword":"ظ ل ل",
        "meanings":"to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness.",
        "sentence":"The word ظِلَالٍ comes from the root ظ ل ل and is associated with the meanings: to remain, last, continue doing a thing, be, become, grow into, remain, persevere, went on doing. zallala and azalla - to shade, give shade over. zillun - shade, shadow, shelter. zullatun - awning, shelter, booth, covering, cloud giving shade, protection, state of ease and happiness."
    },

    {
        "indexid":3761,
        "wordid":15910,
        "word":"مُتَّكِئُونَ",
        "rootid":1201,
        "rootword":"و ك ا",
        "meanings":"to recline.",
        "sentence":"The word مُتَّكِئُونَ comes from the root و ك ا and is associated with the meanings: to recline."
    }]}