{"data":[
    {
        "indexid":3772,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":3772,
        "wordid":2132,
        "word":"فَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word فَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3772,
        "wordid":2154,
        "word":"يَرْجِعُونَ",
        "rootid":1221,
        "rootword":"ر ج ع",
        "meanings":"to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another.",
        "sentence":"The word يَرْجِعُونَ comes from the root ر ج ع and is associated with the meanings: to return, turn back, turn off, (blame) upon any one, come back, repeat, answer, bring answer, be brought back. raji'un - one who returns. murji'un - return, termination. taraja'a (vb. 6)  -to return to one another."
    },

    {
        "indexid":3772,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":3772,
        "wordid":3866,
        "word":"اسْتَطَاعُوا",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word اسْتَطَاعُوا comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":3772,
        "wordid":7557,
        "word":"نَشَاءُ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word نَشَاءُ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":3772,
        "wordid":15926,
        "word":"لَمَسَخْنَاهُمْ",
        "rootid":955,
        "rootword":"م س خ",
        "meanings":"To transform or metamorph a thing, change or alter a thing, tasteless or insipid, to wound or render an animal lean, to be dissolved, to deform, render a thing ugly in make or form, to make a bow or bows.",
        "sentence":"The word لَمَسَخْنَاهُمْ comes from the root م س خ and is associated with the meanings: To transform or metamorph a thing, change or alter a thing, tasteless or insipid, to wound or render an animal lean, to be dissolved, to deform, render a thing ugly in make or form, to make a bow or bows."
    },

    {
        "indexid":3772,
        "wordid":15927,
        "word":"مَكَانَتِهِمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word مَكَانَتِهِمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":3772,
        "wordid":15928,
        "word":"مُضِيًّا",
        "rootid":1355,
        "rootword":"م ض ي",
        "meanings":"To advance or proceed, pass\/pass away, go or go away, press onward, execute\/perform\/accomplish a thing, to be sharp, to cut or penetrate, excel or surpass in doing a thing.",
        "sentence":"The word مُضِيًّا comes from the root م ض ي and is associated with the meanings: To advance or proceed, pass\/pass away, go or go away, press onward, execute\/perform\/accomplish a thing, to be sharp, to cut or penetrate, excel or surpass in doing a thing."
    }]}