{"data":[
    {
        "indexid":3774,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3774,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3774,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":3774,
        "wordid":3446,
        "word":"مُبِينٌ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٌ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":3774,
        "wordid":8235,
        "word":"ذِكْرٌ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرٌ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":3774,
        "wordid":10767,
        "word":"عَلَّمْنَاهُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلَّمْنَاهُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":3774,
        "wordid":12852,
        "word":"يَنْبَغِي",
        "rootid":1101,
        "rootword":"ب غ ي",
        "meanings":"Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought",
        "sentence":"The word يَنْبَغِي comes from the root ب غ ي and is associated with the meanings: Sought for or after, desired, endeavored to find and take and get (good or evil)Loving or affecting a thingActing wrongfully, injuriously or tyrannicallySeeking or endeavoring to act corruptingly, wrongly and\/or unjustly, insolent\/disobedientExceeding due bounds or just limits in any wayNot right, proper or fitProstitute or adulteress, unchaste [e.g. 19:20, 19:28, 24:33]Not seeking what one should not seekSeeking game or preyPlace where a thing is sought, way or manner in which a thing is sought"
    },

    {
        "indexid":3774,
        "wordid":15931,
        "word":"الشِّعْرَ",
        "rootid":1335,
        "rootword":"ش ع ر",
        "meanings":"to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to.",
        "sentence":"The word الشِّعْرَ comes from the root ش ع ر and is associated with the meanings: to know\/perceive\/understand, to acquaint, perceive by senses.. make verses, remark, poetry, poet, verse, art of poetry, feeling, knowledge.. Sirius, which was worshipped by the Arabs in Pagan times.. mark\/marker\/signs\/rites\/symbols\/observances\/ceremonies\/practices, the obligatory ordinances\/statutes of God.. a place where a thing is known to be.. measure of length.. sheep\/goat.. hair, innermost garment.. trees.. a sign of people in war and in a journey, a call or cry by means of which to know another, banner.. mash'ar al-Haram - holy mosque in Muadhalifah (a place which lies between Makkah and Arafat, six miles from Kabah). The name Mash'ar al-Haram is a compound of Mash'ar meaning the place of perception or knowledge and Haram meaning sacred. Ash'ara to make anyone understand, make known to."
    },

    {
        "indexid":3774,
        "wordid":15932,
        "word":"وَقُرْءَانٌ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word وَقُرْءَانٌ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    }]}