{"data":[
    {
        "indexid":3885,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":3885,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3885,
        "wordid":3100,
        "word":"الْجَحِيمِ",
        "rootid":169,
        "rootword":"ج ح م",
        "meanings":"To kindle a fire, make to burn, burn up, burn brightly or fiercly, open the eye, to abstain\/refrain\/desist\/forbear, advance or go forward, recede or draw back [This verb bears contradictory significations], near to destroying or killing, burn with vehemence of desire\/covetousness and niggardliness, straitened in disposition, tenacious or stingy, blazing or flaming, vehemently hot.",
        "sentence":"The word الْجَحِيمِ comes from the root ج ح م and is associated with the meanings: To kindle a fire, make to burn, burn up, burn brightly or fiercly, open the eye, to abstain\/refrain\/desist\/forbear, advance or go forward, recede or draw back [This verb bears contradictory significations], near to destroying or killing, burn with vehemence of desire\/covetousness and niggardliness, straitened in disposition, tenacious or stingy, blazing or flaming, vehemently hot."
    },

    {
        "indexid":3885,
        "wordid":10860,
        "word":"فَأَلْقُوهُ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَأَلْقُوهُ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}