{"data":[
    {
        "indexid":3886,
        "wordid":10432,
        "word":"كَيْدًا",
        "rootid":1295,
        "rootword":"ك ي د",
        "meanings":"(Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish.",
        "sentence":"The word كَيْدًا comes from the root ك ي د and is associated with the meanings: (Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish."
    },

    {
        "indexid":3886,
        "wordid":13371,
        "word":"فَجَعَلْنَاهُمُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word فَجَعَلْنَاهُمُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":3886,
        "wordid":16057,
        "word":"فَأَرَادُوا",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word فَأَرَادُوا comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    },

    {
        "indexid":3886,
        "wordid":16058,
        "word":"الْأَسْفَلِينَ",
        "rootid":126,
        "rootword":"س ف ل",
        "meanings":"to be low\/lower\/lowest, mean\/despicable\/vile\/base\/inferior, nethermost, downward, below.",
        "sentence":"The word الْأَسْفَلِينَ comes from the root س ف ل and is associated with the meanings: to be low\/lower\/lowest, mean\/despicable\/vile\/base\/inferior, nethermost, downward, below."
    }]}