{"data":[
    {
        "indexid":3891,
        "wordid":16066,
        "word":"أَسْلَمَا",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word أَسْلَمَا comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":3891,
        "wordid":16067,
        "word":"وَتَلَّهُ",
        "rootid":160,
        "rootword":"ت ل ل",
        "meanings":"To lay down, let down, threw down, drop, lay prostrate, lay one down upon one's kin, neck, cheek, or breast.. Shake, move, agitate, put in state of motion or commotion, rough\/severe\/vehement.. Sluggish, laziness.. Charge, upbraid, deliver.",
        "sentence":"The word وَتَلَّهُ comes from the root ت ل ل and is associated with the meanings: To lay down, let down, threw down, drop, lay prostrate, lay one down upon one's kin, neck, cheek, or breast.. Shake, move, agitate, put in state of motion or commotion, rough\/severe\/vehement.. Sluggish, laziness.. Charge, upbraid, deliver."
    },

    {
        "indexid":3891,
        "wordid":16068,
        "word":"لِلْجَبِينِ",
        "rootid":994,
        "rootword":"ج ب ن",
        "meanings":"Cowardly, weak hearted, He held back\/refrained through cowardice. The temple\/side of the forehead, brow.",
        "sentence":"The word لِلْجَبِينِ comes from the root ج ب ن and is associated with the meanings: Cowardly, weak hearted, He held back\/refrained through cowardice. The temple\/side of the forehead, brow."
    }]}