{"data":[
    {
        "indexid":3928,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":3928,
        "wordid":8241,
        "word":"الْفُلْكِ",
        "rootid":362,
        "rootword":"ف ل ك",
        "meanings":"become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round.",
        "sentence":"The word الْفُلْكِ comes from the root ف ل ك and is associated with the meanings: become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round."
    },

    {
        "indexid":3928,
        "wordid":14464,
        "word":"الْمَشْحُونِ",
        "rootid":945,
        "rootword":"ش ح ن",
        "meanings":"to fill\/load\/furnish.",
        "sentence":"The word الْمَشْحُونِ comes from the root ش ح ن and is associated with the meanings: to fill\/load\/furnish."
    },

    {
        "indexid":3928,
        "wordid":16094,
        "word":"أَبَقَ",
        "rootid":393,
        "rootword":"ا ب ق",
        "meanings":"to run away, fled, went away, he confined\/concealed\/restricted himself, runaway\/fugitive.",
        "sentence":"The word أَبَقَ comes from the root ا ب ق and is associated with the meanings: to run away, fled, went away, he confined\/concealed\/restricted himself, runaway\/fugitive."
    }]}