{"data":[
    {
        "indexid":3974,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":3974,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3974,
        "wordid":2854,
        "word":"جَاءَهُمْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَهُمْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":3974,
        "wordid":3084,
        "word":"وَقَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word وَقَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":3974,
        "wordid":6441,
        "word":"الْكَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":3974,
        "wordid":10952,
        "word":"مُنْذِرٌ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word مُنْذِرٌ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":3974,
        "wordid":16147,
        "word":"وَعَجِبُوا",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word وَعَجِبُوا comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    },

    {
        "indexid":3974,
        "wordid":16148,
        "word":"سَاحِرٌ",
        "rootid":1083,
        "rootword":"س ح ر",
        "meanings":"To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding.",
        "sentence":"The word سَاحِرٌ comes from the root س ح ر and is associated with the meanings: To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding."
    },

    {
        "indexid":3974,
        "wordid":16149,
        "word":"كَذَّابٌ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَذَّابٌ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    }]}