{"data":[
    {
        "indexid":3985,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3985,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":3985,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":3985,
        "wordid":2332,
        "word":"هَؤُلَاءِ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word هَؤُلَاءِ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":3985,
        "wordid":3819,
        "word":"وَاحِدَةً",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word وَاحِدَةً comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":3985,
        "wordid":4961,
        "word":"يَنْظُرُ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word يَنْظُرُ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":3985,
        "wordid":15871,
        "word":"صَيْحَةً",
        "rootid":408,
        "rootword":"ص ي ح",
        "meanings":"to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise.",
        "sentence":"The word صَيْحَةً comes from the root ص ي ح and is associated with the meanings: to shout\/cry, make noise. sayhatun - thunderbolt, shout, blast, terrible and mighty noise."
    },

    {
        "indexid":3985,
        "wordid":16167,
        "word":"فَوَاقٍ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوَاقٍ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    }]}