{"data":[
    {
        "indexid":3988,
        "wordid":3839,
        "word":"مَعَهُ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":3988,
        "wordid":8286,
        "word":"الْجِبَالَ",
        "rootid":853,
        "rootword":"ج ب ل",
        "meanings":"He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation.",
        "sentence":"The word الْجِبَالَ comes from the root ج ب ل and is associated with the meanings: He (God) created him with an adaptation\/disposition by nature. He compelled him against his will. He (or they) came\/went\/betook himself to the mountain. He (a digger) reached a hard place or stone in his digging. Big\/thick\/coarse\/rough (human or a thing). Much\/numerous. The lord\/chief of a company of men. Any of the mountains of the earth that is big and long (also applied to a rocky tract. Any rocky evelation however little) A man who doesn't remove from his place\/niggard. The serpent. The echo. A vice\/fault\/defect\/blemish. Hardness of the earth\/ground. A camel's hump. The origin of any created thing. A garment\/piece of cloth good in respect of the thread and the weaving. Company of men\/nation. Nature\/natural\/native\/innate\/original. Relating to mountain\/mountains. Having a bad\/ugly face. Applied to a man: Great\/large\/big in make like a mountain.. jabala - to form\/create, to mix (e.g. clay with water).. jabillun\/jibillat - crowd\/multitude, number of people, generation."
    },

    {
        "indexid":3988,
        "wordid":13392,
        "word":"يُسَبِّحْنَ",
        "rootid":429,
        "rootword":"س ب ح",
        "meanings":"to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity",
        "sentence":"The word يُسَبِّحْنَ comes from the root س ب ح and is associated with the meanings: to swim, roll onwards, perform a daily course, float, the act of swimming, occupy oneself in: the accomplishment of his needful affairs or seeking the means of subsistence, business\/occupation, those who are floating, went\/travel far, being quick\/swift. To praise\/glorify\/hollow\/magnify, sing\/celebrate praise, holy, declaring God to be far removed or free for every imperfection\/impurity"
    },

    {
        "indexid":3988,
        "wordid":16174,
        "word":"سَخَّرْنَا",
        "rootid":1252,
        "rootword":"س خ ر",
        "meanings":"to mock\/laugh\/scoff at, make fun of, ridicule, look down, deride, taunt, jeer, to compel to work without payment, make subservient, press into service, harness, bring under domination or control, subjugate, constrain anyone to forced work.",
        "sentence":"The word سَخَّرْنَا comes from the root س خ ر and is associated with the meanings: to mock\/laugh\/scoff at, make fun of, ridicule, look down, deride, taunt, jeer, to compel to work without payment, make subservient, press into service, harness, bring under domination or control, subjugate, constrain anyone to forced work."
    },

    {
        "indexid":3988,
        "wordid":16175,
        "word":"وَالْإِشْرَاقِ",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word وَالْإِشْرَاقِ comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    }]}