{"data":[
    {
        "indexid":4033,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":4033,
        "wordid":2826,
        "word":"عَنْهُمُ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمُ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4033,
        "wordid":7675,
        "word":"الْأَبْصَارُ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word الْأَبْصَارُ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":4033,
        "wordid":13877,
        "word":"سِخْرِيًّا",
        "rootid":1252,
        "rootword":"س خ ر",
        "meanings":"to mock\/laugh\/scoff at, make fun of, ridicule, look down, deride, taunt, jeer, to compel to work without payment, make subservient, press into service, harness, bring under domination or control, subjugate, constrain anyone to forced work.",
        "sentence":"The word سِخْرِيًّا comes from the root س خ ر and is associated with the meanings: to mock\/laugh\/scoff at, make fun of, ridicule, look down, deride, taunt, jeer, to compel to work without payment, make subservient, press into service, harness, bring under domination or control, subjugate, constrain anyone to forced work."
    },

    {
        "indexid":4033,
        "wordid":16275,
        "word":"أَتَّخَذْنَاهُمْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word أَتَّخَذْنَاهُمْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":4033,
        "wordid":16276,
        "word":"زَاغَتْ",
        "rootid":519,
        "rootword":"ز ي غ",
        "meanings":"decline\/deviate\/swerve, turned aside, a doubting.",
        "sentence":"The word زَاغَتْ comes from the root ز ي غ and is associated with the meanings: decline\/deviate\/swerve, turned aside, a doubting."
    }]}