{"data":[
    {
        "indexid":4055,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4055,
        "wordid":3391,
        "word":"أَجْمَعِينَ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word أَجْمَعِينَ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":4055,
        "wordid":4597,
        "word":"جَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":4055,
        "wordid":7172,
        "word":"مِنْكَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4055,
        "wordid":8041,
        "word":"تَبِعَكَ",
        "rootid":1570,
        "rootword":"ت ب ع",
        "meanings":"follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers.",
        "sentence":"The word تَبِعَكَ comes from the root ت ب ع and is associated with the meanings: follow\/went or walked behind\/after, overtook, pursue\/investigate\/examine\/hunt, sought\/reach\/obtain it, prosecute\/sue (for right\/due or blood-revenge), succession of one to another, consecutive\/successive, follower, imitator, continue the same course, aid\/assist\/help, come with, obey, desire\/demand.An appelation of each of the Kings of El-Yemen who posessed Himyer and Hadramowt, so called because they followed one another when one died, another took his place, followed him in his course of acting. It is said in a tradition to mean a particular King who was a believer, whose people were unbelievers."
    },

    {
        "indexid":4055,
        "wordid":8042,
        "word":"لَأَمْلَأَنَّ",
        "rootid":828,
        "rootword":"م ل ا",
        "meanings":"To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant.",
        "sentence":"The word لَأَمْلَأَنَّ comes from the root م ل ا and is associated with the meanings: To fill, satisfy, help. \"The sap or vigour of youth, or young manhood became fuller mantled in a person\". Satisfy\/Glut. Aid, assist, conform with to do a thing. Assembly. Utmost [such as pulling a bow as far back as possible]. \"The utmost of his power and ability was accomplished\". Sufficient in quantity or dimension for filling. Disposition, nature [as one rich in needul qualities], manners. Principle persons, chiefs [because they are rich in needful things]. That which is satisfactory or satisfies [such as a majestic person]. An ewe in whose belly are water and matter so that one thinks her to be pregnant."
    },

    {
        "indexid":4055,
        "wordid":8746,
        "word":"وَمِمَّنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمِمَّنْ comes from the root م ن and is associated with the meanings: From"
    }]}