{"data":[
    {
        "indexid":4123,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4123,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4123,
        "wordid":2047,
        "word":"قَبْلِكَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلِكَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":4123,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4123,
        "wordid":2641,
        "word":"الْخَاسِرِينَ",
        "rootid":1543,
        "rootword":"خ س ر",
        "meanings":"To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another.",
        "sentence":"The word الْخَاسِرِينَ comes from the root خ س ر and is associated with the meanings: To suffer loss or diminution, to be deceived\/cheated\/beguiled\/circumvented, to err\/go astray\/deviate from\/miss the right way, to perish or die, make a thing defective or deficient, destroy or cause to perish, remove\/alienate\/estrange someone, to be treacherous\/ignoble\/mean, to be unfaithful, ungenerous, small\/little\/weak (among mankind), refuse invitation from another."
    },

    {
        "indexid":4123,
        "wordid":2642,
        "word":"وَلَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَلَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":4123,
        "wordid":3802,
        "word":"وَإِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word وَإِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4123,
        "wordid":16400,
        "word":"أَشْرَكْتَ",
        "rootid":566,
        "rootword":"ش ر ك",
        "meanings":"to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. ",
        "sentence":"The word أَشْرَكْتَ comes from the root ش ر ك and is associated with the meanings: to be a companion, be sharer\/partner. shirkun - share, participation, polytheism, idolatry, making associate\/partner with Allah. shariik (pl. shurakaa) - associate, partner, sharer. Nouns of the second declension when followed by the affixed pronouns take the three inflexions thus shurakaa, shurakaa'i, shurakaa'a. shaarak (vb. 3) - to share with. ashraka (vb. 4) - to make a sharer or associate, give companions (e.g. to God), be a polytheist or idolater. ashraktumuuni - you associated me as partner. mushrik - one who gives associate to God, polytheist. mushtarikun (vb. 8) - one who partakes or shares. "
    },

    {
        "indexid":4123,
        "wordid":16401,
        "word":"لَيَحْبَطَنَّ",
        "rootid":1345,
        "rootword":"ح ب ط",
        "meanings":"To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective.",
        "sentence":"The word لَيَحْبَطَنَّ comes from the root ح ب ط and is associated with the meanings: To go in vain, be fruitless, perish, be of no avail, be useless, come to naught, become ineffective."
    },

    {
        "indexid":4123,
        "wordid":16402,
        "word":"عَمَلُكَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word عَمَلُكَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":4123,
        "wordid":16403,
        "word":"وَلَتَكُونَنَّ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَلَتَكُونَنَّ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    }]}