{"data":[
    {
        "indexid":4137,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4137,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":4137,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4137,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4137,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4137,
        "wordid":5548,
        "word":"الْبِلَادِ",
        "rootid":745,
        "rootword":"ب ل د",
        "meanings":"A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others",
        "sentence":"The word الْبِلَادِ comes from the root ب ل د and is associated with the meanings: A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others"
    },

    {
        "indexid":4137,
        "wordid":6293,
        "word":"يُجَادِلُ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word يُجَادِلُ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":4137,
        "wordid":16432,
        "word":"يَغْرُرْكَ",
        "rootid":1092,
        "rootword":"غ ر ر",
        "meanings":"deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities",
        "sentence":"The word يَغْرُرْكَ comes from the root غ ر ر and is associated with the meanings: deceived, beguiled, inexperienced or ignorant in affairs, act childish, exposed to perdition or destruction without knowing, gargled; whiteness, clearness of complexion; noble or eminent man, chief, lord, most precious and excellent; peril, danger, hazard; deficiency of, imperfect performance of; vain things, vanities"
    },

    {
        "indexid":4137,
        "wordid":16433,
        "word":"تَقَلُّبُهُمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word تَقَلُّبُهُمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    }]}