{"data":[
    {
        "indexid":414,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":414,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":414,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":414,
        "wordid":3548,
        "word":"سَمِيعٌ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمِيعٌ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":414,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":414,
        "wordid":5151,
        "word":"غَدَوْتَ",
        "rootid":1182,
        "rootword":"غ د و",
        "meanings":"early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day",
        "sentence":"The word غَدَوْتَ comes from the root غ د و and is associated with the meanings: early part of morning, morrow, morning, time between the prayer of daybreak and sunrise, first part of the day"
    },

    {
        "indexid":414,
        "wordid":5152,
        "word":"أَهْلِكَ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word أَهْلِكَ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":414,
        "wordid":5153,
        "word":"تُبَوِّئُ",
        "rootid":1076,
        "rootword":"ب و ا",
        "meanings":"returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling.",
        "sentence":"The word تُبَوِّئُ comes from the root ب و ا and is associated with the meanings: returned, went\/came back, he bore or took upon himself, became ladened\/burdened, became the abiding-place thereof, became answerable\/accountable\/responsible, equal\/alike, a match, rested\/remained, lodged him in an abode, mubawwa: a dwelling, place of lodging, settlement, tabawwa: to take or make as one's dwelling."
    },

    {
        "indexid":414,
        "wordid":5154,
        "word":"مَقَاعِدَ",
        "rootid":1162,
        "rootword":"ق ع د",
        "meanings":"to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment.",
        "sentence":"The word مَقَاعِدَ comes from the root ق ع د and is associated with the meanings: to sit down, remain behind, to hold back, to tarry, lie in wait, sit still, remain unmoved, desist, abstain, refrain, lurk in ambush, set snares, neglect, act of sitting, foundations\/bases, women who are past child bearing age, elderly spinsters past child bearing age, one who sits at home, one who sits still, seat or place of sitting, station, encampment."
    },

    {
        "indexid":414,
        "wordid":5155,
        "word":"لِلْقِتَالِ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word لِلْقِتَالِ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    }]}