{"data":[
    {
        "indexid":4170,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4170,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4170,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4170,
        "wordid":2348,
        "word":"السَّمَاوَاتِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاوَاتِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4170,
        "wordid":2479,
        "word":"فِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word فِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":4170,
        "wordid":3013,
        "word":"السَّبِيلِ",
        "rootid":1790,
        "rootword":"س ب ل",
        "meanings":"cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. ",
        "sentence":"The word السَّبِيلِ comes from the root س ب ل and is associated with the meanings: cause, reason, way\/path\/road, necessity, means of access, responsibility, method\/manner, plea to allege.. fi sabil Allah - in the way of Allah, in the cause of Allah, to carry the message of Allah.. ibn al-sabil - traveller, way farer, forlorn traveller.. salsabil - It is made up of two words: sal (ask, enquire about) & sabil (way), salsala - easy, sweet, rapid flowing water. As if it meant 'Inquiring ask your Lord the way to that sweet, easy palatable and rapid flowing fountain'. It is the name of a fountain of heaven. "
    },

    {
        "indexid":4170,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4170,
        "wordid":3812,
        "word":"زُيِّنَ",
        "rootid":694,
        "rootword":"ز ي ن",
        "meanings":"To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity.",
        "sentence":"The word زُيِّنَ comes from the root ز ي ن and is associated with the meanings: To adorn, deck. Adorn, grace, honor [said of an action, quality, or saying]. Embellished, dressed, or trimmed it [relating to language]. Adorned [ex. The earth, or land, became adorned with or by it's herbage], ornamented, decorated, decked, bedecked, garnished, embellished, beautified, or graced him\/it. Of language it is said: \"It was embellished, dressed up, or trimmed\". Of action it is said: \"It was embellished, dressed up\"; i.e. commended to a person by another man. A grace, a beauty, a comely quality, a physical\/intellectual adornment, an honour or a credit, and anything that is the pride or glory of a person or a thing. A thing that does not disgrace or render unseemly a wise man in any of his states or conditions, either in the present world or in that which is to come. It [states] are of three kinds: Mental: Such as knowledge\/science and good tenants. Bodily: Strength, tallness of stature, beauty of aspect. Extrinsic: Wealth, rank or station, dignity."
    },

    {
        "indexid":4170,
        "wordid":9267,
        "word":"سُوءُ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سُوءُ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":4170,
        "wordid":13039,
        "word":"كَيْدُ",
        "rootid":1295,
        "rootword":"ك ي د",
        "meanings":"(Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish.",
        "sentence":"The word كَيْدُ comes from the root ك ي د and is associated with the meanings: (Kaf-Alif-Dal) To be about to, be just on the point of, be well nigh, intend, wish."
    },

    {
        "indexid":4170,
        "wordid":14383,
        "word":"لِفِرْعَوْنَ",
        "rootid":44,
        "rootword":"ف ر ع",
        "meanings":"to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king.",
        "sentence":"The word لِفِرْعَوْنَ comes from the root ف ر ع and is associated with the meanings: to ascend, go down, overtop, surpass, branch, top of a tree, sprout, hair, consequence of a principle. Appellation of the ancient kings of Egypt and not the name of a particular king."
    },

    {
        "indexid":4170,
        "wordid":14905,
        "word":"إِلَهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word إِلَهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4170,
        "wordid":14906,
        "word":"لَأَظُنُّهُ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word لَأَظُنُّهُ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":4170,
        "wordid":15739,
        "word":"عَمَلِهِ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word عَمَلِهِ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":4170,
        "wordid":16500,
        "word":"كَاذِبًا",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَاذِبًا comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":4170,
        "wordid":16521,
        "word":"أَسْبَابَ",
        "rootid":458,
        "rootword":"س ب ب",
        "meanings":"to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie.",
        "sentence":"The word أَسْبَابَ comes from the root س ب ب and is associated with the meanings: to find the means of, occasion a thing, seek a living, be the cause of, use a thing as means for, rope, cause, occasion, way, means, road, account, love, relationship\/connection\/tie."
    },

    {
        "indexid":4170,
        "wordid":16522,
        "word":"فَأَطَّلِعَ",
        "rootid":1517,
        "rootword":"ط ل ع",
        "meanings":"to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah).",
        "sentence":"The word فَأَطَّلِعَ comes from the root ط ل ع and is associated with the meanings: to ascend\/rise, go up, learn, come on, come towards anyone, start from, climb upon, reach, sprout, notice, look, seek, examine, expose, explain, appear, inform, occur, consider, know. tal'un - the spathe or sheath in which the flowers of the date palm are enclosed, also the fruit when it first appears, fruit, ranged dates. tuluu - rising. matla'un - twilight of rising (of sun). atla'a (vb. 4) - to make manifest to anyone, cause one to understand. ittala'a for itta'ala'a (vb. 8) - to mount up, penetrate. attala'a for a'attala'a - has he penetrated (here the hamzah of union waslah being omitted after the interrogative hamzah)."
    },

    {
        "indexid":4170,
        "wordid":16523,
        "word":"وَصُدَّ",
        "rootid":1069,
        "rootword":"ص د د",
        "meanings":"to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water.",
        "sentence":"The word وَصُدَّ comes from the root ص د د and is associated with the meanings: to turn away, divert, hinder, avert. sadiidan - to shun a thing, shrink from, raise, clamour, shout, cry aloud. saddun - the act of hindering, diverting or turning away. sadiid - anything that is repulsive, hot or boiling water."
    },

    {
        "indexid":4170,
        "wordid":16524,
        "word":"تَبَابٍ",
        "rootid":433,
        "rootword":"ت ب ب",
        "meanings":"suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin.",
        "sentence":"The word تَبَابٍ comes from the root ت ب ب and is associated with the meanings: suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin."
    }]}