{"data":[
    {
        "indexid":4196,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4196,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4196,
        "wordid":7326,
        "word":"يَجْحَدُونَ",
        "rootid":735,
        "rootword":"ج ح د",
        "meanings":"To deny or disacknowledge a thing, to be niggardly or avaricious, poor or possess little good, dissipated or dispersed, little in quantity, scanty.",
        "sentence":"The word يَجْحَدُونَ comes from the root ج ح د and is associated with the meanings: To deny or disacknowledge a thing, to be niggardly or avaricious, poor or possess little good, dissipated or dispersed, little in quantity, scanty."
    },

    {
        "indexid":4196,
        "wordid":16560,
        "word":"يُؤْفَكُ",
        "rootid":924,
        "rootword":"ا ف ك",
        "meanings":"change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn.",
        "sentence":"The word يُؤْفَكُ comes from the root ا ف ك and is associated with the meanings: change its manner\/state, turn it away\/back, change\/pervert opinion\/judgement, deceive, lie\/falsehood\/untruth, overturn."
    }]}