{"data":[
    {
        "indexid":4221,
        "wordid":2116,
        "word":"يَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":4221,
        "wordid":2855,
        "word":"كِتَابٌ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كِتَابٌ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":4221,
        "wordid":3094,
        "word":"لِقَوْمٍ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word لِقَوْمٍ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4221,
        "wordid":10010,
        "word":"فُصِّلَتْ",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word فُصِّلَتْ comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    },

    {
        "indexid":4221,
        "wordid":10420,
        "word":"قُرْءَانًا",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word قُرْءَانًا comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":4221,
        "wordid":10421,
        "word":"عَرَبِيًّا",
        "rootid":1594,
        "rootword":"ع ر ب",
        "meanings":"Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven.",
        "sentence":"The word عَرَبِيًّا comes from the root ع ر ب and is associated with the meanings: Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven."
    }]}