{"data":[
    {
        "indexid":4240,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4240,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4240,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4240,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4240,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":4240,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4240,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4240,
        "wordid":2274,
        "word":"كَثِيرًا",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرًا comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":4240,
        "wordid":2724,
        "word":"تَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word تَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":4240,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":4240,
        "wordid":16625,
        "word":"تَسْتَتِرُونَ",
        "rootid":524,
        "rootword":"س ت ر",
        "meanings":"to cover\/veil\/conceal, veil\/covering\/curtain\/screen, modesty, covered one, hide oneself.",
        "sentence":"The word تَسْتَتِرُونَ comes from the root س ت ر and is associated with the meanings: to cover\/veil\/conceal, veil\/covering\/curtain\/screen, modesty, covered one, hide oneself."
    },

    {
        "indexid":4240,
        "wordid":16626,
        "word":"يَشْهَدَ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word يَشْهَدَ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":4240,
        "wordid":16627,
        "word":"سَمْعُكُمْ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word سَمْعُكُمْ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":4240,
        "wordid":16628,
        "word":"أَبْصَارُكُمْ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word أَبْصَارُكُمْ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":4240,
        "wordid":16629,
        "word":"جُلُودُكُمْ",
        "rootid":1152,
        "rootword":"ج ل د",
        "meanings":"To hit\/hurt\/beat the skin, to strike, flog with a whip, fall down, to compel, to be hardy\/strong\/sturdy, to be enduring or patient, to contend with someone, constrain\/compel\/necessitate.",
        "sentence":"The word جُلُودُكُمْ comes from the root ج ل د and is associated with the meanings: To hit\/hurt\/beat the skin, to strike, flog with a whip, fall down, to compel, to be hardy\/strong\/sturdy, to be enduring or patient, to contend with someone, constrain\/compel\/necessitate."
    },

    {
        "indexid":4240,
        "wordid":16630,
        "word":"ظَنَنْتُمْ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word ظَنَنْتُمْ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    }]}