{"data":[
    {
        "indexid":4290,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4290,
        "wordid":2034,
        "word":"يُؤْمِنُونَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُونَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4290,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4290,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4290,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4290,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4290,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":4290,
        "wordid":3487,
        "word":"لَفِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word لَفِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4290,
        "wordid":3488,
        "word":"بَعِيدٍ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعِيدٍ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":4290,
        "wordid":5379,
        "word":"ضَلَالٍ",
        "rootid":502,
        "rootword":"ض ل ل",
        "meanings":"Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place.",
        "sentence":"The word ضَلَالٍ comes from the root ض ل ل and is associated with the meanings: Erred, strayed, or went astray. Deviated from the right way or course. Missed or lost the right way. Lost something but does not know its place. Confounded or perplexed and unable to see the right course.Become hidden, unperceived, concealed, absent, or escaped. Went away.A lost state. A state of perishing, coming to naught, or passing away.Confusion, perplexity, and inability to see the right course.Skill in guiding, or directing aright, in journeying.One with whom is no good.Water running beneath a rock, or among trees, which the sun does not reach.Ragged land or ground, a hard and stony place."
    },

    {
        "indexid":4290,
        "wordid":8763,
        "word":"السَّاعَةِ",
        "rootid":385,
        "rootword":"س و ع",
        "meanings":"to let run free, pasture freely, be lost. sa'atun - while, present time, distance, hour, time.",
        "sentence":"The word السَّاعَةِ comes from the root س و ع and is associated with the meanings: to let run free, pasture freely, be lost. sa'atun - while, present time, distance, hour, time."
    },

    {
        "indexid":4290,
        "wordid":9848,
        "word":"يَسْتَعْجِلُ",
        "rootid":1279,
        "rootword":"ع ج ل",
        "meanings":"to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf.",
        "sentence":"The word يَسْتَعْجِلُ comes from the root ع ج ل and is associated with the meanings: to hasten, make speed, accelerate, be hasty, act hastily, hurry over, do speedily. ajalun - precipitation, haste. ajil - that which hastens away, transitory. ista'jala - to seek or desire to hasten, urge one to make haste in doing anything. ijlun - calf.. . 'Ajiltu (prf. 1st. sing.): I have hastened.. 'Ajiltum (prf. 2nd. plu.): They make haste.. Laa Ta'jal (prt. neg. m. sing.): Thou make no haste.. Li Ta'jala (imp. 2nd. m. sing. el.). In order to make haste.. 'Ajjala (prf. 3rd. m. sing. II): He would have hastened.. 'Ajjalnaa (prf. 1st. plu. II): We hastened.. 'Ajala : Made you depart in such haste (with 'An).. Ta'jjala (prf 3rd. m. sing. V.): He hastened.. Ista'jaltum (prf. 2nd. m. plu. X.): You sought to be hastened.. Yasta'jiluuna (imp. 3rd. m. plu. X.): They seek to expedite.. Tasta'jiluuna (imp. 2nd. m. plu.): You seek to hasten before its (fixed time), seek to expedite.. Laa Tasta'jil (prt. neg. m. sing. X.) : Thou do not seek to hasten.. Laa Tasta'jiluu (prt. neg. plu. X.): You do not seek to hasten.. 'Ajil (v. n.): Haste; Hurry up.. 'Aajilatun (act. pic. f. sing.): Quick-passing (world); Present (transitory life).. 'Ajuulan (acc. ints. n.): Ever hasty.. Isti'jaal (v. n. X.): Hastening.. 'Ijlun (n.): Calf."
    },

    {
        "indexid":4290,
        "wordid":13284,
        "word":"مُشْفِقُونَ",
        "rootid":338,
        "rootword":"ش ف ق",
        "meanings":"to pity, be anxious about, fear. shafaq - fear, pity, evening, twilight with its redness or whiteness, after sunset. ashfaqa - to be afraid. mushfiqun - one who is afraid or is in terror, compassionate, fearful one, tender.",
        "sentence":"The word مُشْفِقُونَ comes from the root ش ف ق and is associated with the meanings: to pity, be anxious about, fear. shafaq - fear, pity, evening, twilight with its redness or whiteness, after sunset. ashfaqa - to be afraid. mushfiqun - one who is afraid or is in terror, compassionate, fearful one, tender."
    },

    {
        "indexid":4290,
        "wordid":13960,
        "word":"وَيَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word وَيَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":4290,
        "wordid":16723,
        "word":"يُمَارُونَ",
        "rootid":897,
        "rootword":"م ر ي",
        "meanings":"To draw forth a thing, to dispute or contend, to doubt.",
        "sentence":"The word يُمَارُونَ comes from the root م ر ي and is associated with the meanings: To draw forth a thing, to dispute or contend, to doubt."
    }]}