{"data":[
    {
        "indexid":4336,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4336,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4336,
        "wordid":2202,
        "word":"مَاءً",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word مَاءً comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":4336,
        "wordid":3485,
        "word":"نَزَّلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word نَزَّلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":4336,
        "wordid":7758,
        "word":"مَيْتًا",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word مَيْتًا comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":4336,
        "wordid":8080,
        "word":"تُخْرَجُونَ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word تُخْرَجُونَ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":4336,
        "wordid":11326,
        "word":"بِقَدَرٍ",
        "rootid":414,
        "rootword":"ق د ر",
        "meanings":"to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail.",
        "sentence":"The word بِقَدَرٍ comes from the root ق د ر and is associated with the meanings: to measure\/decree\/determine\/stint\/straiten, to have power, to be able, a measure, means, ability, a term\/decree, doom, destiny, measured, decreed.qudrun - knowledge, law, value, power, measure, majesty, ability, glory, honour, standard, limit, destiny. taqdir - knowledge, law, measuring decree, judgement, ordering. maqduran - made absolute, executed. miqdar - due measurement, definite quantity. qidr (pl. qudurun) - cooking pot. qaddara - to make possible, prepare, devise, lay plan, facilitate. muqtadir - powerful, able to prevail."
    },

    {
        "indexid":4336,
        "wordid":14268,
        "word":"بَلْدَةً",
        "rootid":745,
        "rootword":"ب ل د",
        "meanings":"A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others",
        "sentence":"The word بَلْدَةً comes from the root ب ل د and is associated with the meanings: A country, land, region, province, district, territory, city, town, village or any portion of earth or land within certain limitsTract of land without vegetation, pastureWaterless desert, desolate placeEarth or ground.Remaining, staying, abiding, dwelling in the country\/place\/land\/town\/city\/village etcKeeping to something, having something remain (e.g. like marks on the skin)Becoming stupid, dull, wanting in intelligence\/vigor, inert, soft, weak, feeble, not effective in performance, lagging behind, becoming languid, lazy, impotent in workCast, or lay down on the ground maybe due to fatigue or weaknessRegions appearing short in extent due to darkness, or low visibilityKeeping, falling to the ground in submissiveness, keeping in place, being submissive and humbleObtaining, exercising dominion over land belonging to others"
    },

    {
        "indexid":4336,
        "wordid":16799,
        "word":"فَأَنْشَرْنَا",
        "rootid":993,
        "rootword":"ن ش ر",
        "meanings":"to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad.",
        "sentence":"The word فَأَنْشَرْنَا comes from the root ن ش ر and is associated with the meanings: to spread out, bring back to life, resuscitate, be extended, lay open, unfold, expand, display, spread abroad."
    }]}