{"data":[
    {
        "indexid":4337,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4337,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4337,
        "wordid":2297,
        "word":"خَلَقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":4337,
        "wordid":2326,
        "word":"كُلَّهَا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّهَا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":4337,
        "wordid":4622,
        "word":"وَالْأَنْعَامِ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word وَالْأَنْعَامِ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":4337,
        "wordid":6913,
        "word":"وَجَعَلَ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلَ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":4337,
        "wordid":8241,
        "word":"الْفُلْكِ",
        "rootid":362,
        "rootword":"ف ل ك",
        "meanings":"become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round.",
        "sentence":"The word الْفُلْكِ comes from the root ف ل ك and is associated with the meanings: become round, anything circular, persist\/persevere, ship, Ark, the place of the revolving of the stars, the celestial sphere, vault of heaven, firmament, surrounding spheres, sky, revolvement, circling, circuit, going to and fro, in a state of commotion, whirl of a spindle, one who goes round."
    },

    {
        "indexid":4337,
        "wordid":15883,
        "word":"الْأَزْوَاجَ",
        "rootid":1539,
        "rootword":"ز و ج",
        "meanings":"to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse.",
        "sentence":"The word الْأَزْوَاجَ comes from the root ز و ج and is associated with the meanings: to couple\/join\/pair\/unite\/wed, marriage, a pair, a fellow or like, spouse."
    },

    {
        "indexid":4337,
        "wordid":16800,
        "word":"تَرْكَبُونَ",
        "rootid":491,
        "rootword":"ر ك ب",
        "meanings":"to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend.",
        "sentence":"The word تَرْكَبُونَ comes from the root ر ك ب and is associated with the meanings: to ride, embark, mount, be carried, go on board of a ship, voyage on (the sea), walk on (a road), commit (a fault). rakbun - caravan. rukban (pl. of rakib) - one who rides, mounted. rikab - camels. rakub - use of a beast for riding. mutarakibun - laying in heaps, ridden on one another, close growing, cluster over clustered, layer upon layer. tarkabunna - to pass on, rise, ascend."
    }]}