{"data":[
    {
        "indexid":4343,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4343,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":4343,
        "wordid":3768,
        "word":"الْخِصَامِ",
        "rootid":57,
        "rootword":"خ ص م",
        "meanings":"Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something.",
        "sentence":"The word الْخِصَامِ comes from the root خ ص م and is associated with the meanings: Contend in an altercation, dispute\/litigate in a sound or valid manner, to say a thing such as may cause the listener to refrain\/desist from his assertion\/plea\/claim, overcome someone in an altercation, antagonize, put a thing on the edge\/side or corner of something."
    },

    {
        "indexid":4343,
        "wordid":5380,
        "word":"مُبِينٍ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word مُبِينٍ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4343,
        "wordid":6208,
        "word":"غَيْرُ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرُ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":4343,
        "wordid":7757,
        "word":"أَوَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word أَوَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4343,
        "wordid":16810,
        "word":"يُنَشَّؤُا",
        "rootid":1122,
        "rootword":"ن ش ا",
        "meanings":"lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night.",
        "sentence":"The word يُنَشَّؤُا comes from the root ن ش ا and is associated with the meanings: lived, arose, become elevated\/high, grow up, create\/produce\/originate, it happened\/occurred, raise, to found\/build, began, specifically discussing 73:6 = rising in the night, first part\/hours of the night, every hour of the night in which one rises, every hour of the night."
    },

    {
        "indexid":4343,
        "wordid":16811,
        "word":"الْحِلْيَةِ",
        "rootid":1788,
        "rootword":"ح ل ي",
        "meanings":"To give ornaments, adorn with ornaments.",
        "sentence":"The word الْحِلْيَةِ comes from the root ح ل ي and is associated with the meanings: To give ornaments, adorn with ornaments."
    }]}