{"data":[
    {
        "indexid":4350,
        "wordid":2286,
        "word":"كَيْفَ",
        "rootid":148,
        "rootword":"ك ي ف",
        "meanings":"",
        "sentence":"The word كَيْفَ comes from the root ك ي ف and is associated with the meanings: "
    },

    {
        "indexid":4350,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4350,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4350,
        "wordid":4281,
        "word":"فَانْظُرْ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَانْظُرْ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":4350,
        "wordid":5220,
        "word":"عَاقِبَةُ",
        "rootid":1507,
        "rootword":"ع ق ب",
        "meanings":"to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged.",
        "sentence":"The word عَاقِبَةُ comes from the root ع ق ب and is associated with the meanings: to succeed, take the place of, come after, strike on the heel, come at the heel, follow anyone closely. aqqaba - to endeavour repeatedly, return, punish, requitt, retrace one's step. aqab - to die, leave offsprings, give in exchange. aqabatun - place hard to ascent. uqbun - success. ta'aqqaba - to take careful information, shout, follow step by step. aqub - heel, son, grandson, offspring, pivot, axis. uqba - requital, result, reward, end, success. iqab (pl. aqubat) - punishment after sin, one who puts off or reverses, who looks at the consequence or result of the affair. mu'aqqibat - who succeed each other, some thing that comes immediately after another thing or succeeds another thing without interruption. It is a double plural feminine of mu'aqqib. The plural feminine form indicates the frequency of the deeds, since in Arabic the feminine form is sometimes employed to impart emphasis and frequency.. . Yu'aqqib (imp. 3rd. f. sing. juss. vb. II): Look back.. 'Aqaba (prf. 3rd. m. sing. vb. III.): He retaliated.. 'Aaqabtum (prf. 2nd. m. sing. vb. II): You punished.. 'Aqibuu (prt. m. sing. vb. III.) You punish.. A'qaba (perf. 3rd. m. sing. vb. IV.): Caused to follow.. 'Uqiba (pp. 3rd. m. sing. vb. III): He was punished; was made to suffer.. 'Uqibtum (3rd. m. plu. vb. II ): You have been persecuted.. A'qaba (prf. 3rd. m. sing. vb. IV): He has punished.. 'Uqbun \/ 'Uqban (acc.\/n.): Result; Final end.. 'Aqibun (n.):Posterior; Heel.. 'Aqibai (n. dual): Two heels.. A'qaab (n. plu.): Heels.. Iqaabun (v. n.): Retribution (chastisement) that comes as a result of consequences of sins.. 'Aqabatu (n.): Steep and difficult ascent; Mountain road; Road in the upper part of a mountain or a long mountain that lies across the way; Difficult affair and path of duty.. 'Uqbaa (n.): Ending. It is with final Yaa, but if added to a pronoun the final Yaa turns to Alif as 'Uqbahaa (here an Alif before Haa).. 'Aqibatun (act. pic. f. sing.): End.. Al-Aaqibatu: The happy and good end.. Mu'aqqibun (ap-der. vb. II): Who can reverse.. Mu'aqqibaat (plu.): Those who join their duties in succession; Successively ranged."
    },

    {
        "indexid":4350,
        "wordid":5221,
        "word":"الْمُكَذِّبِينَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word الْمُكَذِّبِينَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":4350,
        "wordid":8491,
        "word":"فَانْتَقَمْنَا",
        "rootid":1343,
        "rootword":"ن ق م",
        "meanings":"to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment.",
        "sentence":"The word فَانْتَقَمْنَا comes from the root ن ق م and is associated with the meanings: to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment."
    }]}