{"data":[
    {
        "indexid":4355,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4355,
        "wordid":2267,
        "word":"الْحَقُّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقُّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":4355,
        "wordid":4643,
        "word":"جَاءَهُمُ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَهُمُ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4355,
        "wordid":7154,
        "word":"سِحْرٌ",
        "rootid":1083,
        "rootword":"س ح ر",
        "meanings":"To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding.",
        "sentence":"The word سِحْرٌ comes from the root س ح ر and is associated with the meanings: To turn it\/him from his course, way, or manner of being. The turning of a thing from its proper manner of being to another.Lane says that \"He (an enchanter) apparently turned the thing from its proper manner of being, making what was false to appear in the form of the true, or real; causing the thing to be imagined different from what it really was.\"To deceive, delude, beguile, or outwit. The producing what is false in the form of truth. Embellishment by falsification and deceit. A kind of enchantment, or fascination which captivates the eye and the like. Skillful eloquence [something which is praiseworthy]. Early in the morning, or the first part of day (the time of), a little before daybreak, or the false dawn. Whiteness overspreading blackness. Food marred or spoilt. Having little milk, or large in her udder but having little milk. To guild, fascinate, bewitch, wheedle, turn anyone from, enchant, practice sorcery, hoax, deprive of understanding."
    },

    {
        "indexid":4355,
        "wordid":8158,
        "word":"كَافِرُونَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَافِرُونَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    }]}