{"data":[
    {
        "indexid":4380,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4380,
        "wordid":3391,
        "word":"أَجْمَعِينَ",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word أَجْمَعِينَ comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":4380,
        "wordid":8492,
        "word":"فَأَغْرَقْنَاهُمْ",
        "rootid":344,
        "rootword":"غ ر ق",
        "meanings":"sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory",
        "sentence":"The word فَأَغْرَقْنَاهُمْ comes from the root غ ر ق and is associated with the meanings: sank, drowned, went downwards and disappeared, became without need, drew the bow to the full (with vehement fulling), outstripped, engrossed, a man overwhelmed by trials, single draught, ornamented, obligatory"
    },

    {
        "indexid":4380,
        "wordid":16875,
        "word":"ءَاسَفُونَا",
        "rootid":720,
        "rootword":"ا س ف",
        "meanings":"to be sad, grieved about, afflicted with.",
        "sentence":"The word ءَاسَفُونَا comes from the root ا س ف and is associated with the meanings: to be sad, grieved about, afflicted with."
    },

    {
        "indexid":4380,
        "wordid":16876,
        "word":"انْتَقَمْنَا",
        "rootid":1343,
        "rootword":"ن ق م",
        "meanings":"to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment.",
        "sentence":"The word انْتَقَمْنَا comes from the root ن ق م and is associated with the meanings: to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment."
    }]}