{"data":[
    {
        "indexid":4398,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4398,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4398,
        "wordid":4829,
        "word":"تَأْكُلُونَ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word تَأْكُلُونَ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":4398,
        "wordid":6204,
        "word":"كَثِيرَةٌ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثِيرَةٌ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":4398,
        "wordid":15911,
        "word":"فَاكِهَةٌ",
        "rootid":1009,
        "rootword":"ف ك ه",
        "meanings":"became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration.",
        "sentence":"The word فَاكِهَةٌ comes from the root ف ك ه and is associated with the meanings: became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration."
    }]}