{"data":[
    {
        "indexid":441,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":441,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":441,
        "wordid":2556,
        "word":"الْمُحْسِنِينَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word الْمُحْسِنِينَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":441,
        "wordid":2818,
        "word":"الدُّنْيَا",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word الدُّنْيَا comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":441,
        "wordid":2974,
        "word":"الْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":441,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":441,
        "wordid":5259,
        "word":"ثَوَابَ",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word ثَوَابَ comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    },

    {
        "indexid":441,
        "wordid":5274,
        "word":"فَءَاتَاهُمُ",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word فَءَاتَاهُمُ comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":441,
        "wordid":5275,
        "word":"وَحُسْنَ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word وَحُسْنَ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":441,
        "wordid":5276,
        "word":"ثَوَابِ",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word ثَوَابِ comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    }]}