{"data":[
    {
        "indexid":4430,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":4430,
        "wordid":12922,
        "word":"الْكُبْرَى",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word الْكُبْرَى comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":4430,
        "wordid":15323,
        "word":"مُنْتَقِمُونَ",
        "rootid":1343,
        "rootword":"ن ق م",
        "meanings":"to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment.",
        "sentence":"The word مُنْتَقِمُونَ comes from the root ن ق م and is associated with the meanings: to punish, accuse, develop hate, revenge, persecute, find fault, disapprove, dislike with tongue or punishment."
    },

    {
        "indexid":4430,
        "wordid":16924,
        "word":"نَبْطِشُ",
        "rootid":518,
        "rootword":"ب ط ش",
        "meanings":"An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault",
        "sentence":"The word نَبْطِشُ comes from the root ب ط ش and is associated with the meanings: An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault"
    },

    {
        "indexid":4430,
        "wordid":16925,
        "word":"الْبَطْشَةَ",
        "rootid":518,
        "rootword":"ب ط ش",
        "meanings":"An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault",
        "sentence":"The word الْبَطْشَةَ comes from the root ب ط ش and is associated with the meanings: An assault, violent seizureSeizing violently, assaulting vehemently or in angerTaking hold of something, clinging to somethingWorking laboring or wrought (with hands)RecoveringLaboring, striving, and struggling to overcomeMight or strength in war or fight, courage\/valor, valiantness or prowessPlace of assault"
    }]}