{"data":[
    {
        "indexid":4462,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4462,
        "wordid":3153,
        "word":"عَذَابِ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابِ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":4462,
        "wordid":3696,
        "word":"رَأْسِهِ",
        "rootid":1298,
        "rootword":"ر ا س",
        "meanings":"head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people.",
        "sentence":"The word رَأْسِهِ comes from the root ر ا س and is associated with the meanings: head, head\/chief\/commander\/ruler\/governor\/prince, strike on the head, set any one over, become high in rank\/condition, highest or uppermost part, the capital\/principal of money, the beginning or first part, numerous and strong company of people."
    },

    {
        "indexid":4462,
        "wordid":4865,
        "word":"فَوْقَ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":4462,
        "wordid":16572,
        "word":"الْحَمِيمِ",
        "rootid":1004,
        "rootword":"ح م م",
        "meanings":"To heat, become hot or very hot, melt. Boiling water. Loyal\/close friend\/relative. Black smoke.",
        "sentence":"The word الْحَمِيمِ comes from the root ح م م and is associated with the meanings: To heat, become hot or very hot, melt. Boiling water. Loyal\/close friend\/relative. Black smoke."
    },

    {
        "indexid":4462,
        "wordid":16954,
        "word":"صُبُّوا",
        "rootid":1091,
        "rootword":"ص ب ب",
        "meanings":"to pour out, be poured out. sabbun - the act of pouring. sabban - the act of pouring heavily.",
        "sentence":"The word صُبُّوا comes from the root ص ب ب and is associated with the meanings: to pour out, be poured out. sabbun - the act of pouring. sabban - the act of pouring heavily."
    }]}