{"data":[
    {
        "indexid":447,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":447,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":447,
        "wordid":2079,
        "word":"بِاللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word بِاللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":447,
        "wordid":2168,
        "word":"وَاللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word وَاللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":447,
        "wordid":2305,
        "word":"عَلِيمٌ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word عَلِيمٌ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":447,
        "wordid":2560,
        "word":"غَيْرَ",
        "rootid":1468,
        "rootword":"غ ي ر",
        "meanings":"bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders.",
        "sentence":"The word غَيْرَ comes from the root غ ي ر and is associated with the meanings: bring, convey, benefit, bestowed upon; alter or change a thing for the worse, corrupted, tainted, infected, render it ill-smelling; adjusting, repairing; difference between two persons; become jealous; procure; other than (exclusively), except, without; lies; [a man’s] dislike of another’s participation in what supposedly his right; care of what is sacred or inviolable to avoid suspicion of disdain; cognizance or badge of a free non-Muslim subjects in a Muslim government; one who puts off the furniture of his camel from off him to relieve and ease him. mughiraat - raiders."
    },

    {
        "indexid":447,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":447,
        "wordid":3514,
        "word":"كُتِبَ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word كُتِبَ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":447,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":447,
        "wordid":5313,
        "word":"أَمَنَةً",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word أَمَنَةً comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":447,
        "wordid":2864,
        "word":"أَنْزَلَ",
        "rootid":564,
        "rootword":"ن ز ل",
        "meanings":"to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation.",
        "sentence":"The word أَنْزَلَ comes from the root ن ز ل and is associated with the meanings: to descend, come down, go down, happen, alight at, settle in a place, lodge. anzala - to send down, give. nazulun - that which is prepared for a guest's entertainment, abode, gift. manzil - mansion, station. nazzala - to cause to descend, send down. tanziil - sending down, divine revelation, orderly arrangement and authentic compilation, gradual revelation."
    },

    {
        "indexid":447,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":447,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":447,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":447,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":447,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":447,
        "wordid":5062,
        "word":"قُلُوبِكُمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبِكُمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":447,
        "wordid":2752,
        "word":"يَقُولُونَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُونَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":447,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":447,
        "wordid":3020,
        "word":"أَنْفُسِهِمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسِهِمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":447,
        "wordid":5319,
        "word":"أَنْفُسُهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسُهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":447,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":447,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":447,
        "wordid":5323,
        "word":"كُلَّهُ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلَّهُ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":447,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":447,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":447,
        "wordid":3525,
        "word":"شَيْءٌ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٌ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":447,
        "wordid":2615,
        "word":"الْحَقِّ",
        "rootid":1643,
        "rootword":"ح ق ق",
        "meanings":"To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve.",
        "sentence":"The word الْحَقِّ comes from the root ح ق ق and is associated with the meanings: To be right, just or fitting, worthy of, justly due to, proper, genuine, real, a fact, true, necessitated, suitable, necessary, incumbent upon, suited to the requirement of justice, become certain, authentic, deserve."
    },

    {
        "indexid":447,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":447,
        "wordid":5187,
        "word":"الْأَمْرِ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word الْأَمْرِ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":447,
        "wordid":5322,
        "word":"الْأَمْرَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word الْأَمْرَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":447,
        "wordid":5325,
        "word":"يُبْدُونَ",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word يُبْدُونَ comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    },

    {
        "indexid":447,
        "wordid":2458,
        "word":"يَظُنُّونَ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word يَظُنُّونَ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":447,
        "wordid":5320,
        "word":"ظَنَّ",
        "rootid":668,
        "rootword":"ظ ن ن",
        "meanings":"To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. ",
        "sentence":"The word ظَنَّ comes from the root ظ ن ن and is associated with the meanings: To think, suppose, doubt, assume, deem, believe, know, imagine, suspect, conjunctive, be sure of something in view of one's observations. As a general rule often this verb is succeeded by 'anna or 'an, that means to be sure about.. . Zanna (prf. 3rd. p.m. sing, assim.): He thought, imagined, deemed, assumed, believed, conjectured, suspected; He was sure.. Zanantu (prf. 1st, p.m. sing.): I was sure.. Zannaa  (prf. 3rd. p.m. dual.): The twain thought.. Zannuu (prf. 3rd. p.m. plu.): They imagined.. Zanantum (prf. 2nd p.m. plu.): Ye thought.. Zananna (prf. 1st. p. plu.): We thought.. Yazunnu (imp. 3rd. p.m. sing.): He thinks.. Tazunnu (imp. 3rd. p. f. sing.): She thinks.. Azunnu (imp. 1st. P. sing.): I think.. Yazunnuuna (imp. 3rd, p. in. plu.): They know, believe, conjuncture.. Tazunnuuna (imp. 2nd. p.m. plu.): You entertained wrong thoughts.. Nazunnu (imp. 1st. p. plu.): We deem.. Zannun\/Zannan  (nom.\/acc.n.): Thinking; Conjecture.. Zunuuna (n. plu.): Diverse thoughts.. Zaanniina (act. pic. n. plu.): Entertainers of evil thought.. "
    },

    {
        "indexid":447,
        "wordid":5331,
        "word":"وَلِيَبْتَلِيَ",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word وَلِيَبْتَلِيَ comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    },

    {
        "indexid":447,
        "wordid":5326,
        "word":"قُتِلْنَا",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word قُتِلْنَا comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":447,
        "wordid":5329,
        "word":"الْقَتْلُ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word الْقَتْلُ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":447,
        "wordid":5312,
        "word":"الْغَمِّ",
        "rootid":973,
        "rootword":"غ م م",
        "meanings":"covered, veiled, concealed, confusedness, obscureness, calamity, misfortune",
        "sentence":"The word الْغَمِّ comes from the root غ م م and is associated with the meanings: covered, veiled, concealed, confusedness, obscureness, calamity, misfortune"
    },

    {
        "indexid":447,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":447,
        "wordid":5321,
        "word":"الْجَاهِلِيَّةِ",
        "rootid":443,
        "rootword":"ج ه ل",
        "meanings":"To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan.",
        "sentence":"The word الْجَاهِلِيَّةِ comes from the root ج ه ل and is associated with the meanings: To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan."
    },

    {
        "indexid":447,
        "wordid":5140,
        "word":"بِذَاتِ",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word بِذَاتِ comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":447,
        "wordid":4831,
        "word":"بُيُوتِكُمْ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word بُيُوتِكُمْ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":447,
        "wordid":5316,
        "word":"طَائِفَةً",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word طَائِفَةً comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":447,
        "wordid":5317,
        "word":"وَطَائِفَةٌ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word وَطَائِفَةٌ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":447,
        "wordid":3794,
        "word":"هَلْ",
        "rootid":824,
        "rootword":"ه ل",
        "meanings":"is it ... ?",
        "sentence":"The word هَلْ comes from the root ه ل and is associated with the meanings: is it ... ?"
    },

    {
        "indexid":447,
        "wordid":5328,
        "word":"لَبَرَزَ",
        "rootid":217,
        "rootword":"ب ر ز",
        "meanings":"went\/came\/passed out\/forth, issued, appeared, became apparent\/manifest\/evident, became prominent\/projecting, put forth, produce\/publish, uncovered, outstrip\/surpass, go beyond a thing, a man characterized by pleasing\/goodly aspect and by intelligence, a field or wide expanse of land without trees.",
        "sentence":"The word لَبَرَزَ comes from the root ب ر ز and is associated with the meanings: went\/came\/passed out\/forth, issued, appeared, became apparent\/manifest\/evident, became prominent\/projecting, put forth, produce\/publish, uncovered, outstrip\/surpass, go beyond a thing, a man characterized by pleasing\/goodly aspect and by intelligence, a field or wide expanse of land without trees."
    },

    {
        "indexid":447,
        "wordid":5324,
        "word":"يُخْفُونَ",
        "rootid":1414,
        "rootword":"خ ف ي",
        "meanings":"Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed).",
        "sentence":"The word يُخْفُونَ comes from the root خ ف ي and is associated with the meanings: Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed)."
    },

    {
        "indexid":447,
        "wordid":4699,
        "word":"صُدُورِكُمْ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word صُدُورِكُمْ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    },

    {
        "indexid":447,
        "wordid":5141,
        "word":"الصُّدُورِ",
        "rootid":1621,
        "rootword":"ص د ر",
        "meanings":"To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place.",
        "sentence":"The word الصُّدُورِ comes from the root ص د ر and is associated with the meanings: To return from, come back, proceed, issue or emanate from, go forward, advance or promote, come to pass, happen, emanate from, strike on the chest\/breast, commence. Anything that fronts, or faces one; hence breast, chest or bosom [often meaning his mind]. The fore part of anything. Going, or turning back and away.sadr - heart\/breast\/chest, mind, prominent place."
    },

    {
        "indexid":447,
        "wordid":5318,
        "word":"أَهَمَّتْهُمْ",
        "rootid":115,
        "rootword":"ه م م",
        "meanings":"to worry\/regard\/care, concern, ponder anything in one's mind, desire, meditate, think about, design, anxious, plot against, intend, purpose.",
        "sentence":"The word أَهَمَّتْهُمْ comes from the root ه م م and is associated with the meanings: to worry\/regard\/care, concern, ponder anything in one's mind, desire, meditate, think about, design, anxious, plot against, intend, purpose."
    },

    {
        "indexid":447,
        "wordid":5236,
        "word":"وَلِيُمَحِّصَ",
        "rootid":1741,
        "rootword":"م ح ص",
        "meanings":"To be clear\/pure\/free from admixture or imperfection, run vehemently or vigorously, to be quick or swift in running.",
        "sentence":"The word وَلِيُمَحِّصَ comes from the root م ح ص and is associated with the meanings: To be clear\/pure\/free from admixture or imperfection, run vehemently or vigorously, to be quick or swift in running."
    },

    {
        "indexid":447,
        "wordid":5314,
        "word":"نُعَاسًا",
        "rootid":1036,
        "rootword":"ن ع س",
        "meanings":"to drowse, doze, be weak, be somnolent.",
        "sentence":"The word نُعَاسًا comes from the root ن ع س and is associated with the meanings: to drowse, doze, be weak, be somnolent."
    },

    {
        "indexid":447,
        "wordid":5330,
        "word":"مَضَاجِعِهِمْ",
        "rootid":1158,
        "rootword":"ض ج ع",
        "meanings":"to incline to setting, incline. Slumber, way of reclining, bed-fellow, sleeping room\/bed, resting place, couch.",
        "sentence":"The word مَضَاجِعِهِمْ comes from the root ض ج ع and is associated with the meanings: to incline to setting, incline. Slumber, way of reclining, bed-fellow, sleeping room\/bed, resting place, couch."
    }]}