{"data":[
    {
        "indexid":4483,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4483,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4483,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4483,
        "wordid":2072,
        "word":"عَذَابٌ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابٌ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":4483,
        "wordid":2073,
        "word":"عَظِيمٌ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عَظِيمٌ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":4483,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4483,
        "wordid":2224,
        "word":"دُونِ",
        "rootid":233,
        "rootword":"د و ن",
        "meanings":"",
        "sentence":"The word دُونِ comes from the root د و ن and is associated with the meanings: "
    },

    {
        "indexid":4483,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":4483,
        "wordid":3755,
        "word":"كَسَبُوا",
        "rootid":852,
        "rootword":"ك س ب",
        "meanings":"To gain, acquire, seek after, gather (riches), do, commit, earn.",
        "sentence":"The word كَسَبُوا comes from the root ك س ب and is associated with the meanings: To gain, acquire, seek after, gather (riches), do, commit, earn."
    },

    {
        "indexid":4483,
        "wordid":3779,
        "word":"جَهَنَّمُ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word جَهَنَّمُ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":4483,
        "wordid":4587,
        "word":"عَنْهُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":4483,
        "wordid":4694,
        "word":"أَوْلِيَاءَ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word أَوْلِيَاءَ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":4483,
        "wordid":6451,
        "word":"اتَّخَذُوا",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word اتَّخَذُوا comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":4483,
        "wordid":9821,
        "word":"يُغْنِي",
        "rootid":1175,
        "rootword":"غ ن ي",
        "meanings":"free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized",
        "sentence":"The word يُغْنِي comes from the root غ ن ي and is associated with the meanings: free from wants, having no wants, in a state of competence or sufficiency or rich or wealthy; dwelt, abode; sing, chanted; eulogized, satirized"
    },

    {
        "indexid":4483,
        "wordid":13864,
        "word":"وَرَائِهِمْ",
        "rootid":1207,
        "rootword":"و ر ي",
        "meanings":"made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses).",
        "sentence":"The word وَرَائِهِمْ comes from the root و ر ي and is associated with the meanings: made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses)."
    }]}