{"data":[
    {
        "indexid":4504,
        "wordid":2058,
        "word":"كَفَرُوا",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word كَفَرُوا comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":4504,
        "wordid":2288,
        "word":"وَكُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4504,
        "wordid":4880,
        "word":"تَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4504,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4504,
        "wordid":5051,
        "word":"تُتْلَى",
        "rootid":920,
        "rootword":"ت ل و",
        "meanings":"To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing.",
        "sentence":"The word تُتْلَى comes from the root ت ل و and is associated with the meanings: To follow, walk behind, imitate, pursue, consecutive. To read, recite, peruse, rehearse, declare, meditate.Sought repeatedly, collect.Bond or obligation.One who relieves or aids another in singing."
    },

    {
        "indexid":4504,
        "wordid":8481,
        "word":"مُجْرِمِينَ",
        "rootid":387,
        "rootword":"ج ر م",
        "meanings":"",
        "sentence":"The word مُجْرِمِينَ comes from the root ج ر م and is associated with the meanings: "
    },

    {
        "indexid":4504,
        "wordid":10906,
        "word":"أَفَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word أَفَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":4504,
        "wordid":16999,
        "word":"فَاسْتَكْبَرْتُمْ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word فَاسْتَكْبَرْتُمْ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    }]}