{"data":[
    {
        "indexid":4509,
        "wordid":2004,
        "word":"الْحَمْدُ",
        "rootid":41,
        "rootword":"ح م د",
        "meanings":"To praise.",
        "sentence":"The word الْحَمْدُ comes from the root ح م د and is associated with the meanings: To praise."
    },

    {
        "indexid":4509,
        "wordid":2006,
        "word":"رَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4509,
        "wordid":2007,
        "word":"الْعَالَمِينَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعَالَمِينَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":4509,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":4509,
        "wordid":2348,
        "word":"السَّمَاوَاتِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاوَاتِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4509,
        "wordid":7915,
        "word":"فَلِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word فَلِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4509,
        "wordid":17008,
        "word":"وَرَبِّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word وَرَبِّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    }]}