{"data":[
    {
        "indexid":4533,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4533,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4533,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4533,
        "wordid":2521,
        "word":"عِنْدَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":4533,
        "wordid":4644,
        "word":"الْعِلْمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word الْعِلْمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":4533,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4533,
        "wordid":5295,
        "word":"أَرَاكُمْ",
        "rootid":1498,
        "rootword":"ر ا ي",
        "meanings":"to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance.",
        "sentence":"The word أَرَاكُمْ comes from the root ر ا ي and is associated with the meanings: to see\/think\/hold, in opinion of, perceive, judge, consider, know. ara'itaka \/ ara'itakum - do tell me thou\/you (the personal pronoun Kaf is added for emphasis and is not purely as pleonism without adding to the meaning). tara'ni is for a compound word of a verb tara followed by a pronoun ni - you see me. badi al-ra'yi - having superficial view, outward appearance, first thought, apparently, without proper consideration. ra'yal'ain - to see with naked eye, judgement by sight. ri'yun - outward appearance, make a show. ru'ya - vision dream. a'lam tara - behold! lo! ri'aun - hypocrisy, ostentation, to be seen. tara'a - to see one another, consider, come in sight of one another. yura'una - they deceive hypocritically assuming a false appearance."
    },

    {
        "indexid":4533,
        "wordid":8230,
        "word":"وَلَكِنِّي",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنِّي comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":4533,
        "wordid":8330,
        "word":"أُرْسِلْتُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word أُرْسِلْتُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":4533,
        "wordid":8511,
        "word":"تَجْهَلُونَ",
        "rootid":443,
        "rootword":"ج ه ل",
        "meanings":"To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan.",
        "sentence":"The word تَجْهَلُونَ comes from the root ج ه ل and is associated with the meanings: To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan."
    },

    {
        "indexid":4533,
        "wordid":17047,
        "word":"وَأُبَلِّغُكُمْ",
        "rootid":1777,
        "rootword":"ب ل غ",
        "meanings":"Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money",
        "sentence":"The word وَأُبَلِّغُكُمْ comes from the root ب ل غ and is associated with the meanings: Reaching, attaining, arriving, coming to the utmost point to which one directs one's course or one who seeks, pursues, desires, intends or tries to reach. Or the reaching, attaining or coming to a point.. An event\/time that is premeditated, intended, determined or appointed. Having an effect. Bringing, conveying or delivering communications, announcements, news or tidings. Exceeding usual, proper, ordinary just bounds\/degrees, acting egregiously, immoderately or extravagantly. Striving, laboring, exerting power\/efforts. Endeavors or ability. Employing oneself vigorously, strenuously, laboriously, earnestly with energy and effectiveness, taking pains or extraordinary pains, not flagging, to the utmost degree. Accomplishing, attaining to the utmost of one's power\/ability or efforts\/endeavors (e.g. in any affair). Sufficiency (e.g. means of subsistence), a thing that suffices, contents, enables one to attain what is sought, enough. A slanderer, one who conveys gossip or other peoples discourse to others. Calamity, misfortune, disaster, distress or affliction. Sharp, penetrating, eloquent and\/or effective in speech. Firm covenants, in the utmost degree. Attaining or having attained puberty, virility, ripeness or maturity. Applied to either sexes. Good, excellent thing. Praise, eulogy or commendation. Place and\/or time someone or something reaches, arrives, attains or comes to. The sum\/amount\/product resulting from subtraction, addition or multiplication. A sum of money"
    }]}