{"data":[
    {
        "indexid":4539,
        "wordid":2044,
        "word":"إِلَيْكَ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْكَ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4539,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4539,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":4539,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4539,
        "wordid":6109,
        "word":"الْقُرْءَانَ",
        "rootid":1433,
        "rootword":"ق ر ا",
        "meanings":"to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation.",
        "sentence":"The word الْقُرْءَانَ comes from the root ق ر ا and is associated with the meanings: to recite\/read, compilation, collection, reading, recitation, explanation, study, investigation."
    },

    {
        "indexid":4539,
        "wordid":7790,
        "word":"الْجِنِّ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجِنِّ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":4539,
        "wordid":9831,
        "word":"يَسْتَمِعُونَ",
        "rootid":1331,
        "rootword":"س م ع",
        "meanings":"to hear, hearken, listen.",
        "sentence":"The word يَسْتَمِعُونَ comes from the root س م ع and is associated with the meanings: to hear, hearken, listen."
    },

    {
        "indexid":4539,
        "wordid":9844,
        "word":"قُضِيَ",
        "rootid":1066,
        "rootword":"ق ض ي",
        "meanings":"to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal.",
        "sentence":"The word قُضِيَ comes from the root ق ض ي and is associated with the meanings: to finish entirely by word\/deed, decreed\/ordained\/pronounced\/decide judicially, pass a sentence, create, bring to an end, attained\/obtained\/accomplished\/satisfied, execute, settle, discharge, to make known, reveal."
    },

    {
        "indexid":4539,
        "wordid":9907,
        "word":"قَوْمِهِمْ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمِهِمْ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4539,
        "wordid":11942,
        "word":"وَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word وَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":4539,
        "wordid":12313,
        "word":"نَفَرًا",
        "rootid":1660,
        "rootword":"ن ف ر",
        "meanings":"to run away from fight, go forth from any business (as from war), march, grow wild, restive.",
        "sentence":"The word نَفَرًا comes from the root ن ف ر and is associated with the meanings: to run away from fight, go forth from any business (as from war), march, grow wild, restive."
    },

    {
        "indexid":4539,
        "wordid":16038,
        "word":"مُنْذِرِينَ",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word مُنْذِرِينَ comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":4539,
        "wordid":17062,
        "word":"صَرَفْنَا",
        "rootid":903,
        "rootword":"ص ر ف",
        "meanings":"to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside.",
        "sentence":"The word صَرَفْنَا comes from the root ص ر ف and is associated with the meanings: to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside."
    },

    {
        "indexid":4539,
        "wordid":17063,
        "word":"حَضَرُوهُ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word حَضَرُوهُ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    },

    {
        "indexid":4539,
        "wordid":17064,
        "word":"أَنْصِتُوا",
        "rootid":1659,
        "rootword":"ن ص ت",
        "meanings":"to keep quiet\/silent.",
        "sentence":"The word أَنْصِتُوا comes from the root ن ص ت and is associated with the meanings: to keep quiet\/silent."
    }]}