{"data":[
    {
        "indexid":4582,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4582,
        "wordid":17169,
        "word":"يَسْءَلْكُمُوهَا",
        "rootid":1213,
        "rootword":"س ا ل",
        "meanings":"to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible.",
        "sentence":"The word يَسْءَلْكُمُوهَا comes from the root س ا ل and is associated with the meanings: to ask\/interrogate\/inquire\/question\/demand\/pray\/beg, a thing asked, a question\/proposition\/problem\/petition\/request, beggar, that which is demanded or inquired into, asked, questioned, responsible."
    },

    {
        "indexid":4582,
        "wordid":17171,
        "word":"تَبْخَلُوا",
        "rootid":157,
        "rootword":"ب خ ل",
        "meanings":"becoming or being stingy, miserly, niggardly or avaricious, withholding.",
        "sentence":"The word تَبْخَلُوا comes from the root ب خ ل and is associated with the meanings: becoming or being stingy, miserly, niggardly or avaricious, withholding."
    },

    {
        "indexid":4582,
        "wordid":17172,
        "word":"وَيُخْرِجْ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word وَيُخْرِجْ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":4582,
        "wordid":17173,
        "word":"أَضْغَانَكُمْ",
        "rootid":902,
        "rootword":"ض غ ن",
        "meanings":"Became niggardly, tenacious, stingy, or avaricious. A thing highly esteemed, of which one is tenacious. Courageous, brave, or strong-hearted.",
        "sentence":"The word أَضْغَانَكُمْ comes from the root ض غ ن and is associated with the meanings: Became niggardly, tenacious, stingy, or avaricious. A thing highly esteemed, of which one is tenacious. Courageous, brave, or strong-hearted."
    }]}