{"data":[
    {
        "indexid":4585,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4585,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4585,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4585,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4585,
        "wordid":3760,
        "word":"تَأَخَّرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word تَأَخَّرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":4585,
        "wordid":6033,
        "word":"صِرَاطًا",
        "rootid":451,
        "rootword":"ص ر ط",
        "meanings":"a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword.",
        "sentence":"The word صِرَاطًا comes from the root ص ر ط and is associated with the meanings: a path which is even, wide enough and can be trodden without difficulty. A road\/way\/path, long sword."
    },

    {
        "indexid":4585,
        "wordid":6034,
        "word":"مُسْتَقِيمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مُسْتَقِيمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4585,
        "wordid":6400,
        "word":"لِيَغْفِرَ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word لِيَغْفِرَ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":4585,
        "wordid":6623,
        "word":"نِعْمَتَهُ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word نِعْمَتَهُ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":4585,
        "wordid":17180,
        "word":"تَقَدَّمَ",
        "rootid":100,
        "rootword":"ق د م",
        "meanings":"to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost.",
        "sentence":"The word تَقَدَّمَ comes from the root ق د م and is associated with the meanings: to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost."
    },

    {
        "indexid":4585,
        "wordid":17181,
        "word":"ذَنْبِكَ",
        "rootid":1758,
        "rootword":"ذ ن ب",
        "meanings":"to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression.",
        "sentence":"The word ذَنْبِكَ comes from the root ذ ن ب and is associated with the meanings: to track, make a tale, add apendix, follow closely, become spotted.Commit offence, fault, sin, wrong, act of disobedience, transgression."
    },

    {
        "indexid":4585,
        "wordid":17182,
        "word":"وَيُتِمَّ",
        "rootid":536,
        "rootword":"ت م م",
        "meanings":"To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard.",
        "sentence":"The word وَيُتِمَّ comes from the root ت م م and is associated with the meanings: To be entire\/full\/whole, blossom, full-grown, complete, perfect, fulfilled, accomplish.Strong, firm, hard."
    },

    {
        "indexid":4585,
        "wordid":17183,
        "word":"وَيَهْدِيَكَ",
        "rootid":1694,
        "rootword":"ه د ي",
        "meanings":"to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift.",
        "sentence":"The word وَيَهْدِيَكَ comes from the root ه د ي and is associated with the meanings: to guide\/direct to the way, take\/follow right way\/course, rightly guided\/directed, a way\/course\/method\/mode\/manner of conduct. Gift."
    }]}