{"data":[
    {
        "indexid":4616,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4616,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4616,
        "wordid":2934,
        "word":"أَكْثَرُهُمْ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word أَكْثَرُهُمْ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":4616,
        "wordid":3416,
        "word":"يَعْقِلُونَ",
        "rootid":1233,
        "rootword":"ع ق ل",
        "meanings":"to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain.",
        "sentence":"The word يَعْقِلُونَ comes from the root ع ق ل and is associated with the meanings: to bind, keep back, be intelligent, become wise, understand, pay the blood price for anyone, ascend on the summit of a mountain, use understanding, abstain."
    },

    {
        "indexid":4616,
        "wordid":10253,
        "word":"وَرَاءِ",
        "rootid":1207,
        "rootword":"و ر ي",
        "meanings":"made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses).",
        "sentence":"The word وَرَاءِ comes from the root و ر ي and is associated with the meanings: made\/produce fire, allude to equivocally\/ambigiously, meant such a thing pretended another, hide\/conceal\/cover, behind a thing covering\/concealing, aider\/follower, The Book of The Law (revealed to Moses)."
    },

    {
        "indexid":4616,
        "wordid":17285,
        "word":"الْحُجُرَاتِ",
        "rootid":283,
        "rootword":"ح ج ر",
        "meanings":"To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place).",
        "sentence":"The word الْحُجُرَاتِ comes from the root ح ج ر and is associated with the meanings: To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place)."
    }]}