{"data":[
    {
        "indexid":4618,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4618,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":4618,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":4618,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4618,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4618,
        "wordid":2839,
        "word":"جَاءَكُمْ",
        "rootid":136,
        "rootword":"ج ي ا",
        "meanings":"to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive",
        "sentence":"The word جَاءَكُمْ comes from the root ج ي ا and is associated with the meanings: to come\/do, commit, (with preposition bi) to bring, produce, (2:275) to receive"
    },

    {
        "indexid":4618,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":4618,
        "wordid":5706,
        "word":"بِجَهَالَةٍ",
        "rootid":443,
        "rootword":"ج ه ل",
        "meanings":"To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan.",
        "sentence":"The word بِجَهَالَةٍ comes from the root ج ه ل and is associated with the meanings: To be ignorant, not know of a thing, to be silly or foolish, boil vehemently, pretend ignorance, feign ignorance, reckon or esteem someone, cause commotion or unsteadiness, display wrong conduct, to be void of knowledge, believe a thing to be different from what it is in reality, do a thing in a manner different from that in which it ought to be done, proceed without knowledge, to ignore a thing, to be pagan."
    },

    {
        "indexid":4618,
        "wordid":6196,
        "word":"فَتَبَيَّنُوا",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word فَتَبَيَّنُوا comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4618,
        "wordid":6878,
        "word":"نَادِمِينَ",
        "rootid":65,
        "rootword":"ن د م",
        "meanings":"to regret as repentance and penitence as a result of a sinful act.",
        "sentence":"The word نَادِمِينَ comes from the root ن د م and is associated with the meanings: to regret as repentance and penitence as a result of a sinful act."
    },

    {
        "indexid":4618,
        "wordid":10850,
        "word":"فَعَلْتُمْ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَعَلْتُمْ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":4618,
        "wordid":14616,
        "word":"بِنَبَإٍ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word بِنَبَإٍ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":4618,
        "wordid":17287,
        "word":"فَاسِقٌ",
        "rootid":697,
        "rootword":"ف س ق",
        "meanings":"to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly.",
        "sentence":"The word فَاسِقٌ comes from the root ف س ق and is associated with the meanings: to commit disobedience, go astray, transgress commandment, live in profligacy, disorder, become wicked, profligate, commit lewdness, become perverted, be impious, act wickedly."
    },

    {
        "indexid":4618,
        "wordid":17288,
        "word":"تُصِيبُوا",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word تُصِيبُوا comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":4618,
        "wordid":17289,
        "word":"فَتُصْبِحُوا",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word فَتُصْبِحُوا comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    }]}