{"data":[
    {
        "indexid":4626,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":4626,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4626,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":4626,
        "wordid":2078,
        "word":"ءَامَنَّا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَّا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4626,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":4626,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4626,
        "wordid":2109,
        "word":"وَلَكِنْ",
        "rootid":1735,
        "rootword":"ل ك ن",
        "meanings":"But (after a negation); but not (after an affirmation).",
        "sentence":"The word وَلَكِنْ comes from the root ل ك ن and is associated with the meanings: But (after a negation); but not (after an affirmation)."
    },

    {
        "indexid":4626,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":4626,
        "wordid":2471,
        "word":"شَيْئًا",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْئًا comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":4626,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4626,
        "wordid":3223,
        "word":"قُولُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُولُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4626,
        "wordid":3282,
        "word":"رَحِيمٌ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمٌ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    },

    {
        "indexid":4626,
        "wordid":3475,
        "word":"غَفُورٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word غَفُورٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":4626,
        "wordid":4723,
        "word":"قَالَتِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَتِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":4626,
        "wordid":4937,
        "word":"تُؤْمِنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word تُؤْمِنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4626,
        "wordid":5048,
        "word":"تُطِيعُوا",
        "rootid":1724,
        "rootword":"ط و ع",
        "meanings":"to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of.",
        "sentence":"The word تُطِيعُوا comes from the root ط و ع and is associated with the meanings: to obey, permit\/consent, obedience, to do voluntarily, do an act with effort. istaa'a - to be able, have power, be capable of."
    },

    {
        "indexid":4626,
        "wordid":5062,
        "word":"قُلُوبِكُمْ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبِكُمْ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":4626,
        "wordid":5680,
        "word":"وَرَسُولَهُ",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَرَسُولَهُ comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    },

    {
        "indexid":4626,
        "wordid":9524,
        "word":"الْأَعْرَابُ",
        "rootid":1594,
        "rootword":"ع ر ب",
        "meanings":"Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven.",
        "sentence":"The word الْأَعْرَابُ comes from the root ع ر ب and is associated with the meanings: Arab, Arabic, become Arabic\/Arabian, corrupted\/disordered\/bad, swollen\/abundant (said of a camel's hump or water), recrudescent, brisk\/lively\/sprightly, reply against\/to, lopping\/pruning a palm-tree, drinking much\/clear water.. Clear\/plain\/distinct speech free from error\/incorrectness.. Dwelt\/abode in the desert, amorous\/loving\/passionate, a river that flows with strong\/vehement current, obscene\/foul speech.. Friday (an ancient name of that day in the Time of Ignorance, or an Arabicized Nabathaen word according to some), the magnified\/manifest, seventh heaven."
    },

    {
        "indexid":4626,
        "wordid":16788,
        "word":"الْإِيمَانُ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْإِيمَانُ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":4626,
        "wordid":17329,
        "word":"أَسْلَمْنَا",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word أَسْلَمْنَا comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":4626,
        "wordid":17330,
        "word":"يَدْخُلِ",
        "rootid":417,
        "rootword":"د خ ل",
        "meanings":"to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest.",
        "sentence":"The word يَدْخُلِ comes from the root د خ ل and is associated with the meanings: to enter, got in, passed, to penetrate, breach, break through, invade, come upon, visit, intrude, meddle, insert, introduce, to participate\/commence\/include\/take part, it became comprehended\/comprised in it, mix\/intermingle.. Have intercourse with, go into (one's wife).. Income\/revenue\/profit.. confused\/badness\/unsound\/corrupt, vice, deceit\/guile\/circumvention.. A select group of close associates.. A place of entrance, gate, ingoing, instrument allowing entrance, key.. Guest."
    },

    {
        "indexid":4626,
        "wordid":17331,
        "word":"يَلِتْكُمْ",
        "rootid":696,
        "rootword":"ل ي ت",
        "meanings":"To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo.",
        "sentence":"The word يَلِتْكُمْ comes from the root ل ي ت and is associated with the meanings: To give a reply which was not called for, shift, shun a question, conceal, diminish, withold, prevent.Al-Lat - female idol of the pagan Arabs, the prototype of the Greek semi-goddess Leto, one of the wives of Zeus and mother of Apollo."
    },

    {
        "indexid":4626,
        "wordid":17332,
        "word":"أَعْمَالِكُمْ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word أَعْمَالِكُمْ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    }]}