{"data":[
    {
        "indexid":4712,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4712,
        "wordid":3423,
        "word":"الْعَذَابَ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word الْعَذَابَ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":4712,
        "wordid":6695,
        "word":"يَخَافُونَ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word يَخَافُونَ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":4712,
        "wordid":9949,
        "word":"الْأَلِيمَ",
        "rootid":551,
        "rootword":"ا ل م",
        "meanings":"ALM",
        "sentence":"The word الْأَلِيمَ comes from the root ا ل م and is associated with the meanings: ALM"
    },

    {
        "indexid":4712,
        "wordid":10487,
        "word":"وَتَرَكْنَا",
        "rootid":677,
        "rootword":"ت ر ك",
        "meanings":"To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone.",
        "sentence":"The word وَتَرَكْنَا comes from the root ت ر ك and is associated with the meanings: To leave off, leave alone, abandon\/desert\/relinquish\/quit, forsake, give up anything, neglect, omit, bequeath anything to anyone."
    }]}