{"data":[
    {
        "indexid":4715,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4715,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":4715,
        "wordid":8493,
        "word":"الْيَمِّ",
        "rootid":405,
        "rootword":"ي م م",
        "meanings":"sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for.",
        "sentence":"The word الْيَمِّ comes from the root ي م م and is associated with the meanings: sea, river, to aim at getting, to intend, to have recourse to, to resort to, to head for."
    },

    {
        "indexid":4715,
        "wordid":14907,
        "word":"فَأَخَذْنَاهُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word فَأَخَذْنَاهُ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":4715,
        "wordid":14908,
        "word":"وَجُنُودَهُ",
        "rootid":503,
        "rootword":"ج ن د",
        "meanings":"Collect or assemble [armies, military forces], prepare an army, Jundun [collected body of men prepared for war; auxiliaries].",
        "sentence":"The word وَجُنُودَهُ comes from the root ج ن د and is associated with the meanings: Collect or assemble [armies, military forces], prepare an army, Jundun [collected body of men prepared for war; auxiliaries]."
    },

    {
        "indexid":4715,
        "wordid":14909,
        "word":"فَنَبَذْنَاهُمْ",
        "rootid":225,
        "rootword":"ن ب ذ",
        "meanings":"(Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account.",
        "sentence":"The word فَنَبَذْنَاهُمْ comes from the root ن ب ذ and is associated with the meanings: (Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account."
    },

    {
        "indexid":4715,
        "wordid":16099,
        "word":"مُلِيمٌ",
        "rootid":1209,
        "rootword":"ل و م",
        "meanings":"(lama)To blame someone for something, accuse.",
        "sentence":"The word مُلِيمٌ comes from the root ل و م and is associated with the meanings: (lama)To blame someone for something, accuse."
    }]}