{"data":[
    {
        "indexid":4772,
        "wordid":2061,
        "word":"أَمْ",
        "rootid":1026,
        "rootword":"ا م",
        "meanings":"",
        "sentence":"The word أَمْ comes from the root ا م and is associated with the meanings: "
    },

    {
        "indexid":4772,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4772,
        "wordid":7394,
        "word":"خَزَائِنُ",
        "rootid":264,
        "rootword":"خ ز ن",
        "meanings":"Reposit\/store\/preserve\/guard something in a thing or property, conceal or withhold a thing from someone, become rich\/suffcient after poverty, take the nearest of a thing.",
        "sentence":"The word خَزَائِنُ comes from the root خ ز ن and is associated with the meanings: Reposit\/store\/preserve\/guard something in a thing or property, conceal or withhold a thing from someone, become rich\/suffcient after poverty, take the nearest of a thing."
    },

    {
        "indexid":4772,
        "wordid":8632,
        "word":"عِنْدَهُمْ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدَهُمْ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":4772,
        "wordid":17529,
        "word":"الْمُصَيْطِرُونَ",
        "rootid":221,
        "rootword":"س ط ر",
        "meanings":"To write, inscribe, draw, throw down, cut, cleanse, manage the affairs, ward, exercise authority, oversee, prostrate, set in. To embelllish stories with lies, falsehoods; stories having no foundation. To read, recite. To exercise absolute authority, to pay frequent attention to.",
        "sentence":"The word الْمُصَيْطِرُونَ comes from the root س ط ر and is associated with the meanings: To write, inscribe, draw, throw down, cut, cleanse, manage the affairs, ward, exercise authority, oversee, prostrate, set in. To embelllish stories with lies, falsehoods; stories having no foundation. To read, recite. To exercise absolute authority, to pay frequent attention to."
    }]}