{"data":[
    {
        "indexid":4793,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":4793,
        "wordid":2598,
        "word":"أَدْنَى",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word أَدْنَى comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":4793,
        "wordid":8718,
        "word":"فَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word فَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":4793,
        "wordid":17551,
        "word":"قَابَ",
        "rootid":577,
        "rootword":"ق و ب",
        "meanings":"to dig a hole like an egg, draw near, fly away. qab - space between the middle and the end of a bow, portion of a bow that is between the part which is grasped by the hand and the curved extremity, space of one extremity of the bow to the other, short measure of space\/length\/distance (often used to imply closeness of relationship).",
        "sentence":"The word قَابَ comes from the root ق و ب and is associated with the meanings: to dig a hole like an egg, draw near, fly away. qab - space between the middle and the end of a bow, portion of a bow that is between the part which is grasped by the hand and the curved extremity, space of one extremity of the bow to the other, short measure of space\/length\/distance (often used to imply closeness of relationship)."
    },

    {
        "indexid":4793,
        "wordid":17552,
        "word":"قَوْسَيْنِ",
        "rootid":1188,
        "rootword":"ق و س",
        "meanings":"to compare by measurement, precede anyone, measure a thing, imitate anyone. qausun - bow.",
        "sentence":"The word قَوْسَيْنِ comes from the root ق و س and is associated with the meanings: to compare by measurement, precede anyone, measure a thing, imitate anyone. qausun - bow."
    }]}