{"data":[
    {
        "indexid":4857,
        "wordid":2158,
        "word":"السَّمَاءِ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءِ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4857,
        "wordid":7374,
        "word":"أَبْوَابَ",
        "rootid":154,
        "rootword":"ب و ب",
        "meanings":"door\/gate, place of entrance, mode\/manner.",
        "sentence":"The word أَبْوَابَ comes from the root ب و ب and is associated with the meanings: door\/gate, place of entrance, mode\/manner."
    },

    {
        "indexid":4857,
        "wordid":10933,
        "word":"بِمَاءٍ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word بِمَاءٍ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":4857,
        "wordid":17643,
        "word":"فَفَتَحْنَا",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word فَفَتَحْنَا comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":4857,
        "wordid":17644,
        "word":"مُنْهَمِرٍ",
        "rootid":1700,
        "rootword":"ه م ر",
        "meanings":"to pour forth (rain), pour down in torrent.",
        "sentence":"The word مُنْهَمِرٍ comes from the root ه م ر and is associated with the meanings: to pour forth (rain), pour down in torrent."
    }]}