{"data":[
    {
        "indexid":4874,
        "wordid":2577,
        "word":"كُلُّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلُّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":4874,
        "wordid":3051,
        "word":"بَيْنَهُمْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَهُمْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":4874,
        "wordid":8217,
        "word":"الْمَاءَ",
        "rootid":628,
        "rootword":"م و ه",
        "meanings":"water, rain",
        "sentence":"The word الْمَاءَ comes from the root م و ه and is associated with the meanings: water, rain"
    },

    {
        "indexid":4874,
        "wordid":11373,
        "word":"وَنَبِّئْهُمْ",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word وَنَبِّئْهُمْ comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":4874,
        "wordid":17569,
        "word":"قِسْمَةٌ",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word قِسْمَةٌ comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    },

    {
        "indexid":4874,
        "wordid":17675,
        "word":"شِرْبٍ",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word شِرْبٍ comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":4874,
        "wordid":17676,
        "word":"مُحْتَضَرٌ",
        "rootid":1723,
        "rootword":"ح ض ر",
        "meanings":"To be present, present at, stand in presence of, hurt, be at hand.",
        "sentence":"The word مُحْتَضَرٌ comes from the root ح ض ر and is associated with the meanings: To be present, present at, stand in presence of, hurt, be at hand."
    }]}