{"data":[
    {
        "indexid":4894,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4894,
        "wordid":2408,
        "word":"النَّارِ",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word النَّارِ comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":4894,
        "wordid":3052,
        "word":"يَوْمَ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":4894,
        "wordid":5230,
        "word":"مَسَّ",
        "rootid":797,
        "rootword":"م س س",
        "meanings":"To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment.",
        "sentence":"The word مَسَّ comes from the root م س س and is associated with the meanings: To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment."
    },

    {
        "indexid":4894,
        "wordid":5463,
        "word":"ذُوقُوا",
        "rootid":1121,
        "rootword":"ذ و ق",
        "meanings":"to taste\/experience\/try\/perceive. One who tastes, cause to taste.",
        "sentence":"The word ذُوقُوا comes from the root ذ و ق and is associated with the meanings: to taste\/experience\/try\/perceive. One who tastes, cause to taste."
    },

    {
        "indexid":4894,
        "wordid":12106,
        "word":"وُجُوهِهِمْ",
        "rootid":826,
        "rootword":"و ج ه",
        "meanings":"to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard.",
        "sentence":"The word وُجُوهِهِمْ comes from the root و ج ه and is associated with the meanings: to face\/encounter\/confront, face, will, course\/purpose\/object one is pursuing, place\/direction one is going\/looking, way of a thing, consideration\/regard."
    },

    {
        "indexid":4894,
        "wordid":16571,
        "word":"يُسْحَبُونَ",
        "rootid":684,
        "rootword":"س ح ب",
        "meanings":"to drag, trail, drag along the ground. sahab - cloud.",
        "sentence":"The word يُسْحَبُونَ comes from the root س ح ب and is associated with the meanings: to drag, trail, drag along the ground. sahab - cloud."
    },

    {
        "indexid":4894,
        "wordid":17706,
        "word":"سَقَرَ",
        "rootid":611,
        "rootword":"س ق ر",
        "meanings":"to injure by heat, to scorch\/burn\/heat\/melt, anything that changes the nature of by melting it, fire (of the Hell).",
        "sentence":"The word سَقَرَ comes from the root س ق ر and is associated with the meanings: to injure by heat, to scorch\/burn\/heat\/melt, anything that changes the nature of by melting it, fire (of the Hell)."
    }]}