{"data":[
    {
        "indexid":4908,
        "wordid":2199,
        "word":"وَالسَّمَاءَ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word وَالسَّمَاءَ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4908,
        "wordid":17721,
        "word":"رَفَعَهَا",
        "rootid":249,
        "rootword":"ر ف ع",
        "meanings":"to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc.",
        "sentence":"The word رَفَعَهَا comes from the root ر ف ع and is associated with the meanings: to raise\/uplift\/elevate, to take up, to lift\/hoist, extol, opposite of Kha-Fa-Daad [56:3], uprear it, rear it, make it high\/lofty, take it and carry it, raise into view, to exalt, to advance, bring a thing near presenting or offering, to bring forward, to take away, disappear, trace back, honour, show regard to, to introduce, refine, to make known, go upwards, high rank\/condition\/state.Anything raised: mountain, throne etc."
    },

    {
        "indexid":4908,
        "wordid":17722,
        "word":"وَوَضَعَ",
        "rootid":1308,
        "rootword":"و ض ع",
        "meanings":"he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing.",
        "sentence":"The word وَوَضَعَ comes from the root و ض ع and is associated with the meanings: he put it or laid it in\/on a place, put it or threw it down from his hand, opposite of Ra-Fa-Ayn, put down a thing, brought forth, to appoint, to impose\/remit, give over, relinquish, lowered his grade\/rank\/condition, suffer loss, did not gain in it, lowered\/humbled, depository, the proper place of a thing."
    },

    {
        "indexid":4908,
        "wordid":17723,
        "word":"الْمِيزَانَ",
        "rootid":50,
        "rootword":"و ز ن",
        "meanings":"to weigh\/judge\/measure.",
        "sentence":"The word الْمِيزَانَ comes from the root و ز ن and is associated with the meanings: to weigh\/judge\/measure."
    }]}