{"data":[
    {
        "indexid":4912,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":4912,
        "wordid":15911,
        "word":"فَاكِهَةٌ",
        "rootid":1009,
        "rootword":"ف ك ه",
        "meanings":"became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration.",
        "sentence":"The word فَاكِهَةٌ comes from the root ف ك ه and is associated with the meanings: became cheerful\/happy, free from straitness\/burden, enjoy, to jest\/laugh\/joke, be amused\/pleased, entertain, fruit, wonderment, indulge in pleasantry, rejoice, admiration."
    },

    {
        "indexid":4912,
        "wordid":17729,
        "word":"وَالنَّخْلُ",
        "rootid":1547,
        "rootword":"ن خ ل",
        "meanings":"to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice.",
        "sentence":"The word وَالنَّخْلُ comes from the root ن خ ل and is associated with the meanings: to sift, send down, snow, drizzle, cloud, select, pick out the best of. nakhal lahuu alnasiihaten - to give earnest advice."
    },

    {
        "indexid":4912,
        "wordid":17730,
        "word":"ذَاتُ",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذَاتُ comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":4912,
        "wordid":17731,
        "word":"الْأَكْمَامِ",
        "rootid":1030,
        "rootword":"ك م م",
        "meanings":"sheaths (e.g. of a fruit tree)",
        "sentence":"The word الْأَكْمَامِ comes from the root ك م م and is associated with the meanings: sheaths (e.g. of a fruit tree)"
    }]}