{"data":[
    {
        "indexid":4947,
        "wordid":2390,
        "word":"رَبِّهِ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4947,
        "wordid":3549,
        "word":"خَافَ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خَافَ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":4947,
        "wordid":10782,
        "word":"وَلِمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَلِمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4947,
        "wordid":15645,
        "word":"جَنَّتَانِ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word جَنَّتَانِ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":4947,
        "wordid":17773,
        "word":"مَقَامَ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word مَقَامَ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    }]}