{"data":[
    {
        "indexid":496,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":496,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":496,
        "wordid":2155,
        "word":"أَوْ",
        "rootid":173,
        "rootword":"ا و",
        "meanings":"or",
        "sentence":"The word أَوْ comes from the root ا و and is associated with the meanings: or"
    },

    {
        "indexid":496,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":496,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":496,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":496,
        "wordid":2598,
        "word":"أَدْنَى",
        "rootid":635,
        "rootword":"د ن و",
        "meanings":"(Dal-Nun-Alif) To be near, come near or low, let down, be akin to.",
        "sentence":"The word أَدْنَى comes from the root د ن و and is associated with the meanings: (Dal-Nun-Alif) To be near, come near or low, let down, be akin to."
    },

    {
        "indexid":496,
        "wordid":3889,
        "word":"الْيَتَامَى",
        "rootid":1001,
        "rootword":"ي ت م",
        "meanings":"orphan",
        "sentence":"The word الْيَتَامَى comes from the root ي ت م and is associated with the meanings: orphan"
    },

    {
        "indexid":496,
        "wordid":3979,
        "word":"خِفْتُمْ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word خِفْتُمْ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    },

    {
        "indexid":496,
        "wordid":4056,
        "word":"النِّسَاءِ",
        "rootid":1292,
        "rootword":"ن س و",
        "meanings":"women. There is no singular of this word.",
        "sentence":"The word النِّسَاءِ comes from the root ن س و and is associated with the meanings: women. There is no singular of this word."
    },

    {
        "indexid":496,
        "wordid":5571,
        "word":"تُقْسِطُوا",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word تُقْسِطُوا comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    },

    {
        "indexid":496,
        "wordid":5572,
        "word":"فَانْكِحُوا",
        "rootid":379,
        "rootword":"ن ك ح",
        "meanings":"to tie, make a knot, contract, to marry, marriage.",
        "sentence":"The word فَانْكِحُوا comes from the root ن ك ح and is associated with the meanings: to tie, make a knot, contract, to marry, marriage."
    },

    {
        "indexid":496,
        "wordid":5573,
        "word":"طَابَ",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word طَابَ comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":496,
        "wordid":5574,
        "word":"مَثْنَى",
        "rootid":1651,
        "rootword":"ث ن ي",
        "meanings":"to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing.",
        "sentence":"The word مَثْنَى comes from the root ث ن ي and is associated with the meanings: to bend\/fold, double, turn one part of a thing upon the other, draw one of its two extremities to the other, join or adjoin one of the things to the other, turn anyone away or back from his course or from the object of his want, conceal emnity. mathna - by twos, in pairs, two, two and two. mathaan \/ al-mathaanii (pl. of mathnan\/mathnaatun) - oft-repeated. thanaya\/athnaa - he praised, spoke well of anyone. thinan - repetition of a thing."
    },

    {
        "indexid":496,
        "wordid":5575,
        "word":"وَثُلَاثَ",
        "rootid":193,
        "rootword":"ث ل ث",
        "meanings":"to make a third part of a thing, one third, by threes.",
        "sentence":"The word وَثُلَاثَ comes from the root ث ل ث and is associated with the meanings: to make a third part of a thing, one third, by threes."
    },

    {
        "indexid":496,
        "wordid":5576,
        "word":"وَرُبَاعَ",
        "rootid":1796,
        "rootword":"ر ب ع",
        "meanings":"four, fourth, quarter, forty",
        "sentence":"The word وَرُبَاعَ comes from the root ر ب ع and is associated with the meanings: four, fourth, quarter, forty"
    },

    {
        "indexid":496,
        "wordid":5577,
        "word":"تَعْدِلُوا",
        "rootid":124,
        "rootword":"ع د ل",
        "meanings":"to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof).",
        "sentence":"The word تَعْدِلُوا comes from the root ع د ل and is associated with the meanings: to act and deal justly, equitably, with fairness and proportion, adjust properly as to relative magnitude, establish justice, hold as equal, pay as an aquivalent, dispose aright, straighten, deviate from the right path, turn aside, stray from. adlun - justice, equity, accuracy, recompense, ransom, equivalent, compensation, instead (thereof)."
    },

    {
        "indexid":496,
        "wordid":5578,
        "word":"فَوَاحِدَةً",
        "rootid":208,
        "rootword":"و ح د",
        "meanings":"to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone.",
        "sentence":"The word فَوَاحِدَةً comes from the root و ح د and is associated with the meanings: to be one, alone, unique, unparalleled, remain lowly, be apart, assert the unity. waahidun - cardinal, number one, single. wahda - alone."
    },

    {
        "indexid":496,
        "wordid":5579,
        "word":"مَلَكَتْ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَكَتْ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":496,
        "wordid":5580,
        "word":"أَيْمَانُكُمْ",
        "rootid":114,
        "rootword":"ي م ن",
        "meanings":"right side, right, right hand, oath.",
        "sentence":"The word أَيْمَانُكُمْ comes from the root ي م ن and is associated with the meanings: right side, right, right hand, oath."
    },

    {
        "indexid":496,
        "wordid":5581,
        "word":"تَعُولُوا",
        "rootid":949,
        "rootword":"ع و ل",
        "meanings":"to swerve, turn aside, neglect other side, do injustice\/wrong, impose hardship, commit oppression or dishonesty, have a large family, provide for one's family, feed poor persons, to feed\/nourish\/sustain a family\/household. a'ilan - having a large family. a'ilatun\/a'ilatan - family, poverty, want.",
        "sentence":"The word تَعُولُوا comes from the root ع و ل and is associated with the meanings: to swerve, turn aside, neglect other side, do injustice\/wrong, impose hardship, commit oppression or dishonesty, have a large family, provide for one's family, feed poor persons, to feed\/nourish\/sustain a family\/household. a'ilan - having a large family. a'ilatun\/a'ilatan - family, poverty, want."
    }]}