{"data":[
    {
        "indexid":4979,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":4979,
        "wordid":5867,
        "word":"ذِي",
        "rootid":708,
        "rootword":"ذ و",
        "meanings":"",
        "sentence":"The word ذِي comes from the root ذ و and is associated with the meanings: "
    },

    {
        "indexid":4979,
        "wordid":7740,
        "word":"اسْمُ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word اسْمُ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":4979,
        "wordid":8200,
        "word":"تَبَارَكَ",
        "rootid":1480,
        "rootword":"ب ر ك",
        "meanings":"Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty.",
        "sentence":"The word تَبَارَكَ comes from the root ب ر ك and is associated with the meanings: Lying down, kneeling or with legs folded making the chest touch the ground, falling upon the chestTo be or to become firm, steady, steadfast, fixed, continue, remain or stay in placePraying for someone or something, or blessings, felicitations, prospering and abounding in good (e.g. on food, or the saying God bless you)Keeping or applying constantly or persevering in something (e.g. affairs, commerce etc)Extolling God and His attributes, exalting God and\/or magnifying GodStriving, laboring and\/or exerting oneselfAn ancient name of the monthsA blessing, any good bestowed by God, increase, abundance and\/or plenty."
    },

    {
        "indexid":4979,
        "wordid":17748,
        "word":"الْجَلَالِ",
        "rootid":760,
        "rootword":"ج ل ل",
        "meanings":"To be thick\/gross\/coarse\/rough, rugged\/rude\/big\/bulky, to be great (in size or estimation or rank or dignity), independent, glorious, majestic, to be old or advanced in age, also to be young or not of fit age [thus the verb bears two contradictory significations], firm or sound in judgement, to be eminent, noble or dignified, honourable, mighty, take the main part or portion of a thing, mount\/ascend upon\/cover a thing, to be exalted or magnificent, give much or many, to move about or shuffle a thing, sink or become depressed, sever\/distressing\/momentous\/formidable.",
        "sentence":"The word الْجَلَالِ comes from the root ج ل ل and is associated with the meanings: To be thick\/gross\/coarse\/rough, rugged\/rude\/big\/bulky, to be great (in size or estimation or rank or dignity), independent, glorious, majestic, to be old or advanced in age, also to be young or not of fit age [thus the verb bears two contradictory significations], firm or sound in judgement, to be eminent, noble or dignified, honourable, mighty, take the main part or portion of a thing, mount\/ascend upon\/cover a thing, to be exalted or magnificent, give much or many, to move about or shuffle a thing, sink or become depressed, sever\/distressing\/momentous\/formidable."
    },

    {
        "indexid":4979,
        "wordid":17749,
        "word":"وَالْإِكْرَامِ",
        "rootid":27,
        "rootword":"ك ر م",
        "meanings":"To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous",
        "sentence":"The word وَالْإِكْرَامِ comes from the root ك ر م and is associated with the meanings: To be productive, generous, precious, valuable, honourable, noble, All-Generous, Most Generous"
    }]}