{"data":[
    {
        "indexid":4983,
        "wordid":2591,
        "word":"الْأَرْضُ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضُ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":4983,
        "wordid":17806,
        "word":"رُجَّتِ",
        "rootid":693,
        "rootword":"ر ج ج",
        "meanings":"to shake\/move\/quake, be in commotion, confused. rajjan - rumbling, stock. rijriyatun - numerous parties in a war.",
        "sentence":"The word رُجَّتِ comes from the root ر ج ج and is associated with the meanings: to shake\/move\/quake, be in commotion, confused. rajjan - rumbling, stock. rijriyatun - numerous parties in a war."
    },

    {
        "indexid":4983,
        "wordid":17807,
        "word":"رَجًّا",
        "rootid":693,
        "rootword":"ر ج ج",
        "meanings":"to shake\/move\/quake, be in commotion, confused. rajjan - rumbling, stock. rijriyatun - numerous parties in a war.",
        "sentence":"The word رَجًّا comes from the root ر ج ج and is associated with the meanings: to shake\/move\/quake, be in commotion, confused. rajjan - rumbling, stock. rijriyatun - numerous parties in a war."
    }]}