{"data":[
    {
        "indexid":4996,
        "wordid":17818,
        "word":"يَطُوفُ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word يَطُوفُ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":4996,
        "wordid":17819,
        "word":"وِلْدَانٌ",
        "rootid":1781,
        "rootword":"و ل د",
        "meanings":"to beget, give birth.",
        "sentence":"The word وِلْدَانٌ comes from the root و ل د and is associated with the meanings: to beget, give birth."
    },

    {
        "indexid":4996,
        "wordid":17820,
        "word":"مُخَلَّدُونَ",
        "rootid":1569,
        "rootword":"خ ل د",
        "meanings":"To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour",
        "sentence":"The word مُخَلَّدُونَ comes from the root خ ل د and is associated with the meanings: To remain\/stay\/dwell\/abode, to remain or continue incessantly\/always\/endlessly\/forever\/perpetually, to adorn another with ornaments, to be slow in becoming hoary (when advanced in age), endowed with perpetual vigour"
    }]}