{"data":[
    {
        "indexid":4997,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":4997,
        "wordid":16002,
        "word":"مَعِينٍ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word مَعِينٍ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":4997,
        "wordid":17821,
        "word":"بِأَكْوَابٍ",
        "rootid":937,
        "rootword":"ك و ب",
        "meanings":"(Kaf-Alif-Ba) To drink out of a goblet.",
        "sentence":"The word بِأَكْوَابٍ comes from the root ك و ب and is associated with the meanings: (Kaf-Alif-Ba) To drink out of a goblet."
    },

    {
        "indexid":4997,
        "wordid":17822,
        "word":"وَأَبَارِيقَ",
        "rootid":918,
        "rootword":"ب ر ق",
        "meanings":"Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness",
        "sentence":"The word وَأَبَارِيقَ comes from the root ب ر ق and is associated with the meanings: Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness"
    },

    {
        "indexid":4997,
        "wordid":17823,
        "word":"وَكَأْسٍ",
        "rootid":644,
        "rootword":"ك ا س",
        "meanings":"drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha).",
        "sentence":"The word وَكَأْسٍ comes from the root ك ا س and is associated with the meanings: drinking-cup when there is in it something to drink. Sometimes it can refer to the drink itself, e.g. wine. If there is no beverage in it, the drinking cup is called  Qadehun (root: Qaf-Dal-Ha)."
    }]}