{"data":[
    {
        "indexid":5,
        "wordid":2011,
        "word":"إِيَّاكَ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word إِيَّاكَ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },,

    {
        "indexid":5,
        "wordid":2012,
        "word":"نَعْبُدُ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word نَعْبُدُ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },,

    {
        "indexid":5,
        "wordid":2013,
        "word":"وَإِيَّاكَ",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word وَإِيَّاكَ comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },,

    {
        "indexid":5,
        "wordid":2014,
        "word":"نَسْتَعِينُ",
        "rootid":211,
        "rootword":"ع و ن",
        "meanings":"to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68).",
        "sentence":"The word نَسْتَعِينُ comes from the root ع و ن and is associated with the meanings: to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68)."
}]}