{"data":[
    {
        "indexid":5001,
        "wordid":16009,
        "word":"عِينٌ",
        "rootid":1397,
        "rootword":"ع ي ن",
        "meanings":"to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring.",
        "sentence":"The word عِينٌ comes from the root ع ي ن and is associated with the meanings: to hurt in the eye, smite anyone with the evil eye, flow tears, become a spy. Aayan - to view, face. 'Ainun - eye, look, hole, but of a tree, spy, middle letter of a trilateral word, spring of water, chief, personage of a place. A'yan (pl. 'Inun): lovely, wide-eyed, lovely black eyed. Ma'iinun - water, spring."
    },

    {
        "indexid":5001,
        "wordid":17830,
        "word":"وَحُورٌ",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word وَحُورٌ comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    }]}