{"data":[
    {
        "indexid":5015,
        "wordid":17847,
        "word":"فَجَعَلْنَاهُنَّ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word فَجَعَلْنَاهُنَّ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5015,
        "wordid":17848,
        "word":"أَبْكَارًا",
        "rootid":99,
        "rootword":"ب ك ر",
        "meanings":"Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception",
        "sentence":"The word أَبْكَارًا comes from the root ب ك ر and is associated with the meanings: Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception"
    }]}