{"data":[
    {
        "indexid":5024,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5024,
        "wordid":6477,
        "word":"قَبْلَ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلَ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":5024,
        "wordid":17857,
        "word":"مُتْرَفِينَ",
        "rootid":1773,
        "rootword":"ت ر ف",
        "meanings":"soft, ease, to lead a delicate life, enjoy good things of life, to bestow the good things of life.Luxuriant\/flourishing\/succulent\/plentifulness.Corrupted, well to do, ungrateful, proud, one whom a life of softness and ease has caused to behave insolently, one whom the exclusive pursuit of pleasures of life has corrupted.",
        "sentence":"The word مُتْرَفِينَ comes from the root ت ر ف and is associated with the meanings: soft, ease, to lead a delicate life, enjoy good things of life, to bestow the good things of life.Luxuriant\/flourishing\/succulent\/plentifulness.Corrupted, well to do, ungrateful, proud, one whom a life of softness and ease has caused to behave insolently, one whom the exclusive pursuit of pleasures of life has corrupted."
    }]}