{"data":[
    {
        "indexid":5055,
        "wordid":2073,
        "word":"عَظِيمٌ",
        "rootid":462,
        "rootword":"ع ظ م",
        "meanings":"great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great",
        "sentence":"The word عَظِيمٌ comes from the root ع ظ م and is associated with the meanings: great, important, big, regard, honour, mighty, glorious, a man of moment, All-mighty, All-glorious, grievous, bounty\/abounding, magnify\/increase. azzama - to make great"
    },

    {
        "indexid":5055,
        "wordid":2212,
        "word":"تَعْلَمُونَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word تَعْلَمُونَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":5055,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":5055,
        "wordid":17895,
        "word":"لَقَسَمٌ",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word لَقَسَمٌ comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    }]}