{"data":[
    {
        "indexid":509,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":509,
        "wordid":2227,
        "word":"فَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word فَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":509,
        "wordid":2645,
        "word":"مِنْكُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْكُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":509,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":509,
        "wordid":5695,
        "word":"وَاللَّذَانِ",
        "rootid":1718,
        "rootword":"ا ل ل",
        "meanings":"Pact, covenant; blood relationship, consanguinity; Anything which has a quality requiring it to be regarded as sacred, or inviolable; which has some right pertaining to it, nearness with respect to kindred, good origin, promise or an assurance of safety or security, neighbour, bond.",
        "sentence":"The word وَاللَّذَانِ comes from the root ا ل ل and is associated with the meanings: Pact, covenant; blood relationship, consanguinity; Anything which has a quality requiring it to be regarded as sacred, or inviolable; which has some right pertaining to it, nearness with respect to kindred, good origin, promise or an assurance of safety or security, neighbour, bond."
    },

    {
        "indexid":509,
        "wordid":5696,
        "word":"يَأْتِيَانِهَا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word يَأْتِيَانِهَا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":509,
        "wordid":5697,
        "word":"فَءَاذُوهُمَا",
        "rootid":1797,
        "rootword":"ا ذ ي",
        "meanings":"he was or became annoyed\/molested\/hurt, experience\/suffer what is disagreeable, state of annoyance.",
        "sentence":"The word فَءَاذُوهُمَا comes from the root ا ذ ي and is associated with the meanings: he was or became annoyed\/molested\/hurt, experience\/suffer what is disagreeable, state of annoyance."
    },

    {
        "indexid":509,
        "wordid":5698,
        "word":"تَابَا",
        "rootid":1156,
        "rootword":"ت و ب",
        "meanings":"To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt.",
        "sentence":"The word تَابَا comes from the root ت و ب and is associated with the meanings: To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt."
    },

    {
        "indexid":509,
        "wordid":5699,
        "word":"وَأَصْلَحَا",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word وَأَصْلَحَا comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":509,
        "wordid":5700,
        "word":"فَأَعْرِضُوا",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word فَأَعْرِضُوا comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":509,
        "wordid":5701,
        "word":"عَنْهُمَا",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُمَا comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":509,
        "wordid":5702,
        "word":"تَوَّابًا",
        "rootid":1156,
        "rootword":"ت و ب",
        "meanings":"To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt.",
        "sentence":"The word تَوَّابًا comes from the root ت و ب and is associated with the meanings: To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt."
    },

    {
        "indexid":509,
        "wordid":5703,
        "word":"رَحِيمًا",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِيمًا comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    }]}