{"data":[
    {
        "indexid":5158,
        "wordid":2010,
        "word":"الدِّينِ",
        "rootid":442,
        "rootword":"د ي ن",
        "meanings":"obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation.",
        "sentence":"The word الدِّينِ comes from the root د ي ن and is associated with the meanings: obedience\/submissiveness, servility, religion, high\/elevated\/noble\/glorious rank\/condition\/state, took\/receive a loan or borrowed upon credit, become indebted, in debt, under the obligation of a debt, contract a debt, repay\/reimburse a loan, rule\/govern\/manage it, possess\/own it, become habituated\/accustomed to something, confirmation, death (because it is a debt everyone must pay), a particular law\/statute, system, custom\/habit\/business, a way\/course\/manner of conduct\/acting, repayment\/compensation."
    },

    {
        "indexid":5158,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5158,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5158,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":5158,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5158,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5158,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5158,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5158,
        "wordid":2793,
        "word":"دِيَارِكُمْ",
        "rootid":1054,
        "rootword":"د و ر",
        "meanings":"To go round, revolve, circulate.",
        "sentence":"The word دِيَارِكُمْ comes from the root د و ر and is associated with the meanings: To go round, revolve, circulate."
    },

    {
        "indexid":5158,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":5158,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":5158,
        "wordid":3663,
        "word":"يُقَاتِلُوكُمْ",
        "rootid":910,
        "rootword":"ق ت ل",
        "meanings":"to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it.",
        "sentence":"The word يُقَاتِلُوكُمْ comes from the root ق ت ل and is associated with the meanings: to kill, put to death, be accused, slay\/murder\/kill\/slaughter, attempt to kill, render person like to one killed, to wage war\/combat\/battle, to master, contend\/fight, deadly, knew a thing thoroughly\/well, become acquainted with it."
    },

    {
        "indexid":5158,
        "wordid":4141,
        "word":"وَلَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word وَلَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":5158,
        "wordid":4962,
        "word":"إِلَيْهِمْ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِمْ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5158,
        "wordid":6813,
        "word":"الْمُقْسِطِينَ",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word الْمُقْسِطِينَ comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    },

    {
        "indexid":5158,
        "wordid":18135,
        "word":"يَنْهَاكُمُ",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word يَنْهَاكُمُ comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":5158,
        "wordid":18136,
        "word":"يُخْرِجُوكُمْ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word يُخْرِجُوكُمْ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":5158,
        "wordid":18137,
        "word":"تَبَرُّوهُمْ",
        "rootid":1587,
        "rootword":"ب ر ر",
        "meanings":"Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale",
        "sentence":"The word تَبَرُّوهُمْ comes from the root ب ر ر and is associated with the meanings: Being pious, kind, good, gentle, affectionate, beneficent, just, righteous, virtuous, honest, true, veracious, sweet of speech, mercifulSinlessly performing somethingRecompensing, rewarding for obedience, accepting and\/or approvingDriving or calling sheep\/goatsVerifying or proving an oath trueOne who overcomes, overcoming someone with good actions or speechOvercoming an adversary or overcoming by evilTalking too much, confused clamor, noise, crying out, talking in anger or confusion, talking unprofitablyAmpleness, largeness or extensivenessLand or elevated ground open to view, out of doors or exposed to viewWheat, grain\/s of wheat or coarsely ground flourObedienceCertain kind of fruitGood, sweet or pleasant word expression or sayingOf, belonging to or relating to the land and or the desert\/wasteExternal, outward, apparent or publicA proper name of a certain people from El Maghrib (north of Africa and west of Egypt)A truly and honestly executed sale"
    },

    {
        "indexid":5158,
        "wordid":18138,
        "word":"وَتُقْسِطُوا",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word وَتُقْسِطُوا comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    }]}