{"data":[
    {
        "indexid":5163,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5163,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5163,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5163,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5163,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5163,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":5163,
        "wordid":2575,
        "word":"قَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word قَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":5163,
        "wordid":2974,
        "word":"الْءَاخِرَةِ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word الْءَاخِرَةِ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    },

    {
        "indexid":5163,
        "wordid":3099,
        "word":"أَصْحَابِ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word أَصْحَابِ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":5163,
        "wordid":5003,
        "word":"قَوْمًا",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word قَوْمًا comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":5163,
        "wordid":6588,
        "word":"يَئِسَ",
        "rootid":879,
        "rootword":"ي ا س",
        "meanings":"to despair, desperate, to give up hope, to know.",
        "sentence":"The word يَئِسَ comes from the root ي ا س and is associated with the meanings: to despair, desperate, to give up hope, to know."
    },

    {
        "indexid":5163,
        "wordid":10186,
        "word":"تَتَوَلَّوْا",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word تَتَوَلَّوْا comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":5163,
        "wordid":11098,
        "word":"الْكُفَّارُ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكُفَّارُ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":5163,
        "wordid":13500,
        "word":"الْقُبُورِ",
        "rootid":1260,
        "rootword":"ق ب ر",
        "meanings":"to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying.",
        "sentence":"The word الْقُبُورِ comes from the root ق ب ر and is associated with the meanings: to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying."
    },

    {
        "indexid":5163,
        "wordid":15046,
        "word":"يَئِسُوا",
        "rootid":879,
        "rootword":"ي ا س",
        "meanings":"to despair, desperate, to give up hope, to know.",
        "sentence":"The word يَئِسُوا comes from the root ي ا س and is associated with the meanings: to despair, desperate, to give up hope, to know."
    },

    {
        "indexid":5163,
        "wordid":18028,
        "word":"غَضِبَ",
        "rootid":523,
        "rootword":"غ ض ب",
        "meanings":"anger\/wrath\/stern, intense\/deep redness",
        "sentence":"The word غَضِبَ comes from the root غ ض ب and is associated with the meanings: anger\/wrath\/stern, intense\/deep redness"
    }]}