{"data":[
    {
        "indexid":5177,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5177,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5177,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5177,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5177,
        "wordid":2104,
        "word":"نَحْنُ",
        "rootid":446,
        "rootword":"ن ح ن",
        "meanings":"We",
        "sentence":"The word نَحْنُ comes from the root ن ح ن and is associated with the meanings: We"
    },

    {
        "indexid":5177,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5177,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":5177,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":5177,
        "wordid":2410,
        "word":"إِسْرَاءِيلَ",
        "rootid":513,
        "rootword":"ا س ر",
        "meanings":"to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy.",
        "sentence":"The word إِسْرَاءِيلَ comes from the root ا س ر and is associated with the meanings: to make captive, prisoner, joint\/ligament\/frame\/vigour\/energy."
    },

    {
        "indexid":5177,
        "wordid":2647,
        "word":"كُونُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُونُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5177,
        "wordid":2779,
        "word":"بَنِي",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word بَنِي comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":5177,
        "wordid":2833,
        "word":"مَرْيَمَ",
        "rootid":1302,
        "rootword":"م ر ي م",
        "meanings":"Mariam, Mary",
        "sentence":"The word مَرْيَمَ comes from the root م ر ي م and is associated with the meanings: Mariam, Mary"
    },

    {
        "indexid":5177,
        "wordid":4802,
        "word":"ابْنُ",
        "rootid":1387,
        "rootword":"ب ن و",
        "meanings":"",
        "sentence":"The word ابْنُ comes from the root ب ن و and is associated with the meanings: "
    },

    {
        "indexid":5177,
        "wordid":4845,
        "word":"أَنْصَارِي",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word أَنْصَارِي comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":5177,
        "wordid":4846,
        "word":"الْحَوَارِيُّونَ",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word الْحَوَارِيُّونَ comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    },

    {
        "indexid":5177,
        "wordid":4847,
        "word":"أَنْصَارُ",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word أَنْصَارُ comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":5177,
        "wordid":4928,
        "word":"طَائِفَةٌ",
        "rootid":254,
        "rootword":"ط و ف",
        "meanings":"act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about.",
        "sentence":"The word طَائِفَةٌ comes from the root ط و ف and is associated with the meanings: act of going\/walking, going\/walking around or otherwise, to go or wander about, circuited\/compassed, journeyed, came to him, come upon, visitation, visit, approach, drew near, to go round or round about often, encompass,\"the men\/people\/locusts filled the land like the TWF\/flood\/deluge\", overpowering\/overwhelming rain\/water that covers,a servant that serves one with gentleness and carefulness,a detached\/distinct part\/portion, a piece or bit, a party\/division\/sect,a sort of raisins of which the bunches are composed of closely-compacted berries, a garment in which one goes round or circuits, a place of going round or round about."
    },

    {
        "indexid":5177,
        "wordid":6885,
        "word":"فَأَصْبَحُوا",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word فَأَصْبَحُوا comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    },

    {
        "indexid":5177,
        "wordid":16505,
        "word":"ظَاهِرِينَ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظَاهِرِينَ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":5177,
        "wordid":18186,
        "word":"أَنْصَارَ",
        "rootid":1240,
        "rootword":"ن ص ر",
        "meanings":"to assist\/aid, succour, protect.",
        "sentence":"The word أَنْصَارَ comes from the root ن ص ر and is associated with the meanings: to assist\/aid, succour, protect."
    },

    {
        "indexid":5177,
        "wordid":18187,
        "word":"لِلْحَوَارِيِّينَ",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word لِلْحَوَارِيِّينَ comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    },

    {
        "indexid":5177,
        "wordid":18188,
        "word":"فَءَامَنَتْ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word فَءَامَنَتْ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5177,
        "wordid":18189,
        "word":"وَكَفَرَتْ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word وَكَفَرَتْ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":5177,
        "wordid":18190,
        "word":"فَأَيَّدْنَا",
        "rootid":312,
        "rootword":"ا ي د",
        "meanings":"to support\/strengthen\/confirm.",
        "sentence":"The word فَأَيَّدْنَا comes from the root ا ي د and is associated with the meanings: to support\/strengthen\/confirm."
    },

    {
        "indexid":5177,
        "wordid":18191,
        "word":"عَدُوِّهِمْ",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word عَدُوِّهِمْ comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    }]}