{"data":[
    {
        "indexid":5233,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5233,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5233,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5233,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5233,
        "wordid":2225,
        "word":"إِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word إِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":5233,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":5233,
        "wordid":3010,
        "word":"فَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":5233,
        "wordid":3110,
        "word":"بَعْدَ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدَ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":5233,
        "wordid":3799,
        "word":"وَالْمَلَائِكَةُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word وَالْمَلَائِكَةُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":5233,
        "wordid":3930,
        "word":"الْمُؤْمِنِينَ",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word الْمُؤْمِنِينَ comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5233,
        "wordid":11634,
        "word":"مَوْلَاهُ",
        "rootid":806,
        "rootword":"و ل ي",
        "meanings":"to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away.",
        "sentence":"The word مَوْلَاهُ comes from the root و ل ي and is associated with the meanings: to be close, near, follow, be up to.tawalla (prf. 3rd. m. sing.) - turneth away.tawallau (prf. 3rd. m. pl.) - they turned away.tawallaitum (prf. 2nd. m. pl.) - ye turned away.yatawalla (impf. 3rd. m. pl.) - he turns away."
    },

    {
        "indexid":5233,
        "wordid":14920,
        "word":"تَظَاهَرَا",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word تَظَاهَرَا comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    },

    {
        "indexid":5233,
        "wordid":18324,
        "word":"تَتُوبَا",
        "rootid":1156,
        "rootword":"ت و ب",
        "meanings":"To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt.",
        "sentence":"The word تَتُوبَا comes from the root ت و ب and is associated with the meanings: To return; repent; turn one's self in a repentant manner (with ila or without it), turn with mercy (with ala), adapt."
    },

    {
        "indexid":5233,
        "wordid":18326,
        "word":"قُلُوبُكُمَا",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبُكُمَا comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":5233,
        "wordid":18327,
        "word":"وَجِبْرِيلُ",
        "rootid":842,
        "rootword":"ج ب ر",
        "meanings":"To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence.",
        "sentence":"The word وَجِبْرِيلُ comes from the root ج ب ر and is associated with the meanings: To reduce from a fractured state, or restore from a state of poverty to sufficiency. Set or reduced from a fractured state. \"A poor man being likened to one who has a broken bone and his restoration to wealth being likened to the setting of the bone.\" Compell, constrain, incite, urge, or induce another [against his will]. Addition of something for the purpose of reparation [in computation]. Self-magnification, pride, haughtiness, insolence, bold, audacious, inordinate, tyrannical, overbearing, extravagent. A king. \"There has been no prophetic office but a kingly office has succeeded in its place through someone's self-magnification, pride, haughtiness, or insolence.\" Slave, servant. No retaliation or expiatory mulct exacted [for a thing\/person]. Tall, above the reach of the hand, ascend [the palm tree that grows tall for the cutting of its fruit], and retaining excellence."
    },

    {
        "indexid":5233,
        "wordid":18328,
        "word":"وَصَالِحُ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word وَصَالِحُ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":5233,
        "wordid":18329,
        "word":"ظَهِيرٌ",
        "rootid":1582,
        "rootword":"ظ ه ر",
        "meanings":"to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back.",
        "sentence":"The word ظَهِيرٌ comes from the root ظ ه ر and is associated with the meanings: to appear, become distinct\/clear\/open\/manifest, come out, ascend\/mount, get the better of, know, distinguish, be obvious, go forth, enter the noon, neglect, have the upper hand over wound on the back. zahara - to help, back, support in the sense of collaboration. zihar - was a practice of the pre-Islamic days of the Arabs by which the wife was kept in suspense, sometimes for the whole of her life having neither the position of a wife nor that of a divorced woman free to marry elsewhere. The word zihar is derived from zahr meaning back."
    }]}