{"data":[
    {
        "indexid":5235,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5235,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5235,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":5235,
        "wordid":2113,
        "word":"النَّاسُ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسُ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":5235,
        "wordid":2140,
        "word":"نَارًا",
        "rootid":894,
        "rootword":"ن و ر",
        "meanings":"fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war.",
        "sentence":"The word نَارًا comes from the root ن و ر and is associated with the meanings: fire, flame, heat, war, light, shine, sparkle, irritate, vex or provoke war."
    },

    {
        "indexid":5235,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5235,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":5235,
        "wordid":2233,
        "word":"وَقُودُهَا",
        "rootid":421,
        "rootword":"و ق د",
        "meanings":"to set fire, kindle, light fire.",
        "sentence":"The word وَقُودُهَا comes from the root و ق د and is associated with the meanings: to set fire, kindle, light fire."
    },

    {
        "indexid":5235,
        "wordid":2234,
        "word":"وَالْحِجَارَةُ",
        "rootid":283,
        "rootword":"ح ج ر",
        "meanings":"To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place).",
        "sentence":"The word وَالْحِجَارَةُ comes from the root ح ج ر and is associated with the meanings: To deprive from, harden, hide, resist, forbid, prevent, hinder, prohibit access (to a place)."
    },

    {
        "indexid":5235,
        "wordid":2447,
        "word":"أَنْفُسَكُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسَكُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":5235,
        "wordid":10674,
        "word":"شِدَادٌ",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word شِدَادٌ comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    },

    {
        "indexid":5235,
        "wordid":10762,
        "word":"أَمَرَهُمْ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word أَمَرَهُمْ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":5235,
        "wordid":11554,
        "word":"وَيَفْعَلُونَ",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word وَيَفْعَلُونَ comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":5235,
        "wordid":11555,
        "word":"يُؤْمَرُونَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word يُؤْمَرُونَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    },

    {
        "indexid":5235,
        "wordid":12101,
        "word":"مَلَائِكَةٌ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word مَلَائِكَةٌ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":5235,
        "wordid":18339,
        "word":"قُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word قُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":5235,
        "wordid":18340,
        "word":"وَأَهْلِيكُمْ",
        "rootid":1011,
        "rootword":"ا ه ل",
        "meanings":"possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling.",
        "sentence":"The word وَأَهْلِيكُمْ comes from the root ا ه ل and is associated with the meanings: possessor\/people of, one who recites, superintended\/owner, inhabitants\/family\/people of house or dwelling."
    },

    {
        "indexid":5235,
        "wordid":18341,
        "word":"غِلَاظٌ",
        "rootid":1579,
        "rootword":"غ ل ظ",
        "meanings":"thick, gross, bulky, coarse, rough, hardness, strength, vehemence",
        "sentence":"The word غِلَاظٌ comes from the root غ ل ظ and is associated with the meanings: thick, gross, bulky, coarse, rough, hardness, strength, vehemence"
    },

    {
        "indexid":5235,
        "wordid":18342,
        "word":"يَعْصُونَ",
        "rootid":468,
        "rootword":"ع ص ي",
        "meanings":"to rebel, disobey, oppose, resist, transgress.",
        "sentence":"The word يَعْصُونَ comes from the root ع ص ي and is associated with the meanings: to rebel, disobey, oppose, resist, transgress."
    }]}