{"data":[
    {
        "indexid":5253,
        "wordid":2035,
        "word":"بِالْغَيْبِ",
        "rootid":623,
        "rootword":"غ ي ب",
        "meanings":"absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible.",
        "sentence":"The word بِالْغَيْبِ comes from the root غ ي ب and is associated with the meanings: absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible."
    },

    {
        "indexid":5253,
        "wordid":3855,
        "word":"كَبِيرٌ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word كَبِيرٌ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":5253,
        "wordid":5212,
        "word":"مَغْفِرَةٌ",
        "rootid":666,
        "rootword":"غ ف ر",
        "meanings":"protect, cover over, shield, forgive, pardon.",
        "sentence":"The word مَغْفِرَةٌ comes from the root غ ف ر and is associated with the meanings: protect, cover over, shield, forgive, pardon."
    },

    {
        "indexid":5253,
        "wordid":5552,
        "word":"رَبَّهُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّهُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5253,
        "wordid":6078,
        "word":"يَخْشَوْنَ",
        "rootid":649,
        "rootword":"خ ش ي",
        "meanings":"To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary.",
        "sentence":"The word يَخْشَوْنَ comes from the root خ ش ي and is associated with the meanings: To fear or dread, to fear with reverence\/veneration\/honour\/awe, to hope, to know a thing, frighten or make to fear\/dread, be cautious or wary."
    },

    {
        "indexid":5253,
        "wordid":6627,
        "word":"وَأَجْرٌ",
        "rootid":1169,
        "rootword":"ا ج ر",
        "meanings":"recompense\/compensation\/reward, hire\/pay\/wage for service, profit",
        "sentence":"The word وَأَجْرٌ comes from the root ا ج ر and is associated with the meanings: recompense\/compensation\/reward, hire\/pay\/wage for service, profit"
    }]}