{"data":[
    {
        "indexid":5255,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5255,
        "wordid":2106,
        "word":"أَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5255,
        "wordid":2297,
        "word":"خَلَقَ",
        "rootid":939,
        "rootword":"خ ل ق",
        "meanings":"To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality.",
        "sentence":"The word خَلَقَ comes from the root خ ل ق and is associated with the meanings: To measure or proportion a thing, to form or make according to proper measure, bring into existence according to a certain measure, originate or produce after a pattern or model which one has devised, bring into existence from a state of non-existence (create out of nothing), to fabricate or forge a speech or saying, to make a thing equitable or even, make a thing smooth, to be probable or likely to happen (or likely to be or happen, or to have happened or been), act towards someone according to that person's nature, wear out a thing and make it old, to be fit\/ competent\/ suitable\/ proper, to be complete or perfect in respect of make or proportion, have an innate\/natural disposition\/temperament\/quality."
    },

    {
        "indexid":5255,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":5255,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":5255,
        "wordid":7263,
        "word":"الْخَبِيرُ",
        "rootid":109,
        "rootword":"خ ب ر",
        "meanings":"To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account.",
        "sentence":"The word الْخَبِيرُ comes from the root خ ب ر and is associated with the meanings: To know\/possess, have knowledge of a thing, to know a thing with respect to it's internal or real state, informed\/acquainted.. Knowledge of the secret internal state or as some say of secret internal circumstances or properties.. Also to try, prove or test things, having experience.. News\/tidings\/information\/notification\/narration\/story\/account."
    },

    {
        "indexid":5255,
        "wordid":7678,
        "word":"اللَّطِيفُ",
        "rootid":1415,
        "rootword":"ل ط ف",
        "meanings":"To be delicate, subtle, slender, graceful, courtesy, elegant, gentle, kind, fine, nice, sooth\/caress, gift\/present. latif n.m. - 6:103, 12:100, 22:63, 31:16, 33:34, 42:19, 67:14 talattafa vb. (V) impf. act. 18:19",
        "sentence":"The word اللَّطِيفُ comes from the root ل ط ف and is associated with the meanings: To be delicate, subtle, slender, graceful, courtesy, elegant, gentle, kind, fine, nice, sooth\/caress, gift\/present. latif n.m. - 6:103, 12:100, 22:63, 31:16, 33:34, 42:19, 67:14 talattafa vb. (V) impf. act. 18:19"
    }]}