{"data":[
    {
        "indexid":5280,
        "wordid":2903,
        "word":"لَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word لَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":5280,
        "wordid":5124,
        "word":"وَدُّوا",
        "rootid":1151,
        "rootword":"و د د",
        "meanings":"to love, wish for, desire, be fond of, will, long.",
        "sentence":"The word وَدُّوا comes from the root و د د and is associated with the meanings: to love, wish for, desire, be fond of, will, long."
    },

    {
        "indexid":5280,
        "wordid":18420,
        "word":"تُدْهِنُ",
        "rootid":137,
        "rootword":"د ه ن",
        "meanings":"To anoint, strike (with a stick), moisten, blandish, pleasantly smooth, agreeable and suave, dissemble with, coax, be pliant, grease, dis-simulate.",
        "sentence":"The word تُدْهِنُ comes from the root د ه ن and is associated with the meanings: To anoint, strike (with a stick), moisten, blandish, pleasantly smooth, agreeable and suave, dissemble with, coax, be pliant, grease, dis-simulate."
    },

    {
        "indexid":5280,
        "wordid":18421,
        "word":"فَيُدْهِنُونَ",
        "rootid":137,
        "rootword":"د ه ن",
        "meanings":"To anoint, strike (with a stick), moisten, blandish, pleasantly smooth, agreeable and suave, dissemble with, coax, be pliant, grease, dis-simulate.",
        "sentence":"The word فَيُدْهِنُونَ comes from the root د ه ن and is associated with the meanings: To anoint, strike (with a stick), moisten, blandish, pleasantly smooth, agreeable and suave, dissemble with, coax, be pliant, grease, dis-simulate."
    }]}