{"data":[
    {
        "indexid":5288,
        "wordid":2777,
        "word":"الْجَنَّةِ",
        "rootid":1047,
        "rootword":"ج ن ن",
        "meanings":"veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk",
        "sentence":"The word الْجَنَّةِ comes from the root ج ن ن and is associated with the meanings: veiled\/concealed\/covered\/hid\/protected (e.g. cloth, armour, grave, shield), invisible, become dark\/posessed, darkness of night, bereft of reason, mad\/insane\/unsound in mind\/intellect, confusedness.Become thick\/full-grown\/blossom, herbage, garden.Spiritual beings that conceal themselves from the senses (including angels), become weak and abject, greater part of mankind, devil\/demon, people who are peerless having no match or equal, a being who is highly potent, sometimes refers to Kings because they are concealed from the common folk"
    },

    {
        "indexid":5288,
        "wordid":5939,
        "word":"أَصْحَابَ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word أَصْحَابَ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    },

    {
        "indexid":5288,
        "wordid":6881,
        "word":"أَقْسَمُوا",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word أَقْسَمُوا comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    },

    {
        "indexid":5288,
        "wordid":11397,
        "word":"مُصْبِحِينَ",
        "rootid":1770,
        "rootword":"ص ب ح",
        "meanings":"to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning.",
        "sentence":"The word مُصْبِحِينَ comes from the root ص ب ح and is associated with the meanings: to visit or greet in the morning. subhun\/sabahun\/isbaahun - the morning. misbaahun (pl. masaabih) - lamp. sabbah (vb. 2) - to come to, come upon, greet, drink in the morning. asbaha - to enter upon the time of the morning, appear, begin to do, to be, become, happen. musbih - one who does anything in or enters upon the morning."
    },

    {
        "indexid":5288,
        "wordid":18430,
        "word":"بَلَوْنَاهُمْ",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word بَلَوْنَاهُمْ comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    },

    {
        "indexid":5288,
        "wordid":18431,
        "word":"بَلَوْنَا",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word بَلَوْنَا comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    },

    {
        "indexid":5288,
        "wordid":18432,
        "word":"لَيَصْرِمُنَّهَا",
        "rootid":870,
        "rootword":"ص ر م",
        "meanings":"to cut off, reap, pluck, be broken, gather (fruit), trim. saarim - one who cuts or gathers (fruit). sariim - garden whose fruit has all been cut, dark night as though it were burnt up and black.",
        "sentence":"The word لَيَصْرِمُنَّهَا comes from the root ص ر م and is associated with the meanings: to cut off, reap, pluck, be broken, gather (fruit), trim. saarim - one who cuts or gathers (fruit). sariim - garden whose fruit has all been cut, dark night as though it were burnt up and black."
    }]}