{"data":[
    {
        "indexid":5321,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5321,
        "wordid":3121,
        "word":"رَبُّهُ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّهُ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5321,
        "wordid":3189,
        "word":"الصَّالِحِينَ",
        "rootid":5,
        "rootword":"ص ل ح",
        "meanings":"to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud.",
        "sentence":"The word الصَّالِحِينَ comes from the root ص ل ح and is associated with the meanings: to be right\/good\/honest\/upright\/sound\/righteous, suit, fit. aslaha - to set a thing aright, reform, do good. saalihaat - good works, fit and suiting deeds. aslaha (vb. 4) - to make whole sound, set things right, effect an agreement between, render fit. islaah - uprightness, reconciliation, amendment, reformation. muslihun - reformer, one who is upright, righteous, a person of integrity, peacemaker, suitable.saalih - name of a prophet sent to the tribe of Thamuud."
    },

    {
        "indexid":5321,
        "wordid":14284,
        "word":"فَجَعَلَهُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word فَجَعَلَهُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5321,
        "wordid":18469,
        "word":"فَاجْتَبَاهُ",
        "rootid":532,
        "rootword":"ج ب ي",
        "meanings":"He collected (e.g. water\/tax). A mode\/manner of collecting. He chose it\/selected it for himself. He returned\/receded\/retreated\/went back. Collecting in a way of choice\/selection (i.e. God blessing Solomon more than others etc.) He forged\/produced\/invented it. Water collected. A watering trough in which water is collected. The place where a well is dug. What is around a well\/watering trough. Dug wells in which shoots of grape-vines are set. A collector of water for camels. Locust (it collects everything by eating it), A company of men.",
        "sentence":"The word فَاجْتَبَاهُ comes from the root ج ب ي and is associated with the meanings: He collected (e.g. water\/tax). A mode\/manner of collecting. He chose it\/selected it for himself. He returned\/receded\/retreated\/went back. Collecting in a way of choice\/selection (i.e. God blessing Solomon more than others etc.) He forged\/produced\/invented it. Water collected. A watering trough in which water is collected. The place where a well is dug. What is around a well\/watering trough. Dug wells in which shoots of grape-vines are set. A collector of water for camels. Locust (it collects everything by eating it), A company of men."
    }]}