{"data":[
    {
        "indexid":5339,
        "wordid":2709,
        "word":"فَهِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word فَهِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":5339,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":5339,
        "wordid":14218,
        "word":"السَّمَاءُ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءُ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":5339,
        "wordid":18499,
        "word":"وَانْشَقَّتِ",
        "rootid":1455,
        "rootword":"ش ق ق",
        "meanings":"pass along the way, cross, open a way\/passage\/vent\/channel, cut\/split\/divided\/clave\/ripped\/tore.",
        "sentence":"The word وَانْشَقَّتِ comes from the root ش ق ق and is associated with the meanings: pass along the way, cross, open a way\/passage\/vent\/channel, cut\/split\/divided\/clave\/ripped\/tore."
    },

    {
        "indexid":5339,
        "wordid":18500,
        "word":"وَاهِيَةٌ",
        "rootid":1669,
        "rootword":"و ه ي",
        "meanings":"to be weak\/frail, torn\/burst.",
        "sentence":"The word وَاهِيَةٌ comes from the root و ه ي and is associated with the meanings: to be weak\/frail, torn\/burst."
    }]}