{"data":[
    {
        "indexid":5387,
        "wordid":9934,
        "word":"وَأَخِيهِ",
        "rootid":1386,
        "rootword":"ا خ و",
        "meanings":"Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action.",
        "sentence":"The word وَأَخِيهِ comes from the root ا خ و and is associated with the meanings: Male person having the same parents as another or a male only having one parent in common; person of the same descent\/land\/creed\/faith with others; brother; friend; companion; match; fellow of a pair; kinsman; intimately acquainted.Signifying the relation of a brother - brotherhood\/fraternity. Act in a brotherly manner. An associate\/fellow. Sister, female friend. When it does not relate to birth, it means conformity\/similarity and combination\/agreement or unison in action."
    },

    {
        "indexid":5387,
        "wordid":18575,
        "word":"وَصَاحِبَتِهِ",
        "rootid":1464,
        "rootword":"ص ح ب",
        "meanings":"to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied.",
        "sentence":"The word وَصَاحِبَتِهِ comes from the root ص ح ب and is associated with the meanings: to company, associate, be the friend of or companion to. saahibun (pl. sahbuun and ashaabun) - companion, associate, possessor of any quality or thing, one in an intimate relation with anything, fellow and showing any type of connection or link, helper. saahibatun - spouse, consort, wife. saahaba - to bear company. ashaba (vb. 4) -to preserve, hinder, keep from, defend from. yushabuun - they will be accompanied."
    }]}