{"data":[
    {
        "indexid":5388,
        "wordid":18576,
        "word":"وَفَصِيلَتِهِ",
        "rootid":1494,
        "rootword":"ف ص ل",
        "meanings":"he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed",
        "sentence":"The word وَفَصِيلَتِهِ comes from the root ف ص ل and is associated with the meanings: he separated\/divided or put apart a thing from another thing, made a separation\/partition, distinct\/plain\/clear\/manifest, explain in detail, to distinguish, deciding between two things (e.g. what is true and what is not), distinct portion\/section.FASALA: To set apart, separate, distinguish, set a limit, part, depart, decide, set out, divide into parts, expatiate into detail, make clear (statement), distinct, judge, narrate a thing with all its particulars. FASLUN: Distinguishing, DecisiveMUFASSALAN: Clearly explainedFUSSILAT: DetailedMUFASSALAT: Fully detailed"
    },

    {
        "indexid":5388,
        "wordid":18577,
        "word":"تُءْوِيهِ",
        "rootid":1225,
        "rootword":"ا و ي",
        "meanings":"a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to.",
        "sentence":"The word تُءْوِيهِ comes from the root ا و ي and is associated with the meanings: a verb with the addition of hamza and doubled in perfect. To betake oneself for shelter, refuge or rest, have recourse to retire, alight at, give hospitality to."
    }]}