{"data":[
    {
        "indexid":5395,
        "wordid":9721,
        "word":"مَسَّهُ",
        "rootid":797,
        "rootword":"م س س",
        "meanings":"To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment.",
        "sentence":"The word مَسَّهُ comes from the root م س س and is associated with the meanings: To meet or touch or feel a thing with the hand, touch a thing without intervention or interference, strike or smite, afflict or befall, be distressing or difficult of accomplishment."
    },

    {
        "indexid":5395,
        "wordid":12069,
        "word":"الشَّرُّ",
        "rootid":546,
        "rootword":"ش ر ر",
        "meanings":"to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire.",
        "sentence":"The word الشَّرُّ comes from the root ش ر ر and is associated with the meanings: to do evil, be ill natured, wicked. yashirru\/yasharru - to find fault, defame. sharrun (pl. ashrar) - evil, bad, wicked, vicious ones. It is noteable that shurrun is an exceptional form of elative adjective while the measure for elative in Arabic is afa'la. shararun (pl. ashraar) - sparks of fire."
    },

    {
        "indexid":5395,
        "wordid":18586,
        "word":"جَزُوعًا",
        "rootid":1580,
        "rootword":"ج ز ع",
        "meanings":"To cut or cut off, to be impatient, manifest\/show\/display grief or agitation, display violent grief, break off or in half or in portions.",
        "sentence":"The word جَزُوعًا comes from the root ج ز ع and is associated with the meanings: To cut or cut off, to be impatient, manifest\/show\/display grief or agitation, display violent grief, break off or in half or in portions."
    }]}