{"data":[
    {
        "indexid":5437,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5437,
        "wordid":18625,
        "word":"يُعِيدُكُمْ",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word يُعِيدُكُمْ comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":5437,
        "wordid":18626,
        "word":"وَيُخْرِجُكُمْ",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word وَيُخْرِجُكُمْ comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    },

    {
        "indexid":5437,
        "wordid":18627,
        "word":"إِخْرَاجًا",
        "rootid":864,
        "rootword":"خ ر ج",
        "meanings":"To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective.",
        "sentence":"The word إِخْرَاجًا comes from the root خ ر ج and is associated with the meanings: To go out, go forth, depart, evade\/escape\/extricate oneself from, to quit\/forsake, to rebel, to be foul or obscene, conspicuous, be clear (as in clear sky as opposed to cloudy), to resolve\/explain\/render, educate\/discipline\/train well, render a thing of two mixtures (such as two colors, black and white, or to write upon part of a tablet and leave part of it blank), make a thing to be of different kinds, contribute to a thing or cause, make an agreement, extort\/extract\/produce\/elicit, to exclude something or someone, to vent, surpass or excel, outstrip others, be external\/extrinsic\/objective."
    }]}