{"data":[
    {
        "indexid":5462,
        "wordid":8735,
        "word":"لِجَهَنَّمَ",
        "rootid":871,
        "rootword":"ج ه ن م",
        "meanings":"Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment.",
        "sentence":"The word لِجَهَنَّمَ comes from the root ج ه ن م and is associated with the meanings: Hell or Hell-fire, name of the fire with which GOD will punish in the life to come, proper name of the abode of punishment."
    },

    {
        "indexid":5462,
        "wordid":11412,
        "word":"فَكَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word فَكَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5462,
        "wordid":18687,
        "word":"الْقَاسِطُونَ",
        "rootid":335,
        "rootword":"ق س ط",
        "meanings":"to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice.",
        "sentence":"The word الْقَاسِطُونَ comes from the root ق س ط and is associated with the meanings: to swerve from justice, act or deal unjustly\/wrongfully. qasuta - to act justly. qist - justice, equity. qasit - one who acts unjustly\/unrighteously. aqsatu - more just. aqsata (vb. 4) - to be just. muqsitun - one who observes justice."
    },

    {
        "indexid":5462,
        "wordid":18689,
        "word":"حَطَبًا",
        "rootid":1795,
        "rootword":"ح ط ب",
        "meanings":"aid\/assist, incites\/urges\/instigates, slander, collect (e.g. firewood), firewood, collector of firewood.",
        "sentence":"The word حَطَبًا comes from the root ح ط ب and is associated with the meanings: aid\/assist, incites\/urges\/instigates, slander, collect (e.g. firewood), firewood, collector of firewood."
    }]}