{"data":[
    {
        "indexid":5464,
        "wordid":2031,
        "word":"فِيهِ",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهِ comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5464,
        "wordid":2390,
        "word":"رَبِّهِ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5464,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":5464,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5464,
        "wordid":4870,
        "word":"عَذَابًا",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابًا comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":5464,
        "wordid":7040,
        "word":"ذِكْرِ",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذِكْرِ comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":5464,
        "wordid":13217,
        "word":"لِنَفْتِنَهُمْ",
        "rootid":159,
        "rootword":"ف ت ن",
        "meanings":"to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire.",
        "sentence":"The word لِنَفْتِنَهُمْ comes from the root ف ت ن and is associated with the meanings: to try or prove, persecute, burn, assay, put into affliction, distress and hardship, slaughter, cause to err, seduce from faith by any means, mislead, sow dissension or difference of opinion, mischief, put in confusion, punish, give reply or excuse, tempt, lead to temptation, make an attempt upon, seduce. fitnatun - persecution, trial, probation, burning, assaying, reply, excuse, war, means whereby the condition of a person is evinced in respect of good or evil, hardship, punishment, answer, temptation, burning with fire."
    },

    {
        "indexid":5464,
        "wordid":18694,
        "word":"يُعْرِضْ",
        "rootid":1276,
        "rootword":"ع ر ض",
        "meanings":"to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -",
        "sentence":"The word يُعْرِضْ comes from the root ع ر ض and is associated with the meanings: to take place, happen, offer, present, show, propound, set before, give a hint, come against, propose, expose, review (troops), view, prepare. aruDa - to be broad, widened. arDun - goods, width. irDun - honour. urDatun -"
    },

    {
        "indexid":5464,
        "wordid":18695,
        "word":"يَسْلُكْهُ",
        "rootid":1768,
        "rootword":"س ل ك",
        "meanings":"to make a way, travel, thread a pathway, cause to go along (a way), embark, insert, penetrate, walk, enter.",
        "sentence":"The word يَسْلُكْهُ comes from the root س ل ك and is associated with the meanings: to make a way, travel, thread a pathway, cause to go along (a way), embark, insert, penetrate, walk, enter."
    },

    {
        "indexid":5464,
        "wordid":18696,
        "word":"صَعَدًا",
        "rootid":653,
        "rootword":"ص ع د",
        "meanings":"to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up.",
        "sentence":"The word صَعَدًا comes from the root ص ع د and is associated with the meanings: to ascend, mount, run, move with quick steps faster than when walking, go up, be hard (affair).. saAAadan - severe\/vehement, overwhelmingly stern (punishment).. saAAoodan - increasingly overwhelming calamity\/torment.. saAAeedan - dust, soil, earth, surface of the earth, barren soil, elevated land.. as'ada (vb. 4) - to mount up, to go up. tusAAidoona - going up, going hard and far.. tasa'ada (vb. 5) - to climb up. yassaAAAAadu - he was climbing up."
    }]}