{"data":[
    {
        "indexid":5484,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5484,
        "wordid":2296,
        "word":"هُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word هُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":5484,
        "wordid":3397,
        "word":"إِلَهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word إِلَهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":5484,
        "wordid":3492,
        "word":"الْمَشْرِقِ",
        "rootid":1177,
        "rootword":"ش ر ق",
        "meanings":"to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise.",
        "sentence":"The word الْمَشْرِقِ comes from the root ش ر ق and is associated with the meanings: to split, rise, slit. sharqiyyun - of or pertaining to the east, eastern. mashriq - place of sunrise, east. mashriqain - two easts\/horizons, two places where the sun rises (in winter and summer, East and West). mashaariq - different points of sunrise, whence the sun rises in the course of the year, beam, gleam, eastern parts. ashraqa (vb. 4) - to shine, rise. ishraaq - sunrise. mushriqun - one on whom the sun has risen, who does anything at sunrise, one entering at the sunrise."
    },

    {
        "indexid":5484,
        "wordid":3493,
        "word":"وَالْمَغْرِبِ",
        "rootid":1268,
        "rootword":"غ ر ب",
        "meanings":"went\/passed away, depart\/retire\/remove, become remote\/distant\/absent\/hidden\/black, withdraw, western, foreign\/strange, exceed, abundance, sharpness, (maghrib = sunset), black.",
        "sentence":"The word وَالْمَغْرِبِ comes from the root غ ر ب and is associated with the meanings: went\/passed away, depart\/retire\/remove, become remote\/distant\/absent\/hidden\/black, withdraw, western, foreign\/strange, exceed, abundance, sharpness, (maghrib = sunset), black."
    },

    {
        "indexid":5484,
        "wordid":6107,
        "word":"وَكِيلًا",
        "rootid":322,
        "rootword":"و ك ل",
        "meanings":"to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon.",
        "sentence":"The word وَكِيلًا comes from the root و ك ل and is associated with the meanings: to entrust, confirm, give, charge, dispose affairs, lean upon, reply upon."
    },

    {
        "indexid":5484,
        "wordid":7984,
        "word":"رَبُّ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5484,
        "wordid":18729,
        "word":"فَاتَّخِذْهُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word فَاتَّخِذْهُ comes from the root ا خ ذ and is associated with the meanings: "
    }]}