{"data":[
    {
        "indexid":5507,
        "wordid":10091,
        "word":"مَالًا",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word مَالًا comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":5507,
        "wordid":18779,
        "word":"وَجَعَلْتُ",
        "rootid":486,
        "rootword":"ج ع ل",
        "meanings":"He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets.",
        "sentence":"The word وَجَعَلْتُ comes from the root ج ع ل and is associated with the meanings: He made a thing, he created\/brought into being\/existence. He made to be\/become\/constitute. He made to be in a altered state\/condition. He pronounced a thing by a true judgement\/decision\/legal ordinance, his judgement. Described them as females, pronounced them to be females, He made known\/plain, He exalted\/ennobled\/called\/named (as in a nation) He inserted a thing into a thing (Ex: They put their fingers into their ears) He put into the heart\/mind, He appointed\/assigned\/stipulated to give wages\/pay\/stipend. He set about\/began\/commenced\/commenced\/took to\/betook himself to, doing such a thing; He persisted, a piece of rag with which a cooking pot is put down from the fire, short palm trees\/shoots\/offsets."
    },

    {
        "indexid":5507,
        "wordid":18780,
        "word":"مَمْدُودًا",
        "rootid":234,
        "rootword":"م د د",
        "meanings":"to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung).",
        "sentence":"The word مَمْدُودًا comes from the root م د د and is associated with the meanings: to draw a thing (namely a rope), pull a thing, stretch a thing, strain a thing, extend by drawing or pulling, stretch forth, to prolong, expand\/elongate\/lengthen a thing, spread or spread out, delay or defer a thing, continue a thing, to help or aid someone, to advance, to increase, to supply ink (put ink into a thing), apply ink to a thing, manure land (with dung)."
    }]}