{"data":[
    {
        "indexid":5523,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5523,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5523,
        "wordid":17453,
        "word":"تَذَرُ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word تَذَرُ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    },

    {
        "indexid":5523,
        "wordid":18797,
        "word":"تُبْقِي",
        "rootid":1313,
        "rootword":"ب ق ي",
        "meanings":"Something or someone that remains, continues, lasts and\/or enduresPerpetual or permanentExisting, incessantly, always, endlessly or foreverWatching, observing, guarding or preservingPardoning, leaving, showing mercy or sparingRemaining portion, remainder, remnant, relic, residue, remains, recompense",
        "sentence":"The word تُبْقِي comes from the root ب ق ي and is associated with the meanings: Something or someone that remains, continues, lasts and\/or enduresPerpetual or permanentExisting, incessantly, always, endlessly or foreverWatching, observing, guarding or preservingPardoning, leaving, showing mercy or sparingRemaining portion, remainder, remnant, relic, residue, remains, recompense"
    }]}