{"data":[
    {
        "indexid":5531,
        "wordid":14174,
        "word":"نَذِيرًا",
        "rootid":162,
        "rootword":"ن ذ ر",
        "meanings":"(Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard.",
        "sentence":"The word نَذِيرًا comes from the root ن ذ ر and is associated with the meanings: (Nun-Thal-Ra) to dedicate, make a vow, warn, admonish, caution, promise voluntarily, offer present. nadhiir - warner, one who informs and averts calamity, who cautions and put one on guard."
    },

    {
        "indexid":5531,
        "wordid":18799,
        "word":"لِلْبَشَرِ",
        "rootid":456,
        "rootword":"ب ش ر",
        "meanings":"Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength).",
        "sentence":"The word لِلْبَشَرِ comes from the root ب ش ر and is associated with the meanings: Skin\/Pare\/Strip\/Skin Contact\/Epidermis (or insides)Complexion\/Hue->Delicacy, fineness ofBeauty\/Elegance of form\/Bright cheerful countenanceRejoiced\/Rejoicing\/Good, good tidings, glad tidings\/Announcements (bearer of), proclaiming, commencement, beginnings of anything\/Indications\/Streaks (daylight breaking, wind over land)Conducting, managing affairs personally.Lie with, to go in unto.Mankind, Human beings, Lowest\/basest\/meanest sort of people, Perfect man (combining gentleness with strength)."
    }]}