{"data":[
    {
        "indexid":5564,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":5564,
        "wordid":5811,
        "word":"الْإِنْسَانُ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانُ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":5564,
        "wordid":16271,
        "word":"قَدَّمَ",
        "rootid":100,
        "rootword":"ق د م",
        "meanings":"to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost.",
        "sentence":"The word قَدَّمَ comes from the root ق د م and is associated with the meanings: to precede, come forward, head a people. qadima - to come, return, come back from, turn, advance, set upon, betake one's self. qadamun - merit, rank, precedence, human foot, footing, foundation, example, strength. qadama sidqin - advancement, going forward in excellence, footing of firmness, strong and honourable footing, true rank, precedence of truthfulness. qadim - old, ancient. aqdamuna - forefathers. qaddama (vb. 2) - to bring upon, prefer, send before, prepare beforehand. taqaddama (vb. 5) - to advance, proceed, go forward, be previously (done or said), bring upon, send before, put forward (a threat), (threaten) beforehand, obtrude (opinion), be promoted, proposed, surpass, outstrip any one. istaqdama - to desire to advance, wish to anticipate, advance boldly. mustaqdimun - one who goes forward or desires to advance, who goes ahead, who lived before, foremost."
    },

    {
        "indexid":5564,
        "wordid":18849,
        "word":"يُنَبَّؤُا",
        "rootid":1456,
        "rootword":"ن ب ا",
        "meanings":"(root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter.",
        "sentence":"The word يُنَبَّؤُا comes from the root ن ب ا and is associated with the meanings: (root of nabi) to be high, lofty, become exalted\/elevated, to aquaint\/inform, utter in a low voice\/sound, cry, bark, gift of prophecy, prophet.To come\/go forth, to assault\/come upon, went forth, brought\/produce.Information; a piece of information; intellegence; an announcement; news; tidings; a piece of news; an account; a narrative, or narration; a story (something that is related from one to another). An announcement of great utility, from which results either knowledge or a predominance of opinion, and true.Eminence\/protuberence in the ground\/earth.An evident\/clear way.Bull, a torrent that comes forth from another land, a man coming forth unexpectedly from an unknown quarter."
    },

    {
        "indexid":5564,
        "wordid":18850,
        "word":"وَأَخَّرَ",
        "rootid":277,
        "rootword":"ا خ ر",
        "meanings":"go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd.",
        "sentence":"The word وَأَخَّرَ comes from the root ا خ ر and is associated with the meanings: go backwards, retreat\/recede\/retire, hold back\/delay\/postpone\/defer, last\/back part of a thing .Another, other, 2nd."
    }]}