{"data":[
    {
        "indexid":5612,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5612,
        "wordid":5530,
        "word":"رَبُّهُمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبُّهُمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5612,
        "wordid":12286,
        "word":"أَسَاوِرَ",
        "rootid":1014,
        "rootword":"س و ر",
        "meanings":"leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure.",
        "sentence":"The word أَسَاوِرَ comes from the root س و ر and is associated with the meanings: leap\/spring upon, overpowering influence, rose\/elevated, ascend\/mount upon, assault\/assail (gives a common example of usage: assault the head, i.e. rush upon the head, like wine), wall, bracelet, climb\/scale, uppermost structure, force\/strength, height, chapter, eminence\/nobility, high\/elevated station\/rank, any degree of a structure."
    },

    {
        "indexid":5612,
        "wordid":12291,
        "word":"سُنْدُسٍ",
        "rootid":506,
        "rootword":"س ن د س",
        "meanings":"fine silk-brocade (also see siin-nun-dal).",
        "sentence":"The word سُنْدُسٍ comes from the root س ن د س and is associated with the meanings: fine silk-brocade (also see siin-nun-dal)."
    },

    {
        "indexid":5612,
        "wordid":14266,
        "word":"طَهُورًا",
        "rootid":758,
        "rootword":"ط ه ر",
        "meanings":"to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand.",
        "sentence":"The word طَهُورًا comes from the root ط ه ر and is associated with the meanings: to be or become clean\/pure or free of dirt, made it or caused it to be distant\/remote, cleanse\/wash\/purify, refrain, remove oneself, to clear\/clean, ablution. Tay-ha\/Ha-Ya = spread out, extend\/expand."
    },

    {
        "indexid":5612,
        "wordid":16839,
        "word":"فِضَّةٍ",
        "rootid":1075,
        "rootword":"ف ض ض",
        "meanings":"to break\/perforate\/destroy, to separate\/disperse\/scatter\/distribute, broke it up, silver, to make wide\/ample\/large\/liberal, small number of men in a state of dispersion, calamity\/misfortune,",
        "sentence":"The word فِضَّةٍ comes from the root ف ض ض and is associated with the meanings: to break\/perforate\/destroy, to separate\/disperse\/scatter\/distribute, broke it up, silver, to make wide\/ample\/large\/liberal, small number of men in a state of dispersion, calamity\/misfortune,"
    },

    {
        "indexid":5612,
        "wordid":18936,
        "word":"عَالِيَهُمْ",
        "rootid":1215,
        "rootword":"ع ل و",
        "meanings":"to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop.",
        "sentence":"The word عَالِيَهُمْ comes from the root ع ل و and is associated with the meanings: to be high, elevated, lofty, exalted, ascend, overcome, be proud\/upon\/over, go up, rise in rank or dignity, raise, take up, mount, overtop."
    },

    {
        "indexid":5612,
        "wordid":18937,
        "word":"ثِيَابُ",
        "rootid":559,
        "rootword":"ث و ب",
        "meanings":"to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character.",
        "sentence":"The word ثِيَابُ comes from the root ث و ب and is associated with the meanings: to return, turn back to, to restore\/recover, to repent, to collect\/gather.to call\/summon (repeatedly), rise (dust), to flow, become abundant.something returned (recompence, reward, compensation), to repay.a thing which veils\/covers\/protects, a distinct body or company of people.mathabatan - place of return, place to which a visit entitles one to  thawab\/reward, assembly\/congregation for people who were dispersed\/separated previously, place of alighting, abode, house, tent.raiments, garments, morals, behaviour, heart, dependents, followers, robes, clothes, pure\/good hearted, of good character."
    },

    {
        "indexid":5612,
        "wordid":18938,
        "word":"خُضْرٌ",
        "rootid":1476,
        "rootword":"خ ض ر",
        "meanings":"To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure.",
        "sentence":"The word خُضْرٌ comes from the root خ ض ر and is associated with the meanings: To render or do the forbidden, blessed with means of subsistence, to die in youth, take up a load or burden, green, to become green in color (9th verb form), to be cut or cut off (like as dying young or fruit that is picked before it is ripe), fresh or pleasant, having much verdure."
    },

    {
        "indexid":5612,
        "wordid":18939,
        "word":"وَإِسْتَبْرَقٌ",
        "rootid":918,
        "rootword":"ب ر ق",
        "meanings":"Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness",
        "sentence":"The word وَإِسْتَبْرَقٌ comes from the root ب ر ق and is associated with the meanings: Shining, gleaming or glistening (e.g. the dawn, a sword)LightningThreatening or menacingA female beautifying and adorning herself or showing and presenting herself and\/or exhibiting her beautyA star rising or a constellation (e.g. Pleiades)Eyes\/sight glistening, fixedly open (e.g. by reason of fright), sights confused, astonished, stupefied or dazzled, sight becoming weak, opening eyes and looking hard, intently or sharplyDecorating or adorning (e.g. a place)Journeying farRugged ground in which stones, sand and earth are mixed together (the stones being of mixed\/varied colors on whitish earth)A mountain mixed with sandLocusts with variegated colorsA certain type of beast the apostle rode on the ascension to heaven called so because of the hue, brightness and quickness of motion it had akin to lightningA certain kind of plant camels feed on in times of necessityAnything having blackness and whiteness togetherAn ewer having a long slender spout and a handleA bow with different colorsSilk brocade closely woven with gold or closely woven cloth of thick silkThickness"
    },

    {
        "indexid":5612,
        "wordid":18940,
        "word":"وَحُلُّوا",
        "rootid":1788,
        "rootword":"ح ل ي",
        "meanings":"To give ornaments, adorn with ornaments.",
        "sentence":"The word وَحُلُّوا comes from the root ح ل ي and is associated with the meanings: To give ornaments, adorn with ornaments."
    },

    {
        "indexid":5612,
        "wordid":18941,
        "word":"وَسَقَاهُمْ",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word وَسَقَاهُمْ comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":5612,
        "wordid":18942,
        "word":"شَرَابًا",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word شَرَابًا comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    }]}