{"data":[
    {
        "indexid":5631,
        "wordid":14218,
        "word":"السَّمَاءُ",
        "rootid":936,
        "rootword":"س م و",
        "meanings":"to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality.",
        "sentence":"The word السَّمَاءُ comes from the root س م و and is associated with the meanings: to be high\/lofty, raised, name, attribute. samawat - heights\/heavens\/rain, raining clouds. ismun - mark of identification by which one is recognised. It is a derivation of wsm (pl. asma). ism - stands for a distinguishing mark of a thing, sometimes said to signify its reality."
    },

    {
        "indexid":5631,
        "wordid":18962,
        "word":"فُرِجَتْ",
        "rootid":1258,
        "rootword":"ف ر ج",
        "meanings":"To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs.",
        "sentence":"The word فُرِجَتْ comes from the root ف ر ج and is associated with the meanings: To open, separate, cleave, split, enlarge, part, let a space between, make a room, comfort anything in, dispel cares. An opening, intervening space [gap or breach] between two things. Ex: Parting hind legs or intervening spaces between fingers.He opened, made room, ample space.Furijat - Cloven, split, rent, opened.Farjun (Pl. Furuj) - Pudenda (sex organ); chastity, space between legs (of horse or mare), part\/s of a person (male\/female) indecent to expose, external portions of the organs of generation [of a male\/female]. Also the posterior pudendum because it is a place of opening, of between the legs."
    }]}