{"data":[
    {
        "indexid":5665,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":5665,
        "wordid":2539,
        "word":"كُلُوا",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word كُلُوا comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":5665,
        "wordid":2580,
        "word":"وَاشْرَبُوا",
        "rootid":224,
        "rootword":"ش ر ب",
        "meanings":"to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it.",
        "sentence":"The word وَاشْرَبُوا comes from the root ش ر ب and is associated with the meanings: to drink, swallow, sunk in, absorb. shirbun - portion of water, time of drinking. shurbun - drinking. shaaribun - one who drinks. sharaabun - drink, beverage, portion. mashrabun - drinking place. ashraba (vb. 4) - to give to drink, make to drink, permeate as. ushribu fi-qalbihi - love of such and such a thing permeated his heart, the word is so used because love is like alcohol that intoxicates one who partakes of it."
    },

    {
        "indexid":5665,
        "wordid":2724,
        "word":"تَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word تَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    }]}