{"data":[
    {
        "indexid":5684,
        "wordid":11422,
        "word":"سَبْعًا",
        "rootid":607,
        "rootword":"س ب ع",
        "meanings":"to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey.",
        "sentence":"The word سَبْعًا comes from the root س ب ع and is associated with the meanings: to make a number up to seven, be the seventh of, seven (sub'un), seventy (sab'ina), sometimes used in a vague manner as meaning seven or more and seventeen or more or several or many. The Arabic equivalents of the numbers seven, seventy and seven hundred are all used to indicate a large number by the Arabs and for multiplicity, not indicating exactness in number. Devour\/kill\/bite, beast, bird of prey."
    },

    {
        "indexid":5684,
        "wordid":13744,
        "word":"فَوْقَكُمْ",
        "rootid":1173,
        "rootword":"ف و ق",
        "meanings":"to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect.",
        "sentence":"The word فَوْقَكُمْ comes from the root ف و ق and is associated with the meanings: to be superior in rank or excellence, overcome, surpass, to be above\/over, on, upon, more, on high. fauq - it is a preposition meaning above\/upon\/over\/more\/superior. fawaq - time between two milkings\/sucklings, between the opening of one's hand and grasping with it the udder and then lets it go for milking or a delay and space of time between the opening and closing of the hand during milking. afaqa - to come to one's self, recover (after a swoon or ilness), awake (from sleep), recollect."
    },

    {
        "indexid":5684,
        "wordid":19008,
        "word":"شِدَادًا",
        "rootid":112,
        "rootword":"ش د د",
        "meanings":"to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard.",
        "sentence":"The word شِدَادًا comes from the root ش د د and is associated with the meanings: to bind tightly, strap, strengthen firmly, run, establish, make firm, hard, strong, be advanced (day), be intense. ushdud - harden, strengthen. shadiid (pl. shidaad & ashidda'u - great, firm, strict, vehement, strong, violent, severe, mighty, terrible, stern, grievous, miserly, niggardly. (adj. of the forms fa'iil and fiaal are used indifferently for both m. and f.): ashuddun: age of full strength, maturity. ishtadda (vb. 8) - to act with violence, become hard."
    }]}