{"data":[
    {
        "indexid":571,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":571,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":571,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":571,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":571,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":571,
        "wordid":2213,
        "word":"وَإِنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word وَإِنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":571,
        "wordid":2214,
        "word":"كُنْتُمْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كُنْتُمْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":571,
        "wordid":2332,
        "word":"هَؤُلَاءِ",
        "rootid":1607,
        "rootword":"ا و ل ا",
        "meanings":"",
        "sentence":"The word هَؤُلَاءِ comes from the root ا و ل ا and is associated with the meanings: "
    },

    {
        "indexid":571,
        "wordid":2425,
        "word":"تَكُونُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word تَكُونُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":571,
        "wordid":2753,
        "word":"عِنْدِ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدِ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":571,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":571,
        "wordid":3076,
        "word":"كُلٌّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلٌّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":571,
        "wordid":3205,
        "word":"الْمَوْتُ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word الْمَوْتُ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":571,
        "wordid":4190,
        "word":"الْقَوْمِ",
        "rootid":850,
        "rootword":"ق و م",
        "meanings":"stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state.",
        "sentence":"The word الْقَوْمِ comes from the root ق و م and is associated with the meanings: stand still or firm, rose\/stand up, managed\/conducted\/ordered\/regulated\/superintended, established, made it straight\/right, maintain\/erect\/observe\/perform, set up, people\/community\/company, abode, stature\/dignity\/rank. aqama - to keep a thing or an affair in a right state."
    },

    {
        "indexid":571,
        "wordid":5143,
        "word":"حَسَنَةٌ",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حَسَنَةٌ comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":571,
        "wordid":5146,
        "word":"سَيِّئَةٌ",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَيِّئَةٌ comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":571,
        "wordid":5897,
        "word":"حَدِيثًا",
        "rootid":1086,
        "rootword":"ح د ث",
        "meanings":"something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\"",
        "sentence":"The word حَدِيثًا comes from the root ح د ث and is associated with the meanings: something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\""
    },

    {
        "indexid":571,
        "wordid":6085,
        "word":"أَيْنَمَا",
        "rootid":1460,
        "rootword":"ا ي ن",
        "meanings":"",
        "sentence":"The word أَيْنَمَا comes from the root ا ي ن and is associated with the meanings: "
    },

    {
        "indexid":571,
        "wordid":6086,
        "word":"يُدْرِكُكُمُ",
        "rootid":183,
        "rootword":"د ر ك",
        "meanings":"To overtake, follow up, drop closely.",
        "sentence":"The word يُدْرِكُكُمُ comes from the root د ر ك and is associated with the meanings: To overtake, follow up, drop closely."
    },

    {
        "indexid":571,
        "wordid":6087,
        "word":"بُرُوجٍ",
        "rootid":978,
        "rootword":"ب ر ج",
        "meanings":"Anything being, becoming apparent, manifest, conspicuous and\/or high or elevatedA structure, tower, fortress or walls of a city, a structure or construction that has the characteristics of conspicuousness, height and strengthA woman showing or displaying finery, ornaments, form or countenance to men or strangers conspicuouslyA sign of the Zodiac, mansions\/stations of the moon, or the stars\/constellations, gates of heaven metaphoricallyConstitution of the eye which is such that the white entirely surrounds the black part and no part of the black being concealed or the clearness of the parts, or the width and largeness of the eyeballA large and liberal dispositionA vessel or receptacle in which milk is churned or in which the butter of the milk is extracted by agitationA garment having figures of towers\/walls of a city etc",
        "sentence":"The word بُرُوجٍ comes from the root ب ر ج and is associated with the meanings: Anything being, becoming apparent, manifest, conspicuous and\/or high or elevatedA structure, tower, fortress or walls of a city, a structure or construction that has the characteristics of conspicuousness, height and strengthA woman showing or displaying finery, ornaments, form or countenance to men or strangers conspicuouslyA sign of the Zodiac, mansions\/stations of the moon, or the stars\/constellations, gates of heaven metaphoricallyConstitution of the eye which is such that the white entirely surrounds the black part and no part of the black being concealed or the clearness of the parts, or the width and largeness of the eyeballA large and liberal dispositionA vessel or receptacle in which milk is churned or in which the butter of the milk is extracted by agitationA garment having figures of towers\/walls of a city etc"
    },

    {
        "indexid":571,
        "wordid":6088,
        "word":"مُشَيَّدَةٍ",
        "rootid":643,
        "rootword":"ش ي د",
        "meanings":"to plaster or coat (a wall), raise (a building), lofty, fortify.",
        "sentence":"The word مُشَيَّدَةٍ comes from the root ش ي د and is associated with the meanings: to plaster or coat (a wall), raise (a building), lofty, fortify."
    },

    {
        "indexid":571,
        "wordid":6089,
        "word":"تُصِبْهُمْ",
        "rootid":1557,
        "rootword":"ص و ب",
        "meanings":"to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\"",
        "sentence":"The word تُصِبْهُمْ comes from the root ص و ب and is associated with the meanings: to pour forth, hit the mark, come down. asaaba - to overtake, happen to, befall, fall upon, will, affect injuriously, meet with, send down, pour down upon, afflict or punish, intend, desire. sawaabun - that which is right, straight forward course, rightness. musiibun - that which happens. musiibatun - calamity. Lane: \"...it poured forth (said of rain), it descended, a calamity that falls upon or becomes settled\/fixed...\""
    },

    {
        "indexid":571,
        "wordid":6090,
        "word":"يَقُولُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":571,
        "wordid":6091,
        "word":"عِنْدِكَ",
        "rootid":865,
        "rootword":"ع ن د",
        "meanings":"Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place.",
        "sentence":"The word عِنْدِكَ comes from the root ع ن د and is associated with the meanings: Inda: Preposition: here, with, by, at the point of, about, from, in the presence of. The word denotes the idea of nearness, whether it be actual in the sense of possession or ideational, it also denotes a sense of rank or dignity or opinion, time and place."
    },

    {
        "indexid":571,
        "wordid":6093,
        "word":"يَكَادُونَ",
        "rootid":152,
        "rootword":"ك و د",
        "meanings":"To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit.",
        "sentence":"The word يَكَادُونَ comes from the root ك و د and is associated with the meanings: To be about to, be just on the point of, be well nigh, intend, wish, practise an artful device, desire, contrive\/plot\/devise such a thing, worked or laboured at or upon anything, to do something clandestinely, to deceive\/beguile\/circumvent, means of evading\/eluding, vomited, emitted fire, had menstrual flux, gave up his spirit."
    },

    {
        "indexid":571,
        "wordid":6094,
        "word":"يَفْقَهُونَ",
        "rootid":240,
        "rootword":"ف ق ه",
        "meanings":"to be learned, skilled in divine law, endowed with penetration, understand a thing.",
        "sentence":"The word يَفْقَهُونَ comes from the root ف ق ه and is associated with the meanings: to be learned, skilled in divine law, endowed with penetration, understand a thing."
    }]}