{"data":[
    {
        "indexid":5720,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":5720,
        "wordid":8736,
        "word":"قُلُوبٌ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word قُلُوبٌ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":5720,
        "wordid":19050,
        "word":"وَاجِفَةٌ",
        "rootid":195,
        "rootword":"و ج ف",
        "meanings":"being athrob (heart), beating painfully, to urge, to prick (e.g. an animal to make it go faster). To be agitated in a most disturbed condition, palpitate, run.",
        "sentence":"The word وَاجِفَةٌ comes from the root و ج ف and is associated with the meanings: being athrob (heart), beating painfully, to urge, to prick (e.g. an animal to make it go faster). To be agitated in a most disturbed condition, palpitate, run."
    }]}