{"data":[
    {
        "indexid":5779,
        "wordid":19104,
        "word":"أَمَاتَهُ",
        "rootid":329,
        "rootword":"م و ت",
        "meanings":"To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life.",
        "sentence":"The word أَمَاتَهُ comes from the root م و ت and is associated with the meanings: To die, to pass away from the earthly life, to be destitute or deprived of life, deprived of sensation, deprived of the intellectual faculty, to be still\/quiet\/motionless, to be calm\/still, to sleep, lifeless, to be assuaged, dried up by the earth, to cease, wear out\/be worn out, to be poor\/reduced to poverty, abject\/base\/despicable\/vile, disobedient or rebellious, lowly\/humble\/submissive, to be soft\/loose\/flabby\/relaxed, lack spirit or life."
    },

    {
        "indexid":5779,
        "wordid":19105,
        "word":"فَأَقْبَرَهُ",
        "rootid":1260,
        "rootword":"ق ب ر",
        "meanings":"to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying.",
        "sentence":"The word فَأَقْبَرَهُ comes from the root ق ب ر and is associated with the meanings: to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying."
    }]}