{"data":[
    {
        "indexid":578,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":578,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":578,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":578,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":578,
        "wordid":2246,
        "word":"مِنْهَا",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهَا comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":578,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":578,
        "wordid":2773,
        "word":"سَيِّئَةً",
        "rootid":498,
        "rootword":"س و ا",
        "meanings":"to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame.",
        "sentence":"The word سَيِّئَةً comes from the root س و ا and is associated with the meanings: to treat badly, do evil to disgrace, be evil\/wicked\/vicious, ill, anything that makes a person sad and sorrowful, bad action, mischief and corruption, sin, evil doer, wretched or grievous, vex, annoy. su'atun (pl. suat) - corpse, external portion of both sexes, shame."
    },

    {
        "indexid":578,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":578,
        "wordid":3713,
        "word":"يَكُنْ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُنْ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":578,
        "wordid":3751,
        "word":"حَسَنَةً",
        "rootid":1403,
        "rootword":"ح س ن",
        "meanings":"To be handsome, make good, seem good or beautiful, be excellent.",
        "sentence":"The word حَسَنَةً comes from the root ح س ن and is associated with the meanings: To be handsome, make good, seem good or beautiful, be excellent."
    },

    {
        "indexid":578,
        "wordid":3754,
        "word":"نَصِيبٌ",
        "rootid":296,
        "rootword":"ن ص ب",
        "meanings":"to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant.",
        "sentence":"The word نَصِيبٌ comes from the root ن ص ب and is associated with the meanings: to fix, raise\/setup\/establish. nasiba - to use diligence, toil\/labour, be instant."
    },

    {
        "indexid":578,
        "wordid":6129,
        "word":"يَشْفَعْ",
        "rootid":167,
        "rootword":"ش ف ع",
        "meanings":"to make even that which was odd, make double, pair, make a thing to be one of the pair, adjoin a thing to its like, provide a thing which was alone with another, protect, mediate, intercede, be an intercessor. shaf'un - pair, double. shafa'at - likeness\/similarity, intercede or pray for a person.",
        "sentence":"The word يَشْفَعْ comes from the root ش ف ع and is associated with the meanings: to make even that which was odd, make double, pair, make a thing to be one of the pair, adjoin a thing to its like, provide a thing which was alone with another, protect, mediate, intercede, be an intercessor. shaf'un - pair, double. shafa'at - likeness\/similarity, intercede or pray for a person."
    },

    {
        "indexid":578,
        "wordid":6130,
        "word":"شَفَاعَةً",
        "rootid":167,
        "rootword":"ش ف ع",
        "meanings":"to make even that which was odd, make double, pair, make a thing to be one of the pair, adjoin a thing to its like, provide a thing which was alone with another, protect, mediate, intercede, be an intercessor. shaf'un - pair, double. shafa'at - likeness\/similarity, intercede or pray for a person.",
        "sentence":"The word شَفَاعَةً comes from the root ش ف ع and is associated with the meanings: to make even that which was odd, make double, pair, make a thing to be one of the pair, adjoin a thing to its like, provide a thing which was alone with another, protect, mediate, intercede, be an intercessor. shaf'un - pair, double. shafa'at - likeness\/similarity, intercede or pray for a person."
    },

    {
        "indexid":578,
        "wordid":6131,
        "word":"كِفْلٌ",
        "rootid":139,
        "rootword":"ك ف ل",
        "meanings":"To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety.",
        "sentence":"The word كِفْلٌ comes from the root ك ف ل and is associated with the meanings: To take care of, nourish, bring up for another, be guardian of, be responsible for, entrust, stand security or surety."
    },

    {
        "indexid":578,
        "wordid":6132,
        "word":"مُقِيتًا",
        "rootid":1508,
        "rootword":"ق و ت",
        "meanings":"to nourish\/feed, nourishments\/sustenances\/provisions. muqitan - protector\/controller\/observer, controller of distribution, powerful keeper, who watches.",
        "sentence":"The word مُقِيتًا comes from the root ق و ت and is associated with the meanings: to nourish\/feed, nourishments\/sustenances\/provisions. muqitan - protector\/controller\/observer, controller of distribution, powerful keeper, who watches."
    }]}