{"data":[
    {
        "indexid":5782,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5782,
        "wordid":5811,
        "word":"الْإِنْسَانُ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانُ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":5782,
        "wordid":19109,
        "word":"فَلْيَنْظُرِ",
        "rootid":358,
        "rootword":"ن ظ ر",
        "meanings":"to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle.",
        "sentence":"The word فَلْيَنْظُرِ comes from the root ن ظ ر and is associated with the meanings: to see, look at, glance, gaze, observe, behold, consider, regard, listen to, be patient towards, wait, contemplate, grant respite, put off, scrutinise, show kindness, examine, search, reflect. nazara - the look with affection, to perplex, dazzle."
    },

    {
        "indexid":5782,
        "wordid":19110,
        "word":"طَعَامِهِ",
        "rootid":1791,
        "rootword":"ط ع م",
        "meanings":"ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating.",
        "sentence":"The word طَعَامِهِ comes from the root ط ع م and is associated with the meanings: ate\/taste\/swallowed, to flavour\/savour, appetite\/desire, to feed\/supply, way of eating, food\/meal, cultivate, ripened fruit, an approvable quality in a man (e.g. intelligence\/prudence\/discretion), good state\/condition in respect of food, one who feeds much, place of eating."
    }]}