{"data":[
    {
        "indexid":5815,
        "wordid":2208,
        "word":"فَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word فَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":5815,
        "wordid":17893,
        "word":"أُقْسِمُ",
        "rootid":1479,
        "rootword":"ق س م",
        "meanings":"to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division.",
        "sentence":"The word أُقْسِمُ comes from the root ق س م and is associated with the meanings: to divide, dispose, separate, apportion, distribute. qasamun - oath. qismatun - partition, division, dividing, apportionment. maqsumun - divided\/distinct. muqassimun (vb. 2) - one who takes oath, who apportions. qasama (vb. 3) - to swear. aqsama (vb. 4) - to swear. taqasama (vb. 6) - to swear one to another. muqtasimun (vb. 8) - who divides. istaqsama (vb. 10) - to draw lots. tastaqsimu - you seek division."
    },

    {
        "indexid":5815,
        "wordid":19159,
        "word":"بِالْخُنَّسِ",
        "rootid":1563,
        "rootword":"خ ن س",
        "meanings":"To retreat\/recede\/drawback, retire or hold back, lag behind, shrink and hide\/withdraw oneself, remain behind a company of people (as opposed to going with them [ syn. takhallafa] ), sneak something away (so as not to be seen), keep one back, place one behind or after, contract\/draw together or make to contract\/draw together.",
        "sentence":"The word بِالْخُنَّسِ comes from the root خ ن س and is associated with the meanings: To retreat\/recede\/drawback, retire or hold back, lag behind, shrink and hide\/withdraw oneself, remain behind a company of people (as opposed to going with them [ syn. takhallafa] ), sneak something away (so as not to be seen), keep one back, place one behind or after, contract\/draw together or make to contract\/draw together."
    }]}