{"data":[
    {
        "indexid":5873,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":5873,
        "wordid":19204,
        "word":"يُسْقَوْنَ",
        "rootid":1157,
        "rootword":"س ق ي",
        "meanings":"to water, give\/ask to drink, irrigate. siqayatun - drinking cup.",
        "sentence":"The word يُسْقَوْنَ comes from the root س ق ي and is associated with the meanings: to water, give\/ask to drink, irrigate. siqayatun - drinking cup."
    },

    {
        "indexid":5873,
        "wordid":19205,
        "word":"رَحِيقٍ",
        "rootid":612,
        "rootword":"ر ح ق",
        "meanings":"pure, delightfully refreshing wine.",
        "sentence":"The word رَحِيقٍ comes from the root ر ح ق and is associated with the meanings: pure, delightfully refreshing wine."
    },

    {
        "indexid":5873,
        "wordid":19206,
        "word":"مَخْتُومٍ",
        "rootid":1719,
        "rootword":"خ ت م",
        "meanings":"To seal\/stamp\/imprint\/impress, to secure\/protect oneself against a thing, produce an impression or effect upon a thing, reach the end of a thing, cover over a thing, turn away\/avoid\/shun someone or something, to not understand, prevent the heart from believing, feign heedlessness.",
        "sentence":"The word مَخْتُومٍ comes from the root خ ت م and is associated with the meanings: To seal\/stamp\/imprint\/impress, to secure\/protect oneself against a thing, produce an impression or effect upon a thing, reach the end of a thing, cover over a thing, turn away\/avoid\/shun someone or something, to not understand, prevent the heart from believing, feign heedlessness."
    }]}