{"data":[
    {
        "indexid":5888,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":5888,
        "wordid":2253,
        "word":"فِيهَا",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِيهَا comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":5888,
        "wordid":19224,
        "word":"وَأَلْقَتْ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word وَأَلْقَتْ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    },

    {
        "indexid":5888,
        "wordid":19225,
        "word":"وَتَخَلَّتْ",
        "rootid":1339,
        "rootword":"خ ل و",
        "meanings":"To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed).",
        "sentence":"The word وَتَخَلَّتْ comes from the root خ ل و and is associated with the meanings: To be empty\/vacant\/void\/destitute\/unoccupied, to be free from fault or a thing or affair, free of accusation or suspicion, to be alone or without any companion, meet with one in a vacant\/unoccupied place, to pass away, to dismiss, let loose or let go a thing, permit or allow a thing, to forsake\/relinquish\/desert\/abandon a thing, to be distant\/remote\/aloof\/far from a thing, be at leisure, unoccupied (unemployed)."
    }]}