{"data":[
    {
        "indexid":5890,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":5890,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":5890,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":5890,
        "wordid":5811,
        "word":"الْإِنْسَانُ",
        "rootid":457,
        "rootword":"ا ن س",
        "meanings":"to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion.",
        "sentence":"The word الْإِنْسَانُ comes from the root ا ن س and is associated with the meanings: to be or become sociable, companionable, conversable, inclined to company or conversation, friendly, amicable, or familiar. To be or become cheered, or gladdened or cheerful, gay, or gladsome. To be or become at ease, or tranquil; without shrinking or aversion."
    },

    {
        "indexid":5890,
        "wordid":19226,
        "word":"كَادِحٌ",
        "rootid":1774,
        "rootword":"ك د ح",
        "meanings":"To toil, exert, make every effort to carry out a thing, labour hard and actively, toil hard, labouring, laboriously, one who labours, to weary oneself in work, to seek to gain sustenance, to disfigure, render a thing ugly or unseemly.",
        "sentence":"The word كَادِحٌ comes from the root ك د ح and is associated with the meanings: To toil, exert, make every effort to carry out a thing, labour hard and actively, toil hard, labouring, laboriously, one who labours, to weary oneself in work, to seek to gain sustenance, to disfigure, render a thing ugly or unseemly."
    },

    {
        "indexid":5890,
        "wordid":19227,
        "word":"كَدْحًا",
        "rootid":1774,
        "rootword":"ك د ح",
        "meanings":"To toil, exert, make every effort to carry out a thing, labour hard and actively, toil hard, labouring, laboriously, one who labours, to weary oneself in work, to seek to gain sustenance, to disfigure, render a thing ugly or unseemly.",
        "sentence":"The word كَدْحًا comes from the root ك د ح and is associated with the meanings: To toil, exert, make every effort to carry out a thing, labour hard and actively, toil hard, labouring, laboriously, one who labours, to weary oneself in work, to seek to gain sustenance, to disfigure, render a thing ugly or unseemly."
    },

    {
        "indexid":5890,
        "wordid":19228,
        "word":"فَمُلَاقِيهِ",
        "rootid":712,
        "rootword":"ل ق ي",
        "meanings":"To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times.",
        "sentence":"The word فَمُلَاقِيهِ comes from the root ل ق ي and is associated with the meanings: To meet, meet with, encounter, find, find out a thing, see, come across, experience, suffer from, occur, undergo, endure, lean upon, recieve, come face to face, go in the direction of or towards.This root has occurred in al quran in 45 forms, and been used about 145 times."
    }]}