{"data":[
    {
        "indexid":59,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":59,
        "wordid":2279,
        "word":"بَعْدِ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدِ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":59,
        "wordid":2506,
        "word":"عَفَوْنَا",
        "rootid":1250,
        "rootword":"ع ف و",
        "meanings":"Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon.",
        "sentence":"The word عَفَوْنَا comes from the root ع ف و and is associated with the meanings: Ayn-Fa-Waw = to forgive\/pardon, abound, pass over, forgo, grow, multiply, obliterate all traces, remit, give more than what is due, relinquish right or remit in whole or in part. afina (oblique pl. of afin) - forgiving. afuwwan - very forgiving, name of Allah. afwun - forgiveness, indulgence, surplus, superfluity. ya'fu - to pardon. ufiya - he is pardoned. (It does not necessarily imply the committing of a sin on the part of a person about whom it is used.). . 'afaa (prf. 3rd. m. sing.): pardoned.. 'afau (prf. 3rd. m. pl.): they grew in affluence.. ya'fuu \/ ya'fuwa (imp. 3rd. m. pl.): pardons, passes over, forgoes.. ya'fu (imp. 3rd. m. sing. juss.): he forgives.. ya'fuuna (impf. 3rd. f. pl.): they forgo.. li ya'fuu (imp. 3rd. m. pl.): they may pardon.. ta'fuu (imp. 2nd. m. pl.): you forgo, pardon.. na'fu (imp. 1st. pl. juss.): we pardon.. i'fu (prt. m. sing): thou pardon.. 'ufiya (pp. 3rd. m. sing.): who has been granted remission.. 'afwa (n.): forgiveness, surplus.. 'afuwwun \/ 'afuwwan (nom.\/acc. n.): very forgiving.. 'aafiina (act. pic. m. pl.): those who pardon."
    },

    {
        "indexid":59,
        "wordid":2507,
        "word":"عَنْكُمْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْكُمْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":59,
        "wordid":2508,
        "word":"تَشْكُرُونَ",
        "rootid":266,
        "rootword":"ش ك ر",
        "meanings":"to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable.",
        "sentence":"The word تَشْكُرُونَ comes from the root ش ك ر and is associated with the meanings: to give thanks, be grateful, realize or acknowledge one's favour, praise. shukrun - giving thanks, gratitude. shaakirun - one who gives thanks or is grateful, appreciated and bountiful in reward.. shakruurun - thankful. Sometimes a distinction is made between this word and shaakirun. The former is used to denote a person who is thankful for little or for nothing, the latter grateful for large favours.. mashkuurun - gratefully accepted, acceptable."
    }]}