{"data":[
    {
        "indexid":5948,
        "wordid":2361,
        "word":"الْكَافِرِينَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word الْكَافِرِينَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":5948,
        "wordid":19280,
        "word":"فَمَهِّلِ",
        "rootid":905,
        "rootword":"م ه ل",
        "meanings":"To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite.",
        "sentence":"The word فَمَهِّلِ comes from the root م ه ل and is associated with the meanings: To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite."
    },

    {
        "indexid":5948,
        "wordid":19281,
        "word":"أَمْهِلْهُمْ",
        "rootid":905,
        "rootword":"م ه ل",
        "meanings":"To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite.",
        "sentence":"The word أَمْهِلْهُمْ comes from the root م ه ل and is associated with the meanings: To act gently or softly, act in a leisurely manner, leave one alone or grant one delay or respite."
    },

    {
        "indexid":5948,
        "wordid":19282,
        "word":"رُوَيْدًا",
        "rootid":142,
        "rootword":"ر و د",
        "meanings":"to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.).",
        "sentence":"The word رُوَيْدًا comes from the root ر و د and is associated with the meanings: to seek, ask a thing gently, search (for food), go to and fro in a pasture, go round about. iradatun - will, free will. mirwad - axle of a pully. rawada - to long after, desire, seduce, entice, seduce against the will (with 'an) as in 12:126. yuridu - he wishes, intends. It is used as an auxiliary verb as in 18:77. The word iradah is used for power and capacity with reference to subjugation as well as to option and choice. ruwaidan - for a little while, go gently (according to some grammarians the word is a diminutive form of which verbal noun is not in use, it is used as sing. plu. f. m.)."
    }]}