{"data":[
    {
        "indexid":600,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":600,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":600,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":600,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":600,
        "wordid":2088,
        "word":"أَنْفُسَهُمْ",
        "rootid":189,
        "rootword":"ن ف س",
        "meanings":"was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment.",
        "sentence":"The word أَنْفُسَهُمْ comes from the root ن ف س and is associated with the meanings: was or became high in estimation, of high account or excellent, highly prized\/precious\/valuable and therefore desired with much emulation or much request, desired, it became loved or highly esteemed, console, cheer, envy.. Was or became avaricious\/tenacious\/niggardly of it because of its being in high estimation or excellent, little to much good.. Brought forth (e.g. gave birth to a child), menstruated, blood.. Clear away grief\/anxiety\/sorrow, ease\/relieve, delay.. Breath, gust, drew breath, sigh, spoke long (due to regular intake of breath), become extended\/long\/increased, ability.. Soul\/spirit, the vital principle, intellect\/reason\/mind, inner desire or feeling, knowledge, pride, self-magnification, a state where there is ample scope for action, 'willingly' when used as adverb, nafs - soul of discrimination (mental) and ruh - soul of breath (physical), oneself\/itself, whole, essential constituent, reality, sometimes ghayb and nafs are synonymous, a person\/being\/individual, quantity, man, life, soul + body, life-blood, body, contention\/thought\/face\/substance, heart, stomach, gulp, drought.. Brother or co-partner in faith\/religion\/relationship.. Wide space, distance, width.. Greatness, nobility, glory, scarcity, absoluteness, unseen, hidden reality which is beyond human perception, intention, requital, punishment."
    },

    {
        "indexid":600,
        "wordid":2728,
        "word":"كَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":600,
        "wordid":3636,
        "word":"عَنِ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنِ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":600,
        "wordid":3654,
        "word":"يُحِبُّ",
        "rootid":244,
        "rootword":"ح ب ب",
        "meanings":"To love, like, wish.",
        "sentence":"The word يُحِبُّ comes from the root ح ب ب and is associated with the meanings: To love, like, wish."
    },

    {
        "indexid":600,
        "wordid":6284,
        "word":"تُجَادِلْ",
        "rootid":113,
        "rootword":"ج د ل",
        "meanings":"To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page].",
        "sentence":"The word تُجَادِلْ comes from the root ج د ل and is associated with the meanings: To twist something firmly, make something firm or strong or compact, become hard and strong, contend or litigate in an altercation\/dispute vehemently or violently, throw someone down, according to later usage  (of the lawyers) to compare evidences [in a discussion with another person or other persons] in order that it might appear which of those evidences was preponderant, compete in disputation or contention and in striving to overcome [thereby], build or construct, rule a thing with lines [such as a book is ruled round a page]."
    },

    {
        "indexid":600,
        "wordid":6285,
        "word":"يَخْتَانُونَ",
        "rootid":1366,
        "rootword":"خ و ن",
        "meanings":"To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion.",
        "sentence":"The word يَخْتَانُونَ comes from the root خ و ن and is associated with the meanings: To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion."
    },

    {
        "indexid":600,
        "wordid":6286,
        "word":"خَوَّانًا",
        "rootid":1366,
        "rootword":"خ و ن",
        "meanings":"To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion.",
        "sentence":"The word خَوَّانًا comes from the root خ و ن and is associated with the meanings: To be unfaithful or act unfaithfully to the confidence or trust reposed in a person, act treacherously or unfaithfully, neglect or fail in trustworthiness or faithfulness\/loyalty, act contrary to what is right by breaking a pact or covenant, make to suffer loss or diminution, break off\/become severed, alter the state or condition of a thing or person for the worse, diminish\/waste\/impair\/take from a thing little by little, languid or weak, intentionally look at a thing which it is not allowable to look, make a look that induces suspicion or evil opinion."
    },

    {
        "indexid":600,
        "wordid":6287,
        "word":"أَثِيمًا",
        "rootid":614,
        "rootword":"ا ث م",
        "meanings":"to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime.",
        "sentence":"The word أَثِيمًا comes from the root ا ث م and is associated with the meanings: to commit a crime\/sin or lie. ithm - sin, crime, guilt, iniquity, lie, anything that hinders from good deeds, harmful, anything which renders a person deserving of punishment, anything that pricks the mind as something evil, unlawful. athaam - punishment of wickedness, the requital. aathim - evil doer, one who sins. athiim - wicked person. taa'thiim - accusation of crime."
    }]}