{"data":[
    {
        "indexid":601,
        "wordid":2001,
        "word":"اللَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":601,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":601,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":601,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":601,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":601,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":601,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":601,
        "wordid":2303,
        "word":"وَهُوَ",
        "rootid":1538,
        "rootword":"ه و",
        "meanings":"huwa = He (pronoun. masculine 3rd. sing.)",
        "sentence":"The word وَهُوَ comes from the root ه و and is associated with the meanings: huwa = He (pronoun. masculine 3rd. sing.)"
    },

    {
        "indexid":601,
        "wordid":2360,
        "word":"وَكَانَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word وَكَانَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":601,
        "wordid":2857,
        "word":"مَعَهُمْ",
        "rootid":1684,
        "rootword":"م ع",
        "meanings":"With",
        "sentence":"The word مَعَهُمْ comes from the root م ع and is associated with the meanings: With"
    },

    {
        "indexid":601,
        "wordid":2910,
        "word":"يَعْمَلُونَ",
        "rootid":174,
        "rootword":"ع م ل",
        "meanings":"to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does.",
        "sentence":"The word يَعْمَلُونَ comes from the root ع م ل and is associated with the meanings: to do\/make\/act\/work\/operate\/perform\/construct\/manufacture, practice a handcraft, be active, one who does."
    },

    {
        "indexid":601,
        "wordid":6105,
        "word":"يُبَيِّتُونَ",
        "rootid":345,
        "rootword":"ب ي ت",
        "meanings":"by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)",
        "sentence":"The word يُبَيِّتُونَ comes from the root ب ي ت and is associated with the meanings: by\/in\/at night (excluding sleep), entered upon or passed the nighttent, house, home Thinking about something and its end resultConcealed or conceived something in the mindA structure of clay or any structure signifying a habitation, an abode or dwelling.Buildings, uninhabited houses, shops, ruins, bazaars, places where the entering is allowed by the owners.Ark of Noah, Mosques, places of worship, Kaabeh or JerusalemA graveHousehold or familyNobilitySudden attack in the night or a surprise attack in the nightRemaining through the night (e.g. bread or water that stays out and becomes stale)"
    },

    {
        "indexid":601,
        "wordid":6288,
        "word":"يَسْتَخْفُونَ",
        "rootid":1414,
        "rootword":"خ ف ي",
        "meanings":"Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed).",
        "sentence":"The word يَسْتَخْفُونَ comes from the root خ ف ي and is associated with the meanings: Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed)."
    },

    {
        "indexid":601,
        "wordid":6289,
        "word":"يَرْضَى",
        "rootid":38,
        "rootword":"ر ض و",
        "meanings":"he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient.",
        "sentence":"The word يَرْضَى comes from the root ر ض و and is associated with the meanings: he was pleased\/content\/satisfied with him; regarded him with good will or favour or liked or approved him, choose\/prefer, consent to, agreeable\/acceptable, loved it, liked it, inclined to it, had a desire for it. ridzwanun - grace, acceptance, favour, that which is pleasing.. One who is responsible, accountable, or answerable, loving; a lover; or a friend, obeying, or obedient."
    },

    {
        "indexid":601,
        "wordid":6290,
        "word":"الْقَوْلِ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word الْقَوْلِ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":601,
        "wordid":6291,
        "word":"مُحِيطًا",
        "rootid":289,
        "rootword":"ح و ط",
        "meanings":"To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method.",
        "sentence":"The word مُحِيطًا comes from the root ح و ط and is associated with the meanings: To guard\/keep, keep safely\/protect\/take care of a person or thing, defend a person or thing, pay frequent attention to a person or thing, to mind or be regardful of one's things, have compassion or affection for a person, to undertake\/superintend\/manage one's affairs, retire to a distance, to leave and go against, take care of and preserve (the tie of kindred), draw towards oneself or compress and guard one's possession, to surround\/encompass a thing, build a wall around a thing, have within one's compass or power and care a thing or affair, monopolize a thing, endeavour to induce a person to turn or incline, endeavour to turn a person by deceit or guile (namely in a matter that he desired of him and which he refused him), surround\/encompass\/environ\/enclose\/hemm in a person or thing, to encircle or beset the sides of a person or thing, to have something or someone in one's grasp or power, to destroy or cause destruction, beset a thing on every side (and leaving no escape), to take a thing entirely to oneself and debar others from it, to comprehend or know a thing altogether or in all its modes or circumstances, to know a thing extrinsically and intrisically, attain the utmost particular of a thing, have a comprehensive and complete knowledge of a thing, to pursue a course or thing by prudence or precaution or good judgement, to use precaution, take the sure course, to seek the most successful means, take the surest method."
    }]}