{"data":[
    {
        "indexid":6012,
        "wordid":19360,
        "word":"وَتَأْكُلُونَ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word وَتَأْكُلُونَ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":6012,
        "wordid":19361,
        "word":"التُّرَاثَ",
        "rootid":452,
        "rootword":"و ر ث",
        "meanings":"to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed.",
        "sentence":"The word التُّرَاثَ comes from the root و ر ث and is associated with the meanings: to inherit, be heir to anyone, survive, be owner or sustainer of somebody after some one, succeed."
    },

    {
        "indexid":6012,
        "wordid":19362,
        "word":"أَكْلًا",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word أَكْلًا comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    },

    {
        "indexid":6012,
        "wordid":19363,
        "word":"لَمًّا",
        "rootid":1235,
        "rootword":"ل م م",
        "meanings":"(lamma) To gather, collect, amass, assemble, pick up greedily, lesser offences, unwilled offences, small faults, inadvertent sins.",
        "sentence":"The word لَمًّا comes from the root ل م م and is associated with the meanings: (lamma) To gather, collect, amass, assemble, pick up greedily, lesser offences, unwilled offences, small faults, inadvertent sins."
    }]}