{"data":[
    {
        "indexid":6090,
        "wordid":3310,
        "word":"رَبِّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":6090,
        "wordid":18413,
        "word":"بِنِعْمَةِ",
        "rootid":291,
        "rootword":"ن ع م",
        "meanings":"o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). ",
        "sentence":"The word بِنِعْمَةِ comes from the root ن ع م and is associated with the meanings: o lead an easy life, enjoy the comforts and conveniences of life, be joyful, comforts\/delights, become easy\/soft\/plentiful\/pleasant\/good\/flourishing, to knead\/cook well. in'aam - beneficence, favour to a person, blessing, gifted (with speech\/talent\/reason etc). "
    },

    {
        "indexid":6090,
        "wordid":19451,
        "word":"فَحَدِّثْ",
        "rootid":1086,
        "rootword":"ح د ث",
        "meanings":"something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\"",
        "sentence":"The word فَحَدِّثْ comes from the root ح د ث and is associated with the meanings: something new\/recent, it (a thing) came into existence, began to be, originated, had a beginning, existed newly for the first time, to relate discourse,story\/report\/narration\/statement\/tale.Lane: \"hadathu - a novelty or new thing, an innovation, a thing not known before, and particularly relating to El-Islam (i.e. to matters of religious doctrines or practices or the like)\""
    }]}