{"data":[
    {
        "indexid":6122,
        "wordid":19483,
        "word":"نَاصِيَةٍ",
        "rootid":226,
        "rootword":"ن ص و",
        "meanings":"(Nun-Saad-Ya) forelock, get the mastery over, get hold of.",
        "sentence":"The word نَاصِيَةٍ comes from the root ن ص و and is associated with the meanings: (Nun-Saad-Ya) forelock, get the mastery over, get hold of."
    },

    {
        "indexid":6122,
        "wordid":19484,
        "word":"كَاذِبَةٍ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word كَاذِبَةٍ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    },

    {
        "indexid":6122,
        "wordid":19485,
        "word":"خَاطِئَةٍ",
        "rootid":177,
        "rootword":"خ ط ا",
        "meanings":"To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error.",
        "sentence":"The word خَاطِئَةٍ comes from the root خ ط ا and is associated with the meanings: To do wrong, commit a mistake or error, commit a sin or crime or act of disobedience for which one deserves punishment, commit a fault or offense (intentionally or unintentionally), pursue a wrong way (intentionally or otherwise), cause to miss or pass over, miss a thing (or fail of hitting it), miss or deviate from, far or out of reach, cause one to make a mistake, feign a wrong action\/mistake\/error."
    }]}