{"data":[
    {
        "indexid":6155,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":6155,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":6155,
        "wordid":2450,
        "word":"أَفَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word أَفَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":6155,
        "wordid":2742,
        "word":"يَعْلَمُ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word يَعْلَمُ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":6155,
        "wordid":13500,
        "word":"الْقُبُورِ",
        "rootid":1260,
        "rootword":"ق ب ر",
        "meanings":"to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying.",
        "sentence":"The word الْقُبُورِ comes from the root ق ب ر and is associated with the meanings: to bury (the dead). aqbara - to cause to be buried, have a grave day, have anyone buried. Grave, tomb, intermediate state in which the soul lives after death till the resurrection. maqabir - cemetery, place of burying."
    },

    {
        "indexid":6155,
        "wordid":19531,
        "word":"بُعْثِرَ",
        "rootid":756,
        "rootword":"ب ع ث ر",
        "meanings":"scatter abroad, turn upside down, to overthrow.",
        "sentence":"The word بُعْثِرَ comes from the root ب ع ث ر and is associated with the meanings: scatter abroad, turn upside down, to overthrow."
    }]}