{"data":[
    {
        "indexid":6180,
        "wordid":5643,
        "word":"لِكُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word لِكُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":6180,
        "wordid":16970,
        "word":"وَيْلٌ",
        "rootid":232,
        "rootword":"و ي ل",
        "meanings":"word of interjection, dispraise or threat, woe!",
        "sentence":"The word وَيْلٌ comes from the root و ي ل and is associated with the meanings: word of interjection, dispraise or threat, woe!"
    },

    {
        "indexid":6180,
        "wordid":19549,
        "word":"هُمَزَةٍ",
        "rootid":204,
        "rootword":"ه م ز",
        "meanings":"to backbite, defame, push back with a blow, pinch, repel, find fault with, suggest evil, break, throw (on the ground), squeeze, bite.",
        "sentence":"The word هُمَزَةٍ comes from the root ه م ز and is associated with the meanings: to backbite, defame, push back with a blow, pinch, repel, find fault with, suggest evil, break, throw (on the ground), squeeze, bite."
    },

    {
        "indexid":6180,
        "wordid":19550,
        "word":"لُمَزَةٍ",
        "rootid":437,
        "rootword":"ل م ز",
        "meanings":"To wink, make a sign with the eye or hand, defame, reproach, blame, find fault, speak ill, slanderer, strike, repel, traduce. lamaza vb.",
        "sentence":"The word لُمَزَةٍ comes from the root ل م ز and is associated with the meanings: To wink, make a sign with the eye or hand, defame, reproach, blame, find fault, speak ill, slanderer, strike, repel, traduce. lamaza vb."
    }]}