{"data":[
    {
        "indexid":6183,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":6183,
        "wordid":12824,
        "word":"كَلَّا",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كَلَّا comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":6183,
        "wordid":19555,
        "word":"لَيُنْبَذَنَّ",
        "rootid":225,
        "rootword":"ن ب ذ",
        "meanings":"(Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account.",
        "sentence":"The word لَيُنْبَذَنَّ comes from the root ن ب ذ and is associated with the meanings: (Nun-Ba-Thal) to throw, fling, give up, cast off, reject, throw a thing because of its worthlessness or not taking into account."
    },

    {
        "indexid":6183,
        "wordid":19556,
        "word":"الْحُطَمَةِ",
        "rootid":553,
        "rootword":"ح ط م",
        "meanings":"To break into small pieces, crush, crumble, smash.",
        "sentence":"The word الْحُطَمَةِ comes from the root ح ط م and is associated with the meanings: To break into small pieces, crush, crumble, smash."
    }]}