{"data":[
    {
        "indexid":6195,
        "wordid":19573,
        "word":"إِيلَافِهِمْ",
        "rootid":1554,
        "rootword":"ا ل ف",
        "meanings":"he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known.",
        "sentence":"The word إِيلَافِهِمْ comes from the root ا ل ف and is associated with the meanings: he kept or clave to it, he frequented it, resorted to it habitually, he became familiar with it or accustomed\/habituated, became sociable\/companionable\/friendly with him, liked\/approved\/amicable, protect\/safeguard, covenant\/obligation involving responsibility for safety. to unite or bring together, state of union\/alliance\/agreement, to cause union or companionship, to collect\/connect\/join\/conjoin. Become a thousand. A certain rounded number that is well known."
    },

    {
        "indexid":6195,
        "wordid":19574,
        "word":"رِحْلَةَ",
        "rootid":1404,
        "rootword":"ر ح ل",
        "meanings":"to depart, saddle-bag, he saddled the camel, he bound upon the camel, to mount, rode, pack, caravan, remove\/travel\/journey.",
        "sentence":"The word رِحْلَةَ comes from the root ر ح ل and is associated with the meanings: to depart, saddle-bag, he saddled the camel, he bound upon the camel, to mount, rode, pack, caravan, remove\/travel\/journey."
    },

    {
        "indexid":6195,
        "wordid":19575,
        "word":"الشِّتَاءِ",
        "rootid":319,
        "rootword":"ش ت و",
        "meanings":"to pass winter, be cold, winter.",
        "sentence":"The word الشِّتَاءِ comes from the root ش ت و and is associated with the meanings: to pass winter, be cold, winter."
    },

    {
        "indexid":6195,
        "wordid":19576,
        "word":"وَالصَّيْفِ",
        "rootid":441,
        "rootword":"ص ي ف",
        "meanings":"to pass the summer.",
        "sentence":"The word وَالصَّيْفِ comes from the root ص ي ف and is associated with the meanings: to pass the summer."
    }]}