{"data":[
    {
        "indexid":6217,
        "wordid":10816,
        "word":"أَبِي",
        "rootid":241,
        "rootword":"ا ب و",
        "meanings":"father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up.",
        "sentence":"The word أَبِي comes from the root ا ب و and is associated with the meanings: father\/grandfather\/ancestor, fathership\/paternity, to nourish\/feed\/rear, bring up."
    },

    {
        "indexid":6217,
        "wordid":19597,
        "word":"تَبَّتْ",
        "rootid":433,
        "rootword":"ت ب ب",
        "meanings":"suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin.",
        "sentence":"The word تَبَّتْ comes from the root ت ب ب and is associated with the meanings: suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin."
    },

    {
        "indexid":6217,
        "wordid":19598,
        "word":"يَدَا",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word يَدَا comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":6217,
        "wordid":19599,
        "word":"لَهَبٍ",
        "rootid":1662,
        "rootword":"ل ه ب",
        "meanings":"To blaze fiercely\/intensely, inflame, burn with anger, Ardour of fire, flame, fiery tempered person, abu lahab - father of flame.. A gap\/space between two mountains, a cleft\/fissure in a mountain.. Nickname of the Holy Prophet's uncle, whose real name was Abdul Uzza. [[This is a traditional understanding may conflict with 49:11. Does 'abu lahab' describe a specific person or a personality archetype\/model?]]",
        "sentence":"The word لَهَبٍ comes from the root ل ه ب and is associated with the meanings: To blaze fiercely\/intensely, inflame, burn with anger, Ardour of fire, flame, fiery tempered person, abu lahab - father of flame.. A gap\/space between two mountains, a cleft\/fissure in a mountain.. Nickname of the Holy Prophet's uncle, whose real name was Abdul Uzza. [[This is a traditional understanding may conflict with 49:11. Does 'abu lahab' describe a specific person or a personality archetype\/model?]]"
    },

    {
        "indexid":6217,
        "wordid":19600,
        "word":"وَتَبَّ",
        "rootid":433,
        "rootword":"ت ب ب",
        "meanings":"suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin.",
        "sentence":"The word وَتَبَّ comes from the root ت ب ب and is associated with the meanings: suffer loss, diminution, become beaten\/trodden\/lost, become. old, perished, perdition, death, weakened\/impaired, to. cut-off, curtail, be doomed, destruction\/loss\/ruin."
    }]}