{"data":[
    {
        "indexid":654,
        "wordid":2075,
        "word":"النَّاسِ",
        "rootid":861,
        "rootword":"ن و س",
        "meanings":"to swing, halt in a place, move, toss. Mankind, people, others, men.",
        "sentence":"The word النَّاسِ comes from the root ن و س and is associated with the meanings: to swing, halt in a place, move, toss. Mankind, people, others, men."
    },

    {
        "indexid":654,
        "wordid":2236,
        "word":"لِلْكَافِرِينَ",
        "rootid":1515,
        "rootword":"ك ف ر",
        "meanings":"to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]",
        "sentence":"The word لِلْكَافِرِينَ comes from the root ك ف ر and is associated with the meanings: to conceal, to cover, to reject, to disbelieve, to be thankless, unthankful, ungrateful, to disown, deny, faithless, black horse, dark night, tiller\/farmer. [[Perhaps it should be noted that its primary meaning is to cover\/conceal (hence farmer), with active\/conscious intent. From this, is born: to reject\/disbelieve because this is a conscious decision made by a person. Please note one can only reject something after hearing\/seeing\/experiencing it, not before.]]"
    },

    {
        "indexid":654,
        "wordid":2435,
        "word":"بِالْبَاطِلِ",
        "rootid":751,
        "rootword":"ب ط ل",
        "meanings":"Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies.",
        "sentence":"The word بِالْبَاطِلِ comes from the root ب ط ل and is associated with the meanings: Becoming false, untrue, wrong, incorrect, fictitious, spurious, unfounded, unsound, vain, unreal, worthless, futile, unprofitable, ineffectual, devoid of virtue, null, void or of no accountA thing perishing or becoming lostBecoming idle, unoccupied or without workDiverted from profitable enterprises (in this life or the next)Jesting, joking or not serious in conversationBecoming or being courageous, brave, strong hearted (in war or fight)Pursuit of vain, frivolous diversion or sport, ignorant conductIblees, Satan, devils or enchantersOne who says a thing in which there is no truth or reality, embellishing speech with lies."
    },

    {
        "indexid":654,
        "wordid":2727,
        "word":"وَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word وَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":654,
        "wordid":2730,
        "word":"مِنْهُمْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْهُمْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":654,
        "wordid":4417,
        "word":"الرِّبَوا",
        "rootid":413,
        "rootword":"ر ب و",
        "meanings":"it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased.",
        "sentence":"The word الرِّبَوا comes from the root ر ب و and is associated with the meanings: it increased\/augmented, the practicing\/taking of usury, excess\/addition, become high\/grown up\/large\/swollen\/risen, mount up, to grow\/swell, out of breath. rabiyatun - ever-increasing, severe. arba (comp. form) - more numerous, more increased."
    },

    {
        "indexid":654,
        "wordid":4870,
        "word":"عَذَابًا",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابًا comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":654,
        "wordid":5628,
        "word":"أَمْوَالَ",
        "rootid":396,
        "rootword":"م و ل",
        "meanings":"To be abundant in weath, possess an abundance of property.",
        "sentence":"The word أَمْوَالَ comes from the root م و ل and is associated with the meanings: To be abundant in weath, possess an abundance of property."
    },

    {
        "indexid":654,
        "wordid":5716,
        "word":"أَلِيمًا",
        "rootid":551,
        "rootword":"ا ل م",
        "meanings":"ALM",
        "sentence":"The word أَلِيمًا comes from the root ا ل م and is associated with the meanings: ALM"
    },

    {
        "indexid":654,
        "wordid":5821,
        "word":"عَنْهُ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":654,
        "wordid":5875,
        "word":"وَأَعْتَدْنَا",
        "rootid":851,
        "rootword":"ع ت د",
        "meanings":"to be ready, prepared, at hand, provide a thing for the future.",
        "sentence":"The word وَأَعْتَدْنَا comes from the root ع ت د and is associated with the meanings: to be ready, prepared, at hand, provide a thing for the future."
    },

    {
        "indexid":654,
        "wordid":6484,
        "word":"وَأَخْذِهِمُ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word وَأَخْذِهِمُ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":654,
        "wordid":6485,
        "word":"نُهُوا",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word نُهُوا comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":654,
        "wordid":6486,
        "word":"وَأَكْلِهِمْ",
        "rootid":1274,
        "rootword":"ا ك ل",
        "meanings":"swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables",
        "sentence":"The word وَأَكْلِهِمْ comes from the root ا ك ل and is associated with the meanings: swallowing food after chewing, means of subsistence, devoured\/consumed, fed\/supplied, things to be eaten, eatables"
    }]}