{"data":[
    {
        "indexid":665,
        "wordid":2005,
        "word":"لِلَّهِ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word لِلَّهِ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":665,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":665,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":665,
        "wordid":2294,
        "word":"إِلَيْهِ",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَيْهِ comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":665,
        "wordid":2298,
        "word":"جَمِيعًا",
        "rootid":1195,
        "rootword":"ج م ع",
        "meanings":"To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another.",
        "sentence":"The word جَمِيعًا comes from the root ج م ع and is associated with the meanings: To collect or gather, bring together, to contract, assemble or congregate, unite or connect or form a connection, bring into a state of union, reconcile or conciliate, put on a thing [such as clothing article], to compose\/arrange\/settle, to pray in congregation, determine\/resolve\/decide upon a thing, agree or unite in opinion, prepare or make a thing ready, dry up a thing, conspire or league with another, coexist with one, to be compact\/compressed\/contracted, exert one's energy, to compromise or comprehend or contain, enter or go into, to meet or be in company with another."
    },

    {
        "indexid":665,
        "wordid":2469,
        "word":"عَنْ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":665,
        "wordid":2524,
        "word":"لَنْ",
        "rootid":140,
        "rootword":"ل ن",
        "meanings":"(lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption.",
        "sentence":"The word لَنْ comes from the root ل ن and is associated with the meanings: (lana)To soften, make tender, lenient, gentle, smooth.linatun - apalm-tree of which the dates are of very inferior quality and are unfit for human consumption."
    },

    {
        "indexid":665,
        "wordid":3006,
        "word":"وَمَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word وَمَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":665,
        "wordid":3323,
        "word":"يَكُونَ",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word يَكُونَ comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":665,
        "wordid":4161,
        "word":"الْمَلَائِكَةُ",
        "rootid":181,
        "rootword":"م ل ك",
        "meanings":"to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom.",
        "sentence":"The word الْمَلَائِكَةُ comes from the root م ل ك and is associated with the meanings: to rule\/command\/reign, be capable, to control, power\/authority, king, kingdom."
    },

    {
        "indexid":665,
        "wordid":4801,
        "word":"الْمَسِيحُ",
        "rootid":1564,
        "rootword":"م س ح",
        "meanings":"to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah",
        "sentence":"The word الْمَسِيحُ comes from the root م س ح and is associated with the meanings: to wipe\/rub\/stroke, passing one's hand over something, chosen\/anointed, messiah"
    },

    {
        "indexid":665,
        "wordid":6524,
        "word":"يَسْتَنْكِفَ",
        "rootid":1226,
        "rootword":"ن ك ف",
        "meanings":"to refuse\/reject, abstain from, disdain, feel too proud.",
        "sentence":"The word يَسْتَنْكِفَ comes from the root ن ك ف and is associated with the meanings: to refuse\/reject, abstain from, disdain, feel too proud."
    },

    {
        "indexid":665,
        "wordid":6525,
        "word":"عَبْدًا",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عَبْدًا comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":665,
        "wordid":6526,
        "word":"الْمُقَرَّبُونَ",
        "rootid":151,
        "rootword":"ق ر ب",
        "meanings":"to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh.",
        "sentence":"The word الْمُقَرَّبُونَ comes from the root ق ر ب and is associated with the meanings: to be near to, approach, offer, be near in relationship or rank, be at hand, draw near. qurbatun - proximity, means of drawing nigh, kindred, relationship. qurubatan (pl. qurubatun) - pious works and good deeds which draw people nigh to Allah, means by which an approach is sought. qaribun - night, near at hand (either in time or place). min qaribin - soon after. qurba - affinity, relationship. qurban - sacrifice, offer made for God, means of access to God. aqrabu - closer, closest. aqrabun - kinsfolk, kindred, those most nearly related. qarrab (vb. 2) - to set before, cause to draw nigh, make an offering, offer (sacrifice). muqarrabun (pl. maqarrabuna) - one who is made or permitted to approach, who is brought nigh."
    },

    {
        "indexid":665,
        "wordid":6527,
        "word":"يَسْتَنْكِفْ",
        "rootid":1226,
        "rootword":"ن ك ف",
        "meanings":"to refuse\/reject, abstain from, disdain, feel too proud.",
        "sentence":"The word يَسْتَنْكِفْ comes from the root ن ك ف and is associated with the meanings: to refuse\/reject, abstain from, disdain, feel too proud."
    },

    {
        "indexid":665,
        "wordid":6528,
        "word":"عِبَادَتِهِ",
        "rootid":1789,
        "rootword":"ع ب د",
        "meanings":"serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave.",
        "sentence":"The word عِبَادَتِهِ comes from the root ع ب د and is associated with the meanings: serve, worship, adore, venerate, accept the impression of a thing, obey with submissiveness or humility, approve, apply, devote, obedience, slave, keep to inseparably, subdue, assemble together, enslave."
    },

    {
        "indexid":665,
        "wordid":6529,
        "word":"وَيَسْتَكْبِرْ",
        "rootid":494,
        "rootword":"ك ب ر",
        "meanings":"To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair).",
        "sentence":"The word وَيَسْتَكْبِرْ comes from the root ك ب ر and is associated with the meanings: To be hard, become hard, be grievous, grow up, be great. Kabira\/Yakburu: To be exceed anyone in age, become stout and tall, grow big, become great, illustrious, become momentous (affair)."
    },

    {
        "indexid":665,
        "wordid":6530,
        "word":"فَسَيَحْشُرُهُمْ",
        "rootid":761,
        "rootword":"ح ش ر",
        "meanings":"To gather together, raise from the dead, banish.",
        "sentence":"The word فَسَيَحْشُرُهُمْ comes from the root ح ش ر and is associated with the meanings: To gather together, raise from the dead, banish."
    }]}