{"data":[
    {
        "indexid":75,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":75,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":75,
        "wordid":2077,
        "word":"يَقُولُ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word يَقُولُ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":75,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":75,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":75,
        "wordid":2307,
        "word":"قَالَ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالَ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":75,
        "wordid":2588,
        "word":"رَبَّكَ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبَّكَ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":75,
        "wordid":2652,
        "word":"بَيْنَ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word بَيْنَ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":75,
        "wordid":2664,
        "word":"ادْعُ",
        "rootid":1610,
        "rootword":"د ع و",
        "meanings":"to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry.",
        "sentence":"The word ادْعُ comes from the root د ع و and is associated with the meanings: to seek, desire, ask, demand, call upon, invoke, ascribe, cry out, call out to, pray, supplicate, petition, require, need, summon, invite, assert, succour. (e.g. 'daAAa' in phonetic search engine).. Adopted son (adiya, pl. of da'iy).. . Da'aa (prf. 3rd. p.m. sing.): He prayed, called.. Du'aa (prf. 3rd. p.m. plu.): They ascribed.. Da'utu (prf. 1st. p. sing.): I called.. Li Yad'u (prt. 3rd. p.m. sing.): Let him call; he might call.. Lam Yad'u (imp. 3rd. p.m.): Did not call us.. Yad'u (imp. 3rd. p.m.): He calls.. Yad'uuna (imp. 3rd. p.m. plu.): They call.. Yad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu (imp. 2nd. p.m. sing.): Thou call.. Tad'uu\/Tad'uuna (acc.\/ imp. 1st. p. plu.): You call.. Nad'u\/Nad'uu (imp. 1st. p. plu.): We call.. Ud'u (prt. 2nd. p.m. sing.): Thou call.. Ud'uu (prt. 2nd. p.m. plu.): Call you all.. Du'iya (pp. 3rd. p.m. sing.): He was called.. Du'uu (pip. 3rd. p.m. plu.): They were called.. Du'iitum (pp. 2nd. p.m. plu.): You were called.. Laa tad'u (prt. neg.): Do not call.. Da'uutum (prf. 3rd. p.m. plu.): You called.. Tud'auna (pip. 2nd. p.m. plu.): You are called.. Tad'uu\/Tad'uuna (imp. 3rd. p.m. plu. VIII.): They ask for.. Tadda'uuna (imp. 2nd. p.m. plu. VIII.): You ask for.. Tud'aa (pip. 2nd. p.m. plu. VIII.): You will be summoned.. Yud'aa (pip. 3rd. p.m. sing. VIII.): He will be summoned.. Yud'auna (pip. 3rd. p.m. plu. VIII.): They will be summoned.. Daa'in\/Daa'ii (act. pic. m. sing.): One who calls, summons.. Du'aa'un (v.n.): Supplication; prayer; call.. Du'aai (comb.): My prayer; calling.. Ad'iyaa (n. plu.): Adopted son.. Da'watun (v.n.): Call; claim; message; supplication; prayer.. Da'waahum (comb.): Their cry."
    },

    {
        "indexid":75,
        "wordid":2665,
        "word":"يُبَيِّنْ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word يُبَيِّنْ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":75,
        "wordid":2666,
        "word":"هِيَ",
        "rootid":505,
        "rootword":"ه ي",
        "meanings":"she",
        "sentence":"The word هِيَ comes from the root ه ي and is associated with the meanings: she"
    },

    {
        "indexid":75,
        "wordid":2668,
        "word":"بَقَرَةٌ",
        "rootid":89,
        "rootword":"ب ق ر",
        "meanings":"Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities",
        "sentence":"The word بَقَرَةٌ comes from the root ب ق ر and is associated with the meanings: Slit, ripped, split cut or divided lengthwise. Opening, laying open, widening. Revealing (e.g. story, or an animal's insides). Inquiring to the utmost after sciences or knowledge. Being astonished, amazed, stupefied at seeing something or confounded, confused, perplexed, tired or fatigued, weary or jaded. Ox, bull and cow (bovine genus) both domesticated and wild. A species of grape that is large, black and round and a species of plum in Palestine. Owner or possessor of oxen\/bulls\/cows. A strong staff\/stick (e.g. for driving herds). A sedition, discord or dissention that severs society, corrupts religion and separates men, or something wide spreading\/reaching and great. Abundance of wealth\/commodities"
    },

    {
        "indexid":75,
        "wordid":2669,
        "word":"فَارِضٌ",
        "rootid":880,
        "rootword":"ف ر ض",
        "meanings":"to impose law, prescribe, ordain, enact, settle, fix, ratify, appoint, command an observation or obedience to, sanction, assign, be aged. faridzun - old cow. faridzatun - ordinance, settlement, settled portion, jointure stipulation. mafrudz - appointed, determinate, settled one, allotted.",
        "sentence":"The word فَارِضٌ comes from the root ف ر ض and is associated with the meanings: to impose law, prescribe, ordain, enact, settle, fix, ratify, appoint, command an observation or obedience to, sanction, assign, be aged. faridzun - old cow. faridzatun - ordinance, settlement, settled portion, jointure stipulation. mafrudz - appointed, determinate, settled one, allotted."
    },

    {
        "indexid":75,
        "wordid":2670,
        "word":"بِكْرٌ",
        "rootid":99,
        "rootword":"ب ك ر",
        "meanings":"Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception",
        "sentence":"The word بِكْرٌ comes from the root ب ك ر and is associated with the meanings: Beginning of the day, first part of the day, early morning, between daybreak and sunrise. Possessing the quality of applying oneself early, or in hastening. Performing something at the commencement of it, or doing something early. Before it's time, preceding or took precedence. Youthful male camel, young one of a camel. A virgin male or female, or anything untouched, new, fresh. Virginity or maidenhead. A woman or female animal having delivered only once. First flush of anything (plant, tree, fruit, honey, rain, flowers). First born or young children. First of anything, unique action. A want or need seeking to be fulfilled. A cutting blow or stroke that kills at once. A pulley (e.g. of a well). Small ring or bead. An assembly, company, congregated body. All coming together without exception"
    },

    {
        "indexid":75,
        "wordid":2671,
        "word":"عَوَانٌ",
        "rootid":211,
        "rootword":"ع و ن",
        "meanings":"to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68).",
        "sentence":"The word عَوَانٌ comes from the root ع و ن and is associated with the meanings: to be of middle age. yu'inu (vb. 4) - to aid\/assist\/help. ta'awana (vb. 4) - to help one another. ista'ana (vb. 10) - to implore for help, seek aid, turn and call for assistance. musta'an - one whose help is to be implored.. . A'aana (prf. 3rd. m. sing. vb. IV): helped.. A'iinuu (prt. m. pl. vb. IV): help ye one another.. Ta'aawanuu (prt. m. pl. vb. IV): to help one another.. Nasta'iinuu (imp. 1st. pl. vb. VI): we implore for help.. Ista'iinuu (prt. m. pl. vb. 10): you seek help.. Must'aiinu (pis. pic. m. sing.  vb. 10): one whose help is saught.. 'Awaanun (n.): one of middle age (2:68)."
    },

    {
        "indexid":75,
        "wordid":2672,
        "word":"فَافْعَلُوا",
        "rootid":672,
        "rootword":"ف ع ل",
        "meanings":"to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont.",
        "sentence":"The word فَافْعَلُوا comes from the root ف ع ل and is associated with the meanings: to do something, He did it, the suffering or receiving the effect of an act, to commit, a doing, to do a deed, a custom\/habit\/manner\/wont."
    },

    {
        "indexid":75,
        "wordid":2673,
        "word":"تُؤْمَرُونَ",
        "rootid":823,
        "rootword":"ا م ر",
        "meanings":"command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant.",
        "sentence":"The word تُؤْمَرُونَ comes from the root ا م ر and is associated with the meanings: command\/order\/enjoin, authority\/power\/dominion, counselled\/advised\/consulted, hold\/appoint command, preside as a commander\/governor\/prince\/king, experienced, become many\/abundant."
    }]}