{"data":[
    {
        "indexid":763,
        "wordid":2035,
        "word":"بِالْغَيْبِ",
        "rootid":623,
        "rootword":"غ ي ب",
        "meanings":"absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible.",
        "sentence":"The word بِالْغَيْبِ comes from the root غ ي ب and is associated with the meanings: absent\/remote\/hidden\/concealed, absent from the range or beyond the reach of perception by sense or of mental perception, unseen\/invisible."
    },

    {
        "indexid":763,
        "wordid":2065,
        "word":"اللَّهُ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهُ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":763,
        "wordid":2072,
        "word":"عَذَابٌ",
        "rootid":1008,
        "rootword":"ع ذ ب",
        "meanings":"chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12.",
        "sentence":"The word عَذَابٌ comes from the root ع ذ ب and is associated with the meanings: chastisement, castigate, punishment, torture, torment, retribution, abstain\/desist, relinquish, quit.adhb - sweet (usually water), e.g. 25:53, 35:12."
    },

    {
        "indexid":763,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":763,
        "wordid":2085,
        "word":"ءَامَنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":763,
        "wordid":2094,
        "word":"أَلِيمٌ",
        "rootid":551,
        "rootword":"ا ل م",
        "meanings":"ALM",
        "sentence":"The word أَلِيمٌ comes from the root ا ل م and is associated with the meanings: ALM"
    },

    {
        "indexid":763,
        "wordid":2157,
        "word":"مِنَ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنَ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":763,
        "wordid":2188,
        "word":"يَاأَيُّهَا",
        "rootid":891,
        "rootword":"ا ي ي",
        "meanings":"sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. ",
        "sentence":"The word يَاأَيُّهَا comes from the root ا ي ي and is associated with the meanings: sign, apparent sign, mark, indication, message, evidence, proof, miracle, communication, verse of The Quran. It properly signifies any apparent thing inseparable from a thing not equally apparent so that when one perceives the former, he perceives the other which he cannot perceive by itself. "
    },

    {
        "indexid":763,
        "wordid":3110,
        "word":"بَعْدَ",
        "rootid":427,
        "rootword":"ب ع د",
        "meanings":"Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility.",
        "sentence":"The word بَعْدَ comes from the root ب ع د and is associated with the meanings: Becoming distant, remote, far off, aloof or far awayRemoved, retired, withdrew to a distanceAlienated, estranged, wide separation, great distancePossessing judgment and prudence, penetrating, effective judgment, depth or far reaching judgmentGo or going a great length or far in hostility."
    },

    {
        "indexid":763,
        "wordid":3350,
        "word":"بِشَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word بِشَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":763,
        "wordid":3470,
        "word":"فَمَنِ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word فَمَنِ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":763,
        "wordid":3531,
        "word":"اعْتَدَى",
        "rootid":1164,
        "rootword":"ع د و",
        "meanings":"to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  ",
        "sentence":"The word اعْتَدَى comes from the root ع د و and is associated with the meanings: to pass by, overlook, transgress, turn aside.. adwun - wickedly, unjustly, spitefully, wrongfully.. adi'yat - companies of warriors, chargers, horses of the warriors, wayfarers who run fast on their journey, swift horses.. aduwatun - enmity. udwan - hostility, injustice. aduwwan (pl. aduwun) - enemy.. . Ya'duuna (impf. 3rd. m. pl.): They transgressed; Programmed.. Laa Ta'du (prt. neg. m. sing.): Do not overlook, not let your eye turn away.. Laa Ta'duu (prt. neg. m. plu.): Do not transgress, violate.. 'Aad (act. pic. m. sing.): Transgressor; Who goes beyond the limits.. 'Aaduuna (act. pic. m. plu.): Transgressors; People who know no limits.. 'Adaytum (prf. 2nd. plu. III.): You are at enmity.. Yat'adda (imp. 3rd. m. sing. V): He trespasses, violates.. I'tadaa (prf. 3rd. m. sing. VIII): Violated.. I'tadan (prf. 3rd. m. plu. VIII.): They transgressed.. I'tadaina (prf. 1st. plu. VIII): We have transgressed.. Ya'taduuna (imp. 3rd. m. plu. VIII): They transgressed.. Ta'taduu (imp. 2nd. m. plu. acc. final Nun dropped): You transgress.. Li Ta'taduu (imp. 2nd. m. plu. el.): That you may transgress.. l'taduu (prt. m. plu.): You punish for violence, punish for transgression.. Laa Ta'taduu (prt. neg. m. plu.): You transgress not.. Mu'tadun (ap-der. m. sing.): Transgressor.. Mu'taduun \/ Mu'tadiin (acc. ap-der. m. sing.): Transgressor.. 'Adwan (v. n. acc.): Transgressing.. 'Aduwwun \/ 'Aduwwan (acc. v. n.): Enemy.. A'da'un (n. pl.): Enemies.. 'Udwaanun (v. n.): Violence; Punishment of violence; Harshness; Injustice; Transgression.. 'Adaawatun (v. n.): Enmity.. 'Udwatun (n.): Side; End.. 'Adiyaat (act. pic. f. plu.): Panting; Running; Coursers..  "
    },

    {
        "indexid":763,
        "wordid":5465,
        "word":"أَيْدِيكُمْ",
        "rootid":176,
        "rootword":"ي د ي",
        "meanings":"to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved.",
        "sentence":"The word أَيْدِيكُمْ comes from the root ي د ي and is associated with the meanings: to touch, aid, do good, be beneficent, show power and superiority, a hand. By his agency\/means.With a willing hand, out of hand, having financial ability.In acknowledgement of the superior power, in ready money and not in the form of deferred payment, considering it as a favour, on account of help, (payment should be made by the hand of the parties themselves without the intervention of a third party and without reluctance.baina yadaihi - before him, in his presence hit, between his two hands.ulill aidi - men of power (lit. gifted with hands)suqaita fi aidihim (idiomatic expression) they repented, the idea seems to be that they hit their fingers in grief and contrition.Handy, Might, Power, Superiority, Benefit, Possession, Favour, Generosity. The idea behind those expressions is that the use of the hand is the real source of the superiority and power. Under his authority, upper hand, arm, foreleg of a beast, handle of a tool, wing of a bird.ma qaddamat yada - that is what thou hast deserved."
    },

    {
        "indexid":763,
        "wordid":6553,
        "word":"الصَّيْدِ",
        "rootid":106,
        "rootword":"ص ي د",
        "meanings":"to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray.",
        "sentence":"The word الصَّيْدِ comes from the root ص ي د and is associated with the meanings: to hunt\/chase\/fish. saidun - hunting, shooting, fishing, fish or game caught, pray."
    },

    {
        "indexid":763,
        "wordid":7050,
        "word":"لَيَبْلُوَنَّكُمُ",
        "rootid":1473,
        "rootword":"ب ل و",
        "meanings":"Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening",
        "sentence":"The word لَيَبْلُوَنَّكُمُ comes from the root ب ل و and is associated with the meanings: Try, prove or test by good or evilTo become old and worn out, wear and tear, withered, decayedNot caring, minding, heeding, regarding or paying attentionConferring favors, benefits or blessingsSwearing oaths, covenantsInforming, acquainting, revealing, manifesting, making apparent, evident, clear or plainCompeting, striving or hastening"
    },

    {
        "indexid":763,
        "wordid":7051,
        "word":"تَنَالُهُ",
        "rootid":689,
        "rootword":"ن ي ل",
        "meanings":"to obtain\/procure, get, attain, reach, matter.",
        "sentence":"The word تَنَالُهُ comes from the root ن ي ل and is associated with the meanings: to obtain\/procure, get, attain, reach, matter."
    },

    {
        "indexid":763,
        "wordid":7052,
        "word":"وَرِمَاحُكُمْ",
        "rootid":1555,
        "rootword":"ر م ح",
        "meanings":"to pierce with a lance, spear.",
        "sentence":"The word وَرِمَاحُكُمْ comes from the root ر م ح and is associated with the meanings: to pierce with a lance, spear."
    },

    {
        "indexid":763,
        "wordid":7053,
        "word":"لِيَعْلَمَ",
        "rootid":904,
        "rootword":"ع ل م",
        "meanings":"to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows.",
        "sentence":"The word لِيَعْلَمَ comes from the root ع ل م and is associated with the meanings: to mark\/sign\/distinguish, creations\/beings, world, science\/learning\/knowledge\/information, aware\/know. By means of which one knows a thing, hence it signifies world or creation, because by it the Creator is known. alim (pl. ulama) - one who is learned\/wise or knows."
    },

    {
        "indexid":763,
        "wordid":7054,
        "word":"يَخَافُهُ",
        "rootid":488,
        "rootword":"خ و ف",
        "meanings":"To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight.",
        "sentence":"The word يَخَافُهُ comes from the root خ و ف and is associated with the meanings: To fear, to be afraid\/frightened\/terrified, to put fear into another, diminish or lessen or take from, to take little by little from a thing, take from the sides of a thing, slaughter or fight."
    }]}