{"data":[
    {
        "indexid":769,
        "wordid":2029,
        "word":"لَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word لَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":769,
        "wordid":2084,
        "word":"اللَّهَ",
        "rootid":279,
        "rootword":"ا ل ه",
        "meanings":"to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things.",
        "sentence":"The word اللَّهَ comes from the root ا ل ه and is associated with the meanings: to serve, worship or adore; to protect, grant refuge, preserve save, rescue, liberate; object of worship ie God; (Alif-Lam-Lam-ha) God, the one true God applied as a proper name denoting the true god, comprising all the excellent divine names; a unity comprising all the essences of existing things."
    },

    {
        "indexid":769,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":769,
        "wordid":2230,
        "word":"فَاتَّقُوا",
        "rootid":965,
        "rootword":"و ق ي",
        "meanings":"to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God.",
        "sentence":"The word فَاتَّقُوا comes from the root و ق ي and is associated with the meanings: to protect, save, preserve, ward off, guard against evil and calamity, be secure, take as a shield, regard the duty. muttaqii - one who guard against evil and against that which harms and injures and is regardful of his duty towards human beings and God."
    },

    {
        "indexid":769,
        "wordid":2764,
        "word":"قُلْ",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قُلْ comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":769,
        "wordid":3534,
        "word":"يَاأُولِي",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word يَاأُولِي comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":769,
        "wordid":3535,
        "word":"الْأَلْبَابِ",
        "rootid":1493,
        "rootword":"ل ب ب",
        "meanings":"To be gifted with a penetrative mind, be kind hearted, tender\/affectionate\/compassionate, remain\/dwelt & kept to it, expert\/clever, insightful, posessed of understanding\/intellect, mind.",
        "sentence":"The word الْأَلْبَابِ comes from the root ل ب ب and is associated with the meanings: To be gifted with a penetrative mind, be kind hearted, tender\/affectionate\/compassionate, remain\/dwelt & kept to it, expert\/clever, insightful, posessed of understanding\/intellect, mind."
    },

    {
        "indexid":769,
        "wordid":3650,
        "word":"تُفْلِحُونَ",
        "rootid":1356,
        "rootword":"ف ل ح",
        "meanings":"cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration.",
        "sentence":"The word تُفْلِحُونَ comes from the root ف ل ح and is associated with the meanings: cut\/slit\/crack\/split\/fissure, furrowed\/plough\/cultivate, agriculture, till the ground, to prosper be successful, attain\/acquire, become fortunate\/happy, become independent, permanence\/lastingness\/duration."
    },

    {
        "indexid":769,
        "wordid":6206,
        "word":"يَسْتَوِي",
        "rootid":1020,
        "rootword":"س و ي",
        "meanings":"to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst.",
        "sentence":"The word يَسْتَوِي comes from the root س و ي and is associated with the meanings: to be worth, equivalent to. sawwa - to level, complete, arrange, make uniform, even, congruous, consistent in parts, fashion in a suitable manner, make adapted to the exigencies or requirements, perfect a thing, put a thing into a right or good state. istawa - to establish, become firm or firmly settled, turn to a thing, to direct one's attention to a thing, mount. ala sawain - on terms of equality, i.e. in such a manner that each party should know that it is free of its obligations, at par. sawiyyun  -even, right, sound in mind and body. sawiyyan - being in sound health.. sawwa (vb. 2) to proportion, fashion, perfect, level, equal, fill the space. sawa - midst."
    },

    {
        "indexid":769,
        "wordid":7083,
        "word":"الْخَبِيثُ",
        "rootid":1060,
        "rootword":"خ ب ث",
        "meanings":"bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil.",
        "sentence":"The word الْخَبِيثُ comes from the root خ ب ث and is associated with the meanings: bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil."
    },

    {
        "indexid":769,
        "wordid":7084,
        "word":"وَالطَّيِّبُ",
        "rootid":404,
        "rootword":"ط ي ب",
        "meanings":"to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful.",
        "sentence":"The word وَالطَّيِّبُ comes from the root ط ي ب and is associated with the meanings: to be good, pleasant, agreeable, lawful. tibna - of their (women's) own free will and being good (to you). tuuba - joy, happiness, an enviable state of bliss. tayyib - good\/clean\/wholesome\/gentle\/excellent\/fair\/lawful."
    },

    {
        "indexid":769,
        "wordid":7085,
        "word":"أَعْجَبَكَ",
        "rootid":572,
        "rootword":"ع ج ب",
        "meanings":"to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder.",
        "sentence":"The word أَعْجَبَكَ comes from the root ع ج ب and is associated with the meanings: to wonder, marvel, be astonished, be amazed, delight, please, admire, astounding, matter of wonder."
    },

    {
        "indexid":769,
        "wordid":7086,
        "word":"كَثْرَةُ",
        "rootid":916,
        "rootword":"ك ث ر",
        "meanings":"To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous.",
        "sentence":"The word كَثْرَةُ comes from the root ك ث ر and is associated with the meanings: To surpass in number or quantity, increase, multiply, happen often; To be much, many, numerous."
    },

    {
        "indexid":769,
        "wordid":7087,
        "word":"الْخَبِيثِ",
        "rootid":1060,
        "rootword":"خ ب ث",
        "meanings":"bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil.",
        "sentence":"The word الْخَبِيثِ comes from the root خ ب ث and is associated with the meanings: bad\/foul\/abominable\/corrupt\/wicked\/deceitful, guileful\/artful\/crafty\/cunning, malignant\/noxious, impure\/unclean\/filthy, depraved\/disapproved\/hated\/unlawful\/disagreeable\/culpable\/disobedient, the worst or most wicked, evil."
    }]}