{"data":[
    {
        "indexid":780,
        "wordid":2078,
        "word":"ءَامَنَّا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامَنَّا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":780,
        "wordid":2102,
        "word":"قَالُوا",
        "rootid":1568,
        "rootword":"ق و ل",
        "meanings":"to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator.",
        "sentence":"The word قَالُوا comes from the root ق و ل and is associated with the meanings: to say\/speak, to call, to be named, word\/speech, utterance, a thing said, greeting, discourse, one who says\/speaks. To inspire\/transmit\/relate\/answer\/think\/profess, emit an opinion on, indicate a state or condition or circumstance. qa'ilun - speaker, indicator."
    },

    {
        "indexid":780,
        "wordid":2110,
        "word":"ءَامِنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word ءَامِنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":780,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":780,
        "wordid":2259,
        "word":"أَنْ",
        "rootid":1159,
        "rootword":"ا ن",
        "meanings":"",
        "sentence":"The word أَنْ comes from the root ا ن and is associated with the meanings: "
    },

    {
        "indexid":780,
        "wordid":3201,
        "word":"مُسْلِمُونَ",
        "rootid":652,
        "rootword":"س ل م",
        "meanings":"safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman.",
        "sentence":"The word مُسْلِمُونَ comes from the root س ل م and is associated with the meanings: safety\/security\/freedom\/immunity, to escape, salutation\/greeting\/peace, deliver\/acknowledge, pay in advance, submit, sincerity, humility, submission\/conformance\/obedience, resign\/quit\/relinquish, to be in sound condition, well without blemish, gentle\/tender\/soft\/elegant. Solomon\/Sulaiman."
    },

    {
        "indexid":780,
        "wordid":4848,
        "word":"وَاشْهَدْ",
        "rootid":1470,
        "rootword":"ش ه د",
        "meanings":"told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed.",
        "sentence":"The word وَاشْهَدْ comes from the root ش ه د and is associated with the meanings: told\/gave information, to witness\/see, to be present, give evidence\/testimony, bear witness. mushhad - time or place of being present or of giving or hearing evidence, meeting place. mashhuud - that which is witnessed."
    },

    {
        "indexid":780,
        "wordid":7156,
        "word":"الْحَوَارِيِّينَ",
        "rootid":754,
        "rootword":"ح و ر",
        "meanings":"(Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man.",
        "sentence":"The word الْحَوَارِيِّينَ comes from the root ح و ر and is associated with the meanings: (Ha-Alif-Ra) return\/recoil, change\/convert from one state\/condition to another, wash\/whiten, make round, surround, compete\/contend for glory\/superiority, the white around the eye, intense whiteness of the white of the eye and intense blackness of the black (with fairness around)* not found in humans but attributed to them by way of comparison. *likened to the eyes of gazelles\/cows\/bulls.One who whitens clothes\/garments by washing them, hence applied to the disciples\/apostles\/companions of Jesus (see \"hawariyyun\" in 3:52, 5:111, 5:112, 61:14) because their trade was apparently to do this. Or it is applied to one bearing the following significations: one who is freed and cleared of every vice, fault or defect, one who has been tried and proved time after time and found to be free of vices, faults or defects. A thing pure. One who advises\/counsels or acts sincerely\/honestly\/faithfully, friend\/assistant, fair woman\/man."
    },

    {
        "indexid":780,
        "wordid":7157,
        "word":"وَبِرَسُولِي",
        "rootid":859,
        "rootword":"ر س ل",
        "meanings":"to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth.",
        "sentence":"The word وَبِرَسُولِي comes from the root ر س ل and is associated with the meanings: to send a messenger, bestow, let go. rasul (pl. rusul) - envoy, bearer of a message, messenger. risalat - message, commission, mission, epistle. arsala (vb. 4) - to send. mursalat (pl. of mursalatun) - those sent forth."
    }]}