{"data":[
    {
        "indexid":805,
        "wordid":2076,
        "word":"مَنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مَنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":805,
        "wordid":3010,
        "word":"فَقَدْ",
        "rootid":1691,
        "rootword":"ق د",
        "meanings":"",
        "sentence":"The word فَقَدْ comes from the root ق د and is associated with the meanings: "
    },

    {
        "indexid":805,
        "wordid":5394,
        "word":"يَوْمَئِذٍ",
        "rootid":1376,
        "rootword":"ي و م",
        "meanings":"day, era, time, today, this\/that day, age\/period of time.",
        "sentence":"The word يَوْمَئِذٍ comes from the root ي و م and is associated with the meanings: day, era, time, today, this\/that day, age\/period of time."
    },

    {
        "indexid":805,
        "wordid":5683,
        "word":"الْفَوْزُ",
        "rootid":290,
        "rootword":"ف و ز",
        "meanings":"to succeed, gain victory, achieve a goal, triumph, get possession, obtain one's desires, escape, salvation, safety, acquire, gain. mafazatun - time\/place of safety\/refuge\/felicity\/serenity, of escape.",
        "sentence":"The word الْفَوْزُ comes from the root ف و ز and is associated with the meanings: to succeed, gain victory, achieve a goal, triumph, get possession, obtain one's desires, escape, salvation, safety, acquire, gain. mafazatun - time\/place of safety\/refuge\/felicity\/serenity, of escape."
    },

    {
        "indexid":805,
        "wordid":5821,
        "word":"عَنْهُ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":805,
        "wordid":7046,
        "word":"الْمُبِينُ",
        "rootid":74,
        "rootword":"ب ي ن",
        "meanings":"Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness",
        "sentence":"The word الْمُبِينُ comes from the root ب ي ن and is associated with the meanings: Becoming separated, severed, disunited, cut off or distinctApparent, manifest, plain, clear, known, distinguished from anotherDisunion and unionComing forthSeparation or division between two things (e.g. land)An evidence, an indication, demonstration, proof, argument that is clear, manifest (intellectual or perceptive\/perceived by sense), testimony of a witness"
    },

    {
        "indexid":805,
        "wordid":7257,
        "word":"يُصْرَفْ",
        "rootid":903,
        "rootword":"ص ر ف",
        "meanings":"to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside.",
        "sentence":"The word يُصْرَفْ comes from the root ص ر ف and is associated with the meanings: to turn away, divert, avert, propound, set forth, vary. sarfun - act of averting. masrifun - place to turn to, refuge. masruufun - averted. sarrafa (vb. 2) - to explain. tasrif - change (of wind). insarafa (vb. 7) - to turn aside."
    },

    {
        "indexid":805,
        "wordid":7258,
        "word":"رَحِمَهُ",
        "rootid":1089,
        "rootword":"ر ح م",
        "meanings":"Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving.",
        "sentence":"The word رَحِمَهُ comes from the root ر ح م and is associated with the meanings: Rahima - He favored, benefited, pardoned, or forgave him. To love, have tenderness, mercy, pity, forgiveness, have all that is required for exercising beneficence.. Tarhamu - He had mercy, pity, or compassion on him; he pitied or compassionated him much.. Arham - Wombs (singular) womb, i.e. place of origin. The receptacle of the young in the belly.. Ruhmun - Relationship, i.e. nearness of kin, connection by birth; relationship connecting with an ancestor. A connection or tie of relationship.. Rahman - it is active participle noun in the measure of fa'lan which conveys the idea of fullness and extensiveness.. Rahim - it is in the measure of fa'il which denotes the idea of constant repetition and giving."
    }]}