{"data":[
    {
        "indexid":817,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":817,
        "wordid":2095,
        "word":"كَانُوا",
        "rootid":369,
        "rootword":"ك و ن",
        "meanings":"(Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so.",
        "sentence":"The word كَانُوا comes from the root ك و ن and is associated with the meanings: (Kaf-Alif-Nun) To be, exist, happen, occur, take place, become, be such or so."
    },

    {
        "indexid":817,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":817,
        "wordid":2180,
        "word":"وَلَوْ",
        "rootid":384,
        "rootword":"ل و",
        "meanings":"(law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences.",
        "sentence":"The word وَلَوْ comes from the root ل و and is associated with the meanings: (law) - optative particle, if\/though\/although, conditional.Often at the start of verses\/sentences."
    },

    {
        "indexid":817,
        "wordid":2250,
        "word":"قَبْلُ",
        "rootid":816,
        "rootword":"ق ب ل",
        "meanings":"to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards.",
        "sentence":"The word قَبْلُ comes from the root ق ب ل and is associated with the meanings: to accept\/admit\/receive\/agree, meet anyone, to face\/encounter someone\/something, advance\/approach, correspond, counteract\/compare\/requite\/compensate, the front part (12:26), accept with approval, show favour.. qablu - before\/formerly,. qubulun - the fore-part, face to face, before, plural of qabilum,. qibalun - power, side, part,. qiblah - towards, in the direction of, facing, alongside,. qiblatun - anything before, opposite, the point in the direction of which prayer is performed, the Ka'bah at Makkah, a place of worship,. qabulun - favourable reception, gracious acceptance,. qabilun - tribe, host, plural qabilatun,. qabailun - tribe,. aqbala - to come near, draw near, approach, turn towards, rush upon,. taqabbala - to accept,. mutaqabilun - opposite to, facing one another,. mustaqbilun - proceeding towards, heading towards."
    },

    {
        "indexid":817,
        "wordid":2424,
        "word":"لِمَا",
        "rootid":1155,
        "rootword":"ل م ا",
        "meanings":"Why? For what reason?",
        "sentence":"The word لِمَا comes from the root ل م ا and is associated with the meanings: Why? For what reason?"
    },

    {
        "indexid":817,
        "wordid":2849,
        "word":"بَلْ",
        "rootid":1272,
        "rootword":"ب ل",
        "meanings":"",
        "sentence":"The word بَلْ comes from the root ب ل and is associated with the meanings: "
    },

    {
        "indexid":817,
        "wordid":5324,
        "word":"يُخْفُونَ",
        "rootid":1414,
        "rootword":"خ ف ي",
        "meanings":"Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed).",
        "sentence":"The word يُخْفُونَ comes from the root خ ف ي and is associated with the meanings: Imperceptible\/unapparent, hidden\/concealed\/covered, faint or dim to the sight, suppressed or stifled, obscure to the mind, to become manifest from a state of concealment (what was concealed became revealed)."
    },

    {
        "indexid":817,
        "wordid":5821,
        "word":"عَنْهُ",
        "rootid":1612,
        "rootword":"ع ن",
        "meanings":"",
        "sentence":"The word عَنْهُ comes from the root ع ن and is associated with the meanings: "
    },

    {
        "indexid":817,
        "wordid":6166,
        "word":"رُدُّوا",
        "rootid":1636,
        "rootword":"ر د د",
        "meanings":"to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro.",
        "sentence":"The word رُدُّوا comes from the root ر د د and is associated with the meanings: to send back, turn back, reject, refuse, repel, revert, restore, give back, refer, give again, take again, repeat, retrace. maraddun - place where one returns. mardud - restored, averted. irtadda (vb. 8) - to return, turn again, be rendered. taradda (vb. 5) - to be agitated, move to and fro."
    },

    {
        "indexid":817,
        "wordid":6485,
        "word":"نُهُوا",
        "rootid":556,
        "rootword":"ن ه ي",
        "meanings":"(Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain.",
        "sentence":"The word نُهُوا comes from the root ن ه ي and is associated with the meanings: (Nun-ha-Waw) to prevent, forbid, chide away, prohibit, make one to stop from, restrain, interdict, hinder, desist, refrain."
    },

    {
        "indexid":817,
        "wordid":7305,
        "word":"بَدَا",
        "rootid":970,
        "rootword":"ب د و",
        "meanings":"Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind.",
        "sentence":"The word بَدَا comes from the root ب د و and is associated with the meanings: Appearing\/being apparent\/open\/manifest\/plain\/evident\/shownDesert\/dwelling or abode in the desert, belonging\/relating to the desertGoing to encounter in battle or war\/showing open enmity, hostilityImitating people of the desertIn the first place, first of a thingTruffles or dust on earthEither side of a valleyVarious opinions arising in the mind."
    },

    {
        "indexid":817,
        "wordid":7306,
        "word":"لَعَادُوا",
        "rootid":809,
        "rootword":"ع و د",
        "meanings":"to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day.",
        "sentence":"The word لَعَادُوا comes from the root ع و د and is associated with the meanings: to return, turn away, come back, repeat, restore. aidun - one who returns. ma'adun - place where one returns, another name of Makkah. a'ada (vb. 4) - to cause to return, restore. The verb a'ada is transitive to mean to get some one return or cause to return or bring back (what has passed away).. AAad - An Arab tribe which lived in the south of the Arabian peninsula and occupied land extending from the north of the Persian Gulf to the southern end of the Red Sea. The tribe of AAad spoken of in The Quran is also called the first\/ancient AAad (53:50) in order to distinguish them from the people of Thamud who are called the second AAad. The Adramites of Yemen mentioned in the Greek history are considered to be this tribe.. . 'Aada (prf. 3rd. m. sing.): Returned; Reverted.. 'Aaduu (prf. 3rd. m. plu.): They returned, reverted.. 'Udtum (prf. 2nd. plu.): You returned.. 'Udnaa (prf. 1st. plu.): We returned.. Yu'uuduuna (imp. 3rd. m. plu.): They return.. Ya'uuduu (imp. 3rd. m. plu. final Nun drop.): You return.. Ta'uuduuna (imp. 2nd. m. plu.): Ye return.. Ta'uuduu (imp. 2nd. m. plu. final Nun dropped).. Ta'uudunna (imp. 2nd. m. sing. imp.): Assuredly ye shall return.. Na'uudu (imp. 1st. plu.): We return.. Na'ud .W (imp. 1st. plu. Waw dropped): We return.. Yu'iidu (imp. 3rd. m. sing. IV): They shall repeat, return.. Yu'iiduu (final Nun dropped): They restore, make (you) revert to.. Nu'iidu (imp. 1st. plu.): We restore; We will make you return.. 'Uiiduu (pip. 3rd. m. plu. IV): They will be hurled back.. A'iiduuna (act. pic. m. plu.): Those who return.. Ma'aadun (n.): Place of return; Home.. 'Idan: Ever recurring; Festival; Periodical; Feast day."
    },

    {
        "indexid":817,
        "wordid":7308,
        "word":"لَكَاذِبُونَ",
        "rootid":29,
        "rootword":"ك ذ ب",
        "meanings":"To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of.",
        "sentence":"The word لَكَاذِبُونَ comes from the root ك ذ ب and is associated with the meanings: To lie, say what is not a fact, lie to falsely invent, tell lies about or against, fabricate a lie, relate a lie, say a falsehood, be wrong, be cut off, deceive, disappoint the expectation of."
    }]}