{"data":[
    {
        "indexid":827,
        "wordid":2024,
        "word":"وَلَا",
        "rootid":1400,
        "rootword":"ل ا",
        "meanings":"",
        "sentence":"The word وَلَا comes from the root ل ا and is associated with the meanings: "
    },

    {
        "indexid":827,
        "wordid":2045,
        "word":"وَمَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word وَمَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":827,
        "wordid":2046,
        "word":"مِنْ",
        "rootid":367,
        "rootword":"م ن",
        "meanings":"From",
        "sentence":"The word مِنْ comes from the root م ن and is associated with the meanings: From"
    },

    {
        "indexid":827,
        "wordid":2053,
        "word":"رَبِّهِمْ",
        "rootid":365,
        "rootword":"ر ب ب",
        "meanings":"to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion.",
        "sentence":"The word رَبِّهِمْ comes from the root ر ب ب and is associated with the meanings: to be a lord and master, collect, possess\/owner, rule, increase, complete, bring up, preserve, chief, determiner, provider, sustainer, perfecter, rewarder, creator, maintainer, reposer of properties, developer, former of rules and laws of the growth, foster a thing in such a manner as to make it attain one condition after another until it reaches its goal of completion."
    },

    {
        "indexid":827,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":827,
        "wordid":2101,
        "word":"الْأَرْضِ",
        "rootid":32,
        "rootword":"ا ر ض",
        "meanings":"To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite.",
        "sentence":"The word الْأَرْضِ comes from the root ا ر ض and is associated with the meanings: To rotate, bring forth herbs abundantly. Land abundant, fruitful, productive, luxuriant with herbage. Place for alighting or abiding. To tarry, await, expect, be patient. \"Earth, as opposed to heaven: and the ground, as meaning the surface of the earth, on which we tread, and sit, and lie\". Good land. Remain, fixed, tarry in expectation [on the ground]. Heavy, slow, sluggish, inclining, or propending to the ground. Submissive. A carpet, anything that is spread. A tremor, vertigo arising from a relaxed state. Wood-fretter, termite."
    },

    {
        "indexid":827,
        "wordid":2119,
        "word":"إِلَى",
        "rootid":984,
        "rootword":"ا ل ي",
        "meanings":"",
        "sentence":"The word إِلَى comes from the root ا ل ي and is associated with the meanings: "
    },

    {
        "indexid":827,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":827,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":827,
        "wordid":2811,
        "word":"الْكِتَابِ",
        "rootid":1237,
        "rootword":"ك ت ب",
        "meanings":"he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop.",
        "sentence":"The word الْكِتَابِ comes from the root ك ت ب and is associated with the meanings: he wrote it, to dictate it, prescribe\/appoint\/ordain, judged \/ passed sentence \/ decreed, drew\/brought together, collected, conjoined \/ bound, he sewed it, what is written (e.g. of law), mode\/manner of writing, book, bookseller, a thing in which or on which one writes, record\/register\/writ, revealed scripture, a writer\/scribe\/secretary, an army\/military force, troop."
    },

    {
        "indexid":827,
        "wordid":3410,
        "word":"دَابَّةٍ",
        "rootid":1326,
        "rootword":"د ب ب",
        "meanings":"(or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main.",
        "sentence":"The word دَابَّةٍ comes from the root د ب ب and is associated with the meanings: (or Dal-Ba with a tashdeed on the Ba) to go gently, crawl\/creep\/walk, hit, expine, flow, throw.Whatsoever moves on earth especially beasts of burden, quadraped, beast, moving creature, insect, creature on earth, materialistic person whose endeavors are wholly directed to the acquisition of worldy riches and material comforts and who has fallen on the pleasures of this world with all his might and main."
    },

    {
        "indexid":827,
        "wordid":7317,
        "word":"فَرَّطْنَا",
        "rootid":200,
        "rootword":"ف ر ط",
        "meanings":"to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left.",
        "sentence":"The word فَرَّطْنَا comes from the root ف ر ط and is associated with the meanings: to precede, neglect, remiss, omit, excess, forsake, act hastily or unjustly, fall short, exceed bounds, be extravagant\/excessive, injustice, outstrip others. mufratun - to be sent in advance and abandoned and left."
    },

    {
        "indexid":827,
        "wordid":7349,
        "word":"طَائِرٍ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word طَائِرٍ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":827,
        "wordid":7350,
        "word":"يَطِيرُ",
        "rootid":64,
        "rootword":"ط ي ر",
        "meanings":"flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune.",
        "sentence":"The word يَطِيرُ comes from the root ط ي ر and is associated with the meanings: flew, hasten to it, outstripped, become foremost, fled, love, become attached, famous, conceive, scatter\/disperse, fortune."
    },

    {
        "indexid":827,
        "wordid":7351,
        "word":"بِجَنَاحَيْهِ",
        "rootid":1378,
        "rootword":"ج ن ح",
        "meanings":"to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame.",
        "sentence":"The word بِجَنَاحَيْهِ comes from the root ج ن ح and is associated with the meanings: to lean\/incline, to bend\/stoop, side.ribs of the breast, upper\/anterior ribs next to the breast\/heart (so-called because they incline over the heart), something one uses to lean on\/to one side (upper-arm, shoulder, elbow, hand),wing\/power, \"lower your wing\" is an idiomatic metaphor for love\/tenderness\/humility, evocative of a bird that lovingly spreads its wings over its offspring in the nest, shadow\/shelter\/protection, armpit,assistant,going quickly\/swiftly (said of an animal due to them leaning forward as they run),a sin or crime, act of disobedience\/blame."
    },

    {
        "indexid":827,
        "wordid":7352,
        "word":"أُمَمٌ",
        "rootid":1056,
        "rootword":"ا م م",
        "meanings":"ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of",
        "sentence":"The word أُمَمٌ comes from the root ا م م and is associated with the meanings: ammina: to propose, direct one's steps towards a place, repair to, go towards [5:2]. ummun\/umm: mother, source, principle, prototype, origin, prototype;. ummi: belonging to mother, unlettered, Arab, who have no revealed scripture of their own;. ummatun: a man's kinsfolk, tribe, party, community, nation, group of living things having certain characteristics or circumstances in common, any grouping of human or animal, creation, generation, creatures of God;. ummah: way\/course\/manner\/mode of acting, faith, religion, nation, , time or period of time, righteous person, a person who is an object of imitation and who is known for goodness\/virtues;. imam: leader, president, any object that is followed (e.g. human\/book\/highway), model, example, pattern;. amama: before, in front of"
    },

    {
        "indexid":827,
        "wordid":7353,
        "word":"أَمْثَالُكُمْ",
        "rootid":353,
        "rootword":"م ث ل",
        "meanings":"Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent.",
        "sentence":"The word أَمْثَالُكُمْ comes from the root م ث ل and is associated with the meanings: Stand erect, mutilate or castrate (namely a sheep or goat), to set up a thing, affect to be like or to imitate a thing, apply a proverb, apply a thing proverbially, be nearly in a sound or healthy state, near to convalescence, obey\/follow a command or order, to resemble, be of likeness or equivalent."
    },

    {
        "indexid":827,
        "wordid":7354,
        "word":"يُحْشَرُونَ",
        "rootid":761,
        "rootword":"ح ش ر",
        "meanings":"To gather together, raise from the dead, banish.",
        "sentence":"The word يُحْشَرُونَ comes from the root ح ش ر and is associated with the meanings: To gather together, raise from the dead, banish."
    }]}