{"data":[
    {
        "indexid":833,
        "wordid":2143,
        "word":"مَا",
        "rootid":615,
        "rootword":"م ا",
        "meanings":"",
        "sentence":"The word مَا comes from the root م ا and is associated with the meanings: "
    },

    {
        "indexid":833,
        "wordid":2185,
        "word":"كُلِّ",
        "rootid":514,
        "rootword":"ك ل ل",
        "meanings":"To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations.",
        "sentence":"The word كُلِّ comes from the root ك ل ل and is associated with the meanings: To lose father and child, lose direct heirs, be weary, tired, weak, have only remote relations."
    },

    {
        "indexid":833,
        "wordid":2186,
        "word":"شَيْءٍ",
        "rootid":1622,
        "rootword":"ش ي ا",
        "meanings":"to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\".",
        "sentence":"The word شَيْءٍ comes from the root ش ي ا and is associated with the meanings: to will\/wish. shaiun (pl. ashyaa'un) - thing\/matter, affair in any way, at all, what is willed or wished, aught, any extent. In direct objective case it is often used to denote the meaning \"a little\", \"bit\", \"at all\". Adverbially it means \"in any way\", \"at all\"."
    },

    {
        "indexid":833,
        "wordid":2936,
        "word":"أُوتُوا",
        "rootid":626,
        "rootword":"ا ت ي",
        "meanings":"to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake",
        "sentence":"The word أُوتُوا comes from the root ا ت ي and is associated with the meanings: to come, to bring, come to pass, come upon, do, commit, arrive, pursue, put forth, show, increase, produce, pay, reach, happen, overtake, draw near, go, hit, meet, join, be engaged or occupied, perpetrate (e.g. crime), undertake"
    },

    {
        "indexid":833,
        "wordid":6648,
        "word":"ذُكِّرُوا",
        "rootid":0,
        "rootword":"ذ ك ر",
        "meanings":"to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur).",
        "sentence":"The word ذُكِّرُوا comes from the root ذ ك ر and is associated with the meanings: to remember\/commemorate\/recollect, study in order to remember, remind, bear in mind, mindful, mention\/tell\/relate, magnify\/praise, admonish\/warn (e.g. dhikra is the 2nd declenation and it is stronger than dhikr), preach, extol, give status.nobility\/eminence\/honour, fame, good report, cause of good reputation, means of exaltation.Male\/man\/masculine (dhakar, dual - dhakarain, plural - dhukur)."
    },

    {
        "indexid":833,
        "wordid":7315,
        "word":"بَغْتَةً",
        "rootid":1502,
        "rootword":"ب غ ت",
        "meanings":"Suddenly, unexpectedly, unawares, surprisingly or with previous causeA festival, namely EasterConfounded, perplexed or unable to see straight",
        "sentence":"The word بَغْتَةً comes from the root ب غ ت and is associated with the meanings: Suddenly, unexpectedly, unawares, surprisingly or with previous causeA festival, namely EasterConfounded, perplexed or unable to see straight"
    },

    {
        "indexid":833,
        "wordid":7372,
        "word":"نَسُوا",
        "rootid":570,
        "rootword":"ن س ي",
        "meanings":"to forsake\/forget\/neglect, pretend to forget.",
        "sentence":"The word نَسُوا comes from the root ن س ي and is associated with the meanings: to forsake\/forget\/neglect, pretend to forget."
    },

    {
        "indexid":833,
        "wordid":7373,
        "word":"فَتَحْنَا",
        "rootid":541,
        "rootword":"ف ت ح",
        "meanings":"to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures.",
        "sentence":"The word فَتَحْنَا comes from the root ف ت ح and is associated with the meanings: to open, explain, grant, disclose, let out, give victory, conquer, judge, decide, ask for assistance\/judgement\/decision, seek succour\/victory. mafatih (pl. of miftah) - keys\/treasures."
    },

    {
        "indexid":833,
        "wordid":7374,
        "word":"أَبْوَابَ",
        "rootid":154,
        "rootword":"ب و ب",
        "meanings":"door\/gate, place of entrance, mode\/manner.",
        "sentence":"The word أَبْوَابَ comes from the root ب و ب and is associated with the meanings: door\/gate, place of entrance, mode\/manner."
    },

    {
        "indexid":833,
        "wordid":7375,
        "word":"فَرِحُوا",
        "rootid":778,
        "rootword":"ف ر ح",
        "meanings":"to be glad\/happy\/delighted\/cheerful\/pleased, rejoice, exult, who exults, lively.",
        "sentence":"The word فَرِحُوا comes from the root ف ر ح and is associated with the meanings: to be glad\/happy\/delighted\/cheerful\/pleased, rejoice, exult, who exults, lively."
    },

    {
        "indexid":833,
        "wordid":7376,
        "word":"أَخَذْنَاهُمْ",
        "rootid":320,
        "rootword":"ا خ ذ",
        "meanings":"",
        "sentence":"The word أَخَذْنَاهُمْ comes from the root ا خ ذ and is associated with the meanings: "
    },

    {
        "indexid":833,
        "wordid":7377,
        "word":"مُبْلِسُونَ",
        "rootid":94,
        "rootword":"ب ل س",
        "meanings":"despair, give up hope, become broken (in spirit), mournful, become silent\/confounded\/perplexed unable to see right way or course, repent\/grieve.",
        "sentence":"The word مُبْلِسُونَ comes from the root ب ل س and is associated with the meanings: despair, give up hope, become broken (in spirit), mournful, become silent\/confounded\/perplexed unable to see right way or course, repent\/grieve."
    }]}