{"data":[
    {
        "indexid":899,
        "wordid":2062,
        "word":"لَمْ",
        "rootid":415,
        "rootword":"ل م",
        "meanings":"Negative particle giving to the present the sense of the perfect; not.",
        "sentence":"The word لَمْ comes from the root ل م and is associated with the meanings: Negative particle giving to the present the sense of the perfect; not."
    },

    {
        "indexid":899,
        "wordid":2090,
        "word":"فِي",
        "rootid":1299,
        "rootword":"ف ي",
        "meanings":"Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of.",
        "sentence":"The word فِي comes from the root ف ي and is associated with the meanings: Proposition which points to cause, space or time. In, into, amongst, in company with, during, with, of, for, for the sake of, upon, concerning, after, in comparison, about, among, on account of, respecting, by the side of, on, by, against, according to, in respect of."
    },

    {
        "indexid":899,
        "wordid":2128,
        "word":"يَعْمَهُونَ",
        "rootid":906,
        "rootword":"ع م ه",
        "meanings":"to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness.",
        "sentence":"The word يَعْمَهُونَ comes from the root ع م ه and is associated with the meanings: to be confounded\/perplexed\/confused, wander blindly, stumble to and fro, unable to find the right course, mental blindness."
    },

    {
        "indexid":899,
        "wordid":2426,
        "word":"أَوَّلَ",
        "rootid":1141,
        "rootword":"ا و ل",
        "meanings":"To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance.",
        "sentence":"The word أَوَّلَ comes from the root ا و ل and is associated with the meanings: To return, be before, come back to. To interpret [by consideration], explain. To contract, withdraw, become. To preside over, hold command or authority. To come to be. To put in a proper state\/condition, or to compose [an affair]. To resort to; namely [a thing of any kind; the thing or place whence he or it originated, or came. His or its origin or source; his or its original state, condition, quantity, weight; any place. A former action, saying, or the like]. To return or restore to [ a thing, place, or disposition]. To explain, expound, interpret [collecting the meanings of dubious expressions by such expression as is clear, or plain, without dubiousness]. To explain the meaning of that which is equivocal or ambiguous. To be seen from a distance."
    },

    {
        "indexid":899,
        "wordid":2726,
        "word":"يُؤْمِنُوا",
        "rootid":1671,
        "rootword":"ا م ن",
        "meanings":"become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission",
        "sentence":"The word يُؤْمِنُوا comes from the root ا م ن and is associated with the meanings: become\/feel safe\/secure, state of security\/safety, trust, become quiet\/tranquil in heart\/mind, become free of expectation of evil or free of an object of dislike\/hatred, promise\/assurance of security\/safety, become trustful\/faithful\/confident, to believe\/acknowledge it, manifestation of humility\/submission"
    },

    {
        "indexid":899,
        "wordid":7615,
        "word":"مَرَّةٍ",
        "rootid":1074,
        "rootword":"م ر ر",
        "meanings":"To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile.",
        "sentence":"The word مَرَّةٍ comes from the root م ر ر and is associated with the meanings: To pass or pass by or pass beyond, proceed, go along or go through or go over, go away or pass away, to run or flow (namely water), go across a thing, come upon, overcome, make a thing bitter or displeasing, to drag a thing along, to twist or turn a thing in an attempt to throw it down, to go on in a continuous\/constant manner or course, to be firm\/resolute\/determined\/strong, firmly resist a thing, to murmur or grumble, to shake or quiver or quake, move to and fro or from side to side, to be in a state of commotion, overcome by bile."
    },

    {
        "indexid":899,
        "wordid":7704,
        "word":"وَنُقَلِّبُ",
        "rootid":1199,
        "rootword":"ق ل ب",
        "meanings":"To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns.",
        "sentence":"The word وَنُقَلِّبُ comes from the root ق ل ب and is associated with the meanings: To turn, return, repentance and grief, turn a thing upside down, change, change direction, turn it about to it's face and back, turn inside out, change condition.. qalb = heart. mutaqallabun - time or place where any one is busily employed. munqalabin - place or time of turmoil, reverse, turn, the end. munqalibun - one who returns."
    },

    {
        "indexid":899,
        "wordid":7705,
        "word":"أَفْئِدَتَهُمْ",
        "rootid":960,
        "rootword":"ف ا د",
        "meanings":"to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind.",
        "sentence":"The word أَفْئِدَتَهُمْ comes from the root ف ا د and is associated with the meanings: to hurt in the heart, be affected with heart disease, be struck in the heart. Motion, putting in motion When said of fuel; It burned, burned up, burned brightly or fiercely, blazed, or flamed: and so when said of the heart; It became excited with ardour, or eagerness. Heart, mind\/intellect, sharpness\/acuteness of mind."
    },

    {
        "indexid":899,
        "wordid":7706,
        "word":"وَأَبْصَارَهُمْ",
        "rootid":1531,
        "rootword":"ب ص ر",
        "meanings":"Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion.",
        "sentence":"The word وَأَبْصَارَهُمْ comes from the root ب ص ر and is associated with the meanings: Becoming perceptive, mental perception, having belief or knowledge, understanding, intelligence or skill, knowing, giving light, shining, illuminated, making manifest, evident and\/or apparent.To behold\/perceive\/see\/observe\/watch.Opening the eyes and\/or seeing (seldom used unless mental perception is conjoined)Clear sightThickness of anythingSense of sight, making or causing to see and\/or have sight, eye-sight, eyes.Soft stones having some whitenessIntent or a hard glanceA watcher or guard, a lion."
    },

    {
        "indexid":899,
        "wordid":7707,
        "word":"وَنَذَرُهُمْ",
        "rootid":717,
        "rootword":"و ذ ر",
        "meanings":"to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist.",
        "sentence":"The word وَنَذَرُهُمْ comes from the root و ذ ر and is associated with the meanings: to leave\/forsake\/neglect, fall upon, wound, cut in slices, let, desist."
    }]}